// ### AUTO-GENERATED ###

enum class MouseButton {
	Unknown = 0xFF,
	Left = 0x0,
	Middle = 0x1,
	Right = 0x2,
};

enum class FadeMode {
	eFadeColor = 0x0,
	eFadeTexture = 0x1,
};

enum class DriverActions {
	eLookingLeft = 0x0,
	eLookingRight = 0x1,
	eDeprecated_2 = 0x2,
	eDeprecated_1 = 0x3,
	eHeadlightsSwitch = 0x4,
	eChangingCamera = 0x5,
	eHorn = 0x6,
	eShiftingUp = 0x7,
	eShiftingDown = 0x8,
	eLookingBack = 0x9,
	eHeadlightsFlash = 0xA,
	eTcUp = 0xB,
	eTcDown = 0xC,
	eAbsUp = 0xD,
	eAbsDown = 0xE,
	eTurboUp = 0xF,
	eTurboDown = 0x10,
	eBrakeBiasUp = 0x11,
	eBrakeBiasDown = 0x12,
	eDRS = 0x13,
	eKERS = 0x14,
	eEngineBrakeUp = 0x15,
	eEngineBrakeDown = 0x16,
	eMGUKDeliveryUp = 0x17,
	eMGUKDeliveryDown = 0x18,
	eMGUKRecoveryUp = 0x19,
	eMGUKRecoveryDown = 0x1A,
	eMGUHMode = 0x1B,
};

enum class JumpStartPenaltyMode {
	eLockOnGridMode = 0x0,
	eTeleportToPitMode = 0x1,
	eDriveThroughMode = 0x2,
};

enum class SessionType {
	Undefined = 0x0,
	Pratice = 0x1,
	Qualify = 0x2,
	Race = 0x3,
	Hotlap = 0x4,
	TimeAttack = 0x5,
	Drift = 0x6,
	Drag = 0x7,
};

enum class DifferentialType {
	LSD = 0x0,
	Spool = 0x1,
};

enum class GearChangeRequest {
	eNoGearRequest = 0x0,
	eChangeUp = 0x1,
	eChangeDown = 0x2,
	eChangeToGear = 0x3,
};

enum class eReplayStatus {
	eReplayPlay = 0x0,
	eReplayPause = 0x1,
	eReplayStop = 0x2,
	eReplayRewind = 0x3,
	eReplayFastForward = 0x4,
	eReplaySlowMotion = 0x5,
	eReplayModeEnter = 0x6,
	eReplayModeExit = 0x7,
	eReplayChangeCar = 0x8,
	eReplayClearing = 0x9,
	eReplaySliderInteraction = 0xA,
	ePhotoMode = 0xB,
	eSingleFrame = 0xC,
};

enum class VoteType {
	eVoteNextSession = 0x0,
	eVoteRestartSession = 0x1,
	eVoteKickUser = 0x2,
	eVoteUnkonw = 0x3,
};

enum class eTimeLineCheckResponse {
	eOutOfRange = 0x0,
	eNegativeSide = 0x1,
	ePositiveSide = 0x2,
};

enum class PenaltyDescription {
	eNothing = 0x0,
	eJumpStart = 0x1,
	eCantPitPenalty = 0x2,
	eMandatoryPit = 0x3,
	eCut = 0x4,
};

enum class eACEventType {
	acEvent_OnCollision = 0x0,
};

enum class DrivableCamera {
	eChase = 0x0,
	eChase2 = 0x1,
	eBonnet = 0x2,
	eBumper = 0x3,
	eDash = 0x4,
};

enum class CameraMode {
	eCockpit = 0x0,
	eCar = 0x1,
	eDrivable = 0x2,
	eTrack = 0x3,
	eHelicopter = 0x4,
	eOnBoardFree = 0x5,
	eFree = 0x6,
	eDeprecated = 0x7,
	eImageGeneratorCamera = 0x8,
	eStart = 0x9,
};

enum class DRWWingConnectionMode {
	UseEffect = 0x0,
	UseAngle = 0x1,
};

enum class KGLTexture_ImageFileFormat {
	eDDS = 0x0,
	ePNG = 0x1,
	eJPG = 0x2,
	eBMP = 0x3,
	eUnknown = 0x4,
};

enum class TelemetryUnits {
	eUnitMeters = 0x0,
	eUnitC = 0x1,
	eUnitG = 0x2,
	eUnitRadSec = 0x3,
	eUnitGeneric = 0x4,
	eUnitMeterSec = 0x5,
	eUnitBar = 0x6,
	eUnitMS = 0x7,
	eUnitNumber = 0x8,
	eUnitPercentage = 0x9,
	eUnitPowerWatt = 0xA,
	eUnitVolumeMQ = 0xB,
	eUnitVoltageV = 0xC,
	eUnitTorqueNM = 0xD,
	eUnitRad = 0xE,
	eUnitForceN = 0xF,
	eUnitMillimiters = 0x10,
	eUnitDeg = 0x11,
	eUnitForceKG = 0x12,
	eUnitRPM = 0x13,
};

enum class PenaltyType {
	eNothing = 0x0,
	eSecsOnResult5 = 0x1,
	eSecsOnResult10 = 0x2,
	eSecsOnResult20 = 0x3,
	eSecsOnResult30 = 0x4,
	eDriveThrough = 0x5,
	eStopAndGo = 0x6,
};

enum class eRenderTargetFormat {
	eOriginalTarget = 0x0,
	eR8G8B8A8 = 0x1,
	eR16G16B16A16 = 0x2,
	eR32F = 0x3,
	eR32Typeless = 0x4,
	eR32Typeless_MS = 0x5,
	eR16F = 0x6,
	eR16G16B16A16_MS = 0x7,
	eR8G8B8A8_MS = 0x8,
};

enum class FlagEventType {
	BlackFlag = 0x0,
	BlackFlagClear = 0x1,
};

enum class eVariableType {
	eFloat = 0x0,
	eFloat2 = 0x1,
	eFloat3 = 0x2,
	eFloat4 = 0x3,
	eMatrix = 0x4,
	eTypeUndefined = 0x5,
};

enum class TimeLineType {
	Default = 0x0,
	ABStart = 0x1,
	ABFinish = 0x2,
};

enum class ILType {
	Default = 0x0,
	Skinned = 0x1,
	Particle = 0x2,
	GUI2D = 0x3,
};

enum class PixelFormat {
	eUnknownFormat = 0x0,
	eRGBA8 = 0x1,
	eRGBA32 = 0x2,
	eBC3Unorm = 0x3,
};

enum class OpenTrackTimeState {
	NotStarted = 0x0,
	Started = 0x1,
};

enum class eFontAlign {
	eAlignLeft = 0x0,
	eAlignRight = 0x1,
	eAlignCenter = 0x2,
};

enum class eFontType {
	eFontProportional = 0x0,
	eFontMonospaced = 0x1,
	eFontCustom = 0x2,
};

enum class CarSetupState {
	UnKnown = 0x0,
	Legal = 0x1,
	Illegal = 0x2,
};

enum class FFPostProcessType {
	Gamma = 0x0,
	Lut = 0x1,
};

enum class RenderPassID {
	Opaque = 0x0,
	Transparent = 0x1,
	Shadowgen = 0x2,
};

enum class DynamicControllerInput {
	UndefinedInput = 0x0,
	Brake = 0x1,
	Gas = 0x2,
	LatG = 0x3,
	LonG = 0x4,
	Steer = 0x5,
	Speed = 0x6,
	Gear = 0x7,
	SlipRatioMAX = 0x8,
	SlipRatioAVG = 0x9,
	SlipAngleFrontAVG = 0xA,
	SlipAngleRearAVG = 0xB,
	SlipAngleFrontMAX = 0xC,
	SlipAngleRearMAX = 0xD,
	OversteerFactor = 0xE,
	RearSpeedRatio = 0xF,
	SteerDEG = 0x10,
	Const = 0x11,
	RPMS = 0x12,
	WheelSteerDEG = 0x13,
	LoadSpreadLF = 0x14,
	LoadSpreadRF = 0x15,
	AvgTravelRear = 0x16,
	SusTravelLR = 0x17,
	SusTravelRR = 0x18,
};

enum class DynamicControllerCombinatorMode {
	eUndefinedMode = 0x0,
	eAdd = 0x1,
	eMult = 0x2,
};

enum class BlendMode {
	eOpaque = 0x0,
	eAlphaBlend = 0x1,
	eAlphaToCoverage = 0x2,
};

enum class CullMode {
	eCullFront = 0x0,
	eCullBack = 0x1,
	eCullNone = 0x2,
	eCullBiased = 0x3,
	eCullWireFrame = 0x4,
	eCullFrontNoMS = 0x5,
};

enum class DepthMode {
	eDepthNormal = 0x0,
	eDepthNoWrite = 0x1,
	eDepthOff = 0x2,
	eDepthLessEqual = 0x3,
};

enum class ksgui_VariableConnection {
	ConnectFloat = 0x0,
	ConnectInt = 0x1,
};

enum class CustomSpinnerMode {
	eStandardSpinner = 0x0,
	eCircularSpinner = 0x1,
	eVerticalSpinBar = 0x2,
};

enum class DynamicWingController_eInputVar {
	eUndefined = 0x0,
	eBrake = 0x1,
	eGas = 0x2,
	eLatG = 0x3,
	eLonG = 0x4,
	eSteer = 0x5,
	eSpeed = 0x6,
	SusTravelLR = 0x7,
	SusTravelRR = 0x8,
};

enum class DynamicWingController_eCombinatorMode {
	eUndefinedMode = 0x0,
	eAdd = 0x1,
	eMult = 0x2,
};

enum class ksgui_eActiveButtonStates {
	eABUnselected = 0x0,
	eABSelected = 0x1,
	eABRollOver = 0x2,
};

enum class eAISplineInterpolationMode {
	eLinear = 0x0,
	eBezier = 0x1,
	eCatmulRom = 0x2,
	eBSpline = 0x3,
	eNThBezier = 0x4,
	eCubicSpline = 0x5,
};

enum class eTaskBarStatus {
	eSelected = 0x0,
	eUnselected = 0x1,
};

enum class ksgui_eArrowsDirection {
	eLeft = 0x0,
	eRight = 0x1,
	eUp = 0x2,
	eDown = 0x3,
};

enum class RigidAxleSide {
	Left = 0x0,
	Right = 0x1,
};

enum class eGLPrimitiveType {
	eLines = 0x0,
	eLinesStrip = 0x1,
	eTriangles = 0x2,
	eQuads = 0x3,
};

enum class ksgui_eListBoxSelectionMode {
	eLineSelected = 0x0,
	eTextHighlighted = 0x1,
};

enum class PenaltyMode {
	CutGas = 0x0,
	InvalidateLap = 0x1,
	RecoverTime = 0x2,
	Nothing = 0x3,
	CutDetection = 0x4,
};

enum class KersAttachment {
	Engine = 0x0,
	Wheels = 0x1,
};

enum class eCameraClearMode {
	eColor = 0x0,
	eDepth = 0x1,
	eColorAndDepth = 0x2,
	eDontClear = 0x3,
};

enum class eAxisRendering {
	eAxisNone = 0x0,
	eAxisBefore3d = 0x1,
	eAxisAfter3d = 0x2,
	eAxisModelBefore3d = 0x3,
	eAxisModelAfter3d = 0x4,
};

enum class FindTyreCompoundLogic {
	Random = 0x0,
	Fastest = 0x1,
	Preferred = 0x2,
};

enum class SamplerState {
	eDefaultSampler = 0x0,
	eLinearClamped = 0x1,
};

enum class EBBMode {
	Disabled = 0x0,
	Internal = 0x1,
	DynamicController = 0x2,
};

enum class TractionType {
	RWD = 0x0,
	FWD = 0x1,
	AWD = 0x2,
	AWD_NEW = 0x3,
};

enum class TorqueModeEX {
	original = 0x0,
	reactionTorques = 0x1,
	driveTorques = 0x2,
};

enum class SuspensionType {
	DoubleWishbone = 0x0,
	Strut = 0x1,
	Axle = 0x2,
	Multilink = 0x3,
};

class CarAvatar;
class ESCMenu;
class Car;
struct SVar;
struct dxGeom;
class RenderWindow;
class ksgui_ScrollBar;
class ksgui_Control;
class ksgui_Slider;
struct TyreThermalPatch;
class ksgui_Spinner;
class ksgui_CheckBox;
struct HWND__;
struct HINSTANCE__;
class IJoint;
class ICollisionObject;
class IRigidBody;
class Camera;
class Node;
class IMaterialOptionChangeListener;
class ksgui_ListBox;
struct ksgui_ListBoxRowData;
class ICarControlsProvider;
class NetCarStateProvider;
class Wing;
class GraphicsManager;
struct SurfaceDef;
class InputDevice;
class DirectInput;
struct RayCastResult;
class IRayCaster;
class Shader;
class Game;
class GameObject;
class CBuffer;
class RaceManager;
class ShaderVariable;
class ShaderResource;
class Joypad;
class Task;
class Sim;
class CameraForward;
class Suspension;
class CarControls;
struct CarControlsInput;
class Track;
class AISpline;
struct dxTriMeshData;
class PhysicsCore;
class SetupItem;
struct KGLShaderVar;
struct KGLShaderTexture;
struct ACPluginContext;
struct ACCarState;
class Renderable;
class ISphereCollisionCallback;
class PhysicsEngine;
class Spline;
struct TimeTransponder;
class Damper;
class ACClient;
class PhysicsAvatar;
class IRayTrackCollisionProvider;
class Material;
class MaterialVar;
class ICollisionCallback;
struct CompileContext;
struct RenderContext;
class LapDB;
class IVarCallback;
class Font;
class ConsoleCommand;
class ksgui_GUI;
class GLRenderer;
class ksgui_Label;
class ksgui_TextBox;
struct CarPhysicsState;
struct CameraValue;
struct dxBody;
struct GridData;
class ksgui_ActiveButton;
class ksgui_MovingBar;
class ksgui_PopOver;
class ksgui_Form;
class ksgui_TaskBarIcon;
class IndexBuffer;
struct MeshVertex;
class ksgui_ListBoxRow;
class MaterialResource;
struct dxWorld;
struct dxSpace;
struct dxJointGroup;
struct dxThreadingImplementation;
struct dxThreadingThreadPool;
struct dContactGeom;
class CinematicFreeCamera;
class CameraMouseControl;
class CameraHelicopter;
class CameraOnBoard;
class CameraTrack;
class CameraOnBoardFree;
class CameraCarManager;
class CameraDrivableManager;
class CameraModeStart;
class ImageGeneratorCamera;
struct SlipStream;
class IDebugVisualizer;
class IPhysicsCore;
class ICarPhysicsStateProvider;
class Turbo;
class ISuspension;
class IKeyEventListener;
struct ksgui_ValueSerie;
class SkyBox;
class RenderTarget;
struct Tyre;
class ITyreModel;
class RaceTimingServices;
class AudioEngine;
class ksgui_Taskbar;
class KeyboardManager;
class PvsProcessor;
class GPUProfiler;
class CubeMap;
class IVertexBuffer;
class ACClientVotingManager;
class WrongWayIndicator;
class NodeDirtCamera;
class SessionLeaderboard;
class MirrorTextureRenderer;
class ksgui_GameScreen;
class ACErrorHandler;
class PauseMenu;
class CarNodeSorter;
class SystemMessage;
class NodeEvent;
class TrackAvatar;
class DrivingAssistManager;
class ACCameraManager;
class DebugVisualizer;
class SystemNotification;
class ReplayManager;
class ScreenCapturer;
class ksgui_FormRenderStats;
class VirtualMirrorRenderer;
class PitStop;
class TimeLimitedTest;
class QuickMenu;
class Console;
class MicroSectors;
class SimScreen;
class EndSessionDisplayer;
class Texture;
class ICoastGenerator;
class ITorqueGenerator;
class CarAnimations;
class ConstrainedObjectsManager;
class NodeBoundingSphere;
class CarAudioFMOD;
class SkidMarkBuffer;
struct CarColliderManager;
class DriverModel;
class ISuspensionAvatar;
class CarLodManager;
struct BackfireParams;
class IEventTrigger;
struct SetupManager;
class PostProcess;
class HDR;
class PostProcessFXAA;
class TimerProcess;
struct TyreThermalState;
struct AIState;
class Mesh;
class TrackObject;
class IdealLine;
class DynamicTrackManager;
class Model;
class DisplayList;
class AISplineRecorder;
class GridSpaceDisplayer;
class LollipopCrew;
class SurfacesManager;

//UDT: struct NetCarQoS @len=8
	//_Data: this+0x0, Member, Type: int, goodPackets
	//_Data: this+0x4, Member, Type: int, badPackets
	//_Func: public void NetCarQoS(); @loc=optimized @len=0 @rva=0
//UDT;

struct NetCarQoS {
public:
	int goodPackets;
	int badPackets;
	inline NetCarQoS() { }
	inline NetCarQoS(const NetCarQoS& other) = default;
	inline NetCarQoS& operator=(const NetCarQoS& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(NetCarQoS)==8),"bad size");
		static_assert((offsetof(NetCarQoS,goodPackets)==0x0),"bad off");
		static_assert((offsetof(NetCarQoS,badPackets)==0x4),"bad off");
	};
};

//UDT: struct TyrePatchData @len=20
	//_Func: public void TyrePatchData(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, surfaceTransfer
	//_Data: this+0x4, Member, Type: float, patchTransfer
	//_Data: this+0x8, Member, Type: float, patchCoreTransfer
	//_Data: this+0xC, Member, Type: float, internalCoreTransfer
	//_Data: this+0x10, Member, Type: float, coolFactorGain
//UDT;

struct TyrePatchData {
public:
	float surfaceTransfer;
	float patchTransfer;
	float patchCoreTransfer;
	float internalCoreTransfer;
	float coolFactorGain;
	inline TyrePatchData() { }
	inline TyrePatchData(const TyrePatchData& other) = default;
	inline TyrePatchData& operator=(const TyrePatchData& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(TyrePatchData)==20),"bad size");
		static_assert((offsetof(TyrePatchData,surfaceTransfer)==0x0),"bad off");
		static_assert((offsetof(TyrePatchData,patchTransfer)==0x4),"bad off");
		static_assert((offsetof(TyrePatchData,patchCoreTransfer)==0x8),"bad off");
		static_assert((offsetof(TyrePatchData,internalCoreTransfer)==0xC),"bad off");
		static_assert((offsetof(TyrePatchData,coolFactorGain)==0x10),"bad off");
	};
};

//UDT: struct KGLShaderTextureDesc @len=16
	//_Data: this+0x0, Member, Type: const wchar_t *, name
	//_Data: this+0x8, Member, Type: unsigned int, slot
//UDT;

struct KGLShaderTextureDesc {
public:
	const wchar_t * name;
	unsigned int slot;
	inline KGLShaderTextureDesc() { }
	inline KGLShaderTextureDesc(const KGLShaderTextureDesc& other) = default;
	inline KGLShaderTextureDesc& operator=(const KGLShaderTextureDesc& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(KGLShaderTextureDesc)==16),"bad size");
		static_assert((offsetof(KGLShaderTextureDesc,name)==0x0),"bad off");
		static_assert((offsetof(KGLShaderTextureDesc,slot)==0x8),"bad off");
	};
};

//UDT: struct RendererFlags @len=8
	//_Func: public void RendererFlags(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: int, maxFrameLatency
	//_Data: this+0x4, Member, Type: float, mipLodBias
//UDT;

struct RendererFlags {
public:
	int maxFrameLatency;
	float mipLodBias;
	inline RendererFlags() { }
	inline RendererFlags(const RendererFlags& other) = default;
	inline RendererFlags& operator=(const RendererFlags& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(RendererFlags)==8),"bad size");
		static_assert((offsetof(RendererFlags,maxFrameLatency)==0x0),"bad off");
		static_assert((offsetof(RendererFlags,mipLodBias)==0x4),"bad off");
	};
};

//UDT: struct AccelerationProfile @len=8
	//_Data: this+0x0, Member, Type: float, zero
	//_Data: this+0x4, Member, Type: float, maxTyres
//UDT;

struct AccelerationProfile {
public:
	float zero;
	float maxTyres;
	inline AccelerationProfile() { }
	inline AccelerationProfile(const AccelerationProfile& other) = default;
	inline AccelerationProfile& operator=(const AccelerationProfile& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(AccelerationProfile)==8),"bad size");
		static_assert((offsetof(AccelerationProfile,zero)==0x0),"bad off");
		static_assert((offsetof(AccelerationProfile,maxTyres)==0x4),"bad off");
	};
};

//UDT: struct KPI @len=8
	//_Data: this+0x0, Member, Type: float, angleRAD
	//_Data: this+0x4, Member, Type: float, scrubRadius
	//_Func: public void KPI(); @loc=optimized @len=0 @rva=0
//UDT;

struct KPI {
public:
	float angleRAD;
	float scrubRadius;
	inline KPI() { }
	inline KPI(const KPI& other) = default;
	inline KPI& operator=(const KPI& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(KPI)==8),"bad size");
		static_assert((offsetof(KPI,angleRAD)==0x0),"bad off");
		static_assert((offsetof(KPI,scrubRadius)==0x4),"bad off");
	};
};

//UDT: struct AISplineDanger @len=16
	//_Data: this+0x0, Member, Type: float, startPos
	//_Data: this+0x4, Member, Type: float, endPos
	//_Data: this+0x8, Member, Type: float, left
	//_Data: this+0xC, Member, Type: float, right
	//_Func: public void AISplineDanger(); @loc=optimized @len=0 @rva=0
//UDT;

struct AISplineDanger {
public:
	float startPos;
	float endPos;
	float left;
	float right;
	inline AISplineDanger() { }
	inline AISplineDanger(const AISplineDanger& other) = default;
	inline AISplineDanger& operator=(const AISplineDanger& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(AISplineDanger)==16),"bad size");
		static_assert((offsetof(AISplineDanger,startPos)==0x0),"bad off");
		static_assert((offsetof(AISplineDanger,endPos)==0x4),"bad off");
		static_assert((offsetof(AISplineDanger,left)==0x8),"bad off");
		static_assert((offsetof(AISplineDanger,right)==0xC),"bad off");
	};
};

//UDT: struct ACPluginContext @len=1
//UDT;

struct ACPluginContext {
public:
	inline ACPluginContext() { }
	inline ACPluginContext(const ACPluginContext& other) = default;
	inline ACPluginContext& operator=(const ACPluginContext& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ACPluginContext)==1),"bad size");
	};
};

//UDT: struct SuspensionStatus @len=8
	//_Data: this+0x0, Member, Type: float, travel
	//_Data: this+0x4, Member, Type: float, damperSpeedMS
	//_Func: public void SuspensionStatus(); @loc=optimized @len=0 @rva=0
//UDT;

struct SuspensionStatus {
public:
	float travel;
	float damperSpeedMS;
	inline SuspensionStatus() { }
	inline SuspensionStatus(const SuspensionStatus& other) = default;
	inline SuspensionStatus& operator=(const SuspensionStatus& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(SuspensionStatus)==8),"bad size");
		static_assert((offsetof(SuspensionStatus,travel)==0x0),"bad off");
		static_assert((offsetof(SuspensionStatus,damperSpeedMS)==0x4),"bad off");
	};
};

//UDT: struct GearElement @len=24
	//_Data: this+0x0, Member, Type: double, velocity
	//_Data: this+0x8, Member, Type: double, inertia
	//_Data: this+0x10, Member, Type: double, oldVelocity
	//_Func: public void GearElement(); @loc=optimized @len=0 @rva=0
//UDT;

struct GearElement {
public:
	double velocity;
	double inertia;
	double oldVelocity;
	inline GearElement() { }
	inline GearElement(const GearElement& other) = default;
	inline GearElement& operator=(const GearElement& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(GearElement)==24),"bad size");
		static_assert((offsetof(GearElement,velocity)==0x0),"bad off");
		static_assert((offsetof(GearElement,inertia)==0x8),"bad off");
		static_assert((offsetof(GearElement,oldVelocity)==0x10),"bad off");
	};
};

//UDT: struct WreckerProtection @len=16
	//_Data: this+0x0, Member, Type: float, maxContactsPerKM
	//_Data: this+0x4, Member, Type: int, warningCount
	//_Data: this+0x8, Member, Type: int, contacts
	//_Data: this+0xC, Member, Type: bool, blackListRequested
	//_Func: public void WreckerProtection(); @loc=optimized @len=0 @rva=0
//UDT;

struct WreckerProtection {
public:
	float maxContactsPerKM;
	int warningCount;
	int contacts;
	bool blackListRequested;
	inline WreckerProtection() { }
	inline WreckerProtection(const WreckerProtection& other) = default;
	inline WreckerProtection& operator=(const WreckerProtection& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(WreckerProtection)==16),"bad size");
		static_assert((offsetof(WreckerProtection,maxContactsPerKM)==0x0),"bad off");
		static_assert((offsetof(WreckerProtection,warningCount)==0x4),"bad off");
		static_assert((offsetof(WreckerProtection,contacts)==0x8),"bad off");
		static_assert((offsetof(WreckerProtection,blackListRequested)==0xC),"bad off");
	};
};

//UDT: struct SplineIndexBound @len=8
	//_Func: public void SplineIndexBound(unsigned int  _arg0, unsigned int  _arg1); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: unsigned int, minIndex
	//_Data: this+0x4, Member, Type: unsigned int, maxIndex
//UDT;

struct SplineIndexBound {
public:
	unsigned int minIndex;
	unsigned int maxIndex;
	inline SplineIndexBound() { }
	inline SplineIndexBound(const SplineIndexBound& other) = default;
	inline SplineIndexBound& operator=(const SplineIndexBound& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(SplineIndexBound)==8),"bad size");
		static_assert((offsetof(SplineIndexBound,minIndex)==0x0),"bad off");
		static_assert((offsetof(SplineIndexBound,maxIndex)==0x4),"bad off");
	};
};

//UDT: struct SamplerStates @len=56
	//_Data: this+0x0, Member, Type: void *, samplerAniso
	//_Data: this+0x8, Member, Type: void *, samplerLinearShadow
	//_Data: this+0x10, Member, Type: void *, samplerShadow
	//_Data: this+0x18, Member, Type: void *, samplerPoint
	//_Data: this+0x20, Member, Type: void *, samplerPointClamp
	//_Data: this+0x28, Member, Type: void *, samplerLinearSimple
	//_Data: this+0x30, Member, Type: void *, samplerLinearClamp
//UDT;

struct SamplerStates {
public:
	void * samplerAniso;
	void * samplerLinearShadow;
	void * samplerShadow;
	void * samplerPoint;
	void * samplerPointClamp;
	void * samplerLinearSimple;
	void * samplerLinearClamp;
	inline SamplerStates() { }
	inline SamplerStates(const SamplerStates& other) = default;
	inline SamplerStates& operator=(const SamplerStates& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(SamplerStates)==56),"bad size");
		static_assert((offsetof(SamplerStates,samplerAniso)==0x0),"bad off");
		static_assert((offsetof(SamplerStates,samplerLinearShadow)==0x8),"bad off");
		static_assert((offsetof(SamplerStates,samplerShadow)==0x10),"bad off");
		static_assert((offsetof(SamplerStates,samplerPoint)==0x18),"bad off");
		static_assert((offsetof(SamplerStates,samplerPointClamp)==0x20),"bad off");
		static_assert((offsetof(SamplerStates,samplerLinearSimple)==0x28),"bad off");
		static_assert((offsetof(SamplerStates,samplerLinearClamp)==0x30),"bad off");
	};
};

//UDT: struct PerformancePair @len=8
	//_Func: public void PerformancePair(unsigned int  _arg0, float  _arg1); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: unsigned int, t
	//_Data: this+0x4, Member, Type: float, speedMS
//UDT;

struct PerformancePair {
public:
	unsigned int t;
	float speedMS;
	inline PerformancePair() { }
	inline PerformancePair(const PerformancePair& other) = default;
	inline PerformancePair& operator=(const PerformancePair& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(PerformancePair)==8),"bad size");
		static_assert((offsetof(PerformancePair,t)==0x0),"bad off");
		static_assert((offsetof(PerformancePair,speedMS)==0x4),"bad off");
	};
};

//UDT: struct DynamicTrackData @len=24
	//_Data: this+0x0, Member, Type: bool, isExternal
	//_Data: this+0x1, Member, Type: bool, enabled
	//_Data: this+0x4, Member, Type: float, sessionStartGrip
	//_Data: this+0x8, Member, Type: float, baseGrip
	//_Data: this+0xC, Member, Type: float, randomGrip
	//_Data: this+0x10, Member, Type: float, gripPerLap
	//_Data: this+0x14, Member, Type: float, sessionTransfer
	//_Func: public void DynamicTrackData(); @loc=optimized @len=0 @rva=0
//UDT;

struct DynamicTrackData {
public:
	bool isExternal;
	bool enabled;
	float sessionStartGrip;
	float baseGrip;
	float randomGrip;
	float gripPerLap;
	float sessionTransfer;
	inline DynamicTrackData() { }
	inline DynamicTrackData(const DynamicTrackData& other) = default;
	inline DynamicTrackData& operator=(const DynamicTrackData& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(DynamicTrackData)==24),"bad size");
		static_assert((offsetof(DynamicTrackData,isExternal)==0x0),"bad off");
		static_assert((offsetof(DynamicTrackData,enabled)==0x1),"bad off");
		static_assert((offsetof(DynamicTrackData,sessionStartGrip)==0x4),"bad off");
		static_assert((offsetof(DynamicTrackData,baseGrip)==0x8),"bad off");
		static_assert((offsetof(DynamicTrackData,randomGrip)==0xC),"bad off");
		static_assert((offsetof(DynamicTrackData,gripPerLap)==0x10),"bad off");
		static_assert((offsetof(DynamicTrackData,sessionTransfer)==0x14),"bad off");
	};
};

//UDT: struct OnSectorSplitEvent @len=16
	//_Data: this+0x0, Member, Type: unsigned int, carIndex
	//_Data: this+0x4, Member, Type: unsigned int, sectorIndex
	//_Data: this+0x8, Member, Type: unsigned int, sectorTime
	//_Data: this+0xC, Member, Type: unsigned int, cuts
//UDT;

struct OnSectorSplitEvent {
public:
	unsigned int carIndex;
	unsigned int sectorIndex;
	unsigned int sectorTime;
	unsigned int cuts;
	inline OnSectorSplitEvent() { }
	inline OnSectorSplitEvent(const OnSectorSplitEvent& other) = default;
	inline OnSectorSplitEvent& operator=(const OnSectorSplitEvent& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(OnSectorSplitEvent)==16),"bad size");
		static_assert((offsetof(OnSectorSplitEvent,carIndex)==0x0),"bad off");
		static_assert((offsetof(OnSectorSplitEvent,sectorIndex)==0x4),"bad off");
		static_assert((offsetof(OnSectorSplitEvent,sectorTime)==0x8),"bad off");
		static_assert((offsetof(OnSectorSplitEvent,cuts)==0xC),"bad off");
	};
};

//UDT: struct KGLShaderCBufferDesc @len=16
	//_Data: this+0x0, Member, Type: const wchar_t *, name
	//_Data: this+0x8, Member, Type: unsigned int, size
	//_Data: this+0xC, Member, Type: unsigned int, slot
//UDT;

struct KGLShaderCBufferDesc {
public:
	const wchar_t * name;
	unsigned int size;
	unsigned int slot;
	inline KGLShaderCBufferDesc() { }
	inline KGLShaderCBufferDesc(const KGLShaderCBufferDesc& other) = default;
	inline KGLShaderCBufferDesc& operator=(const KGLShaderCBufferDesc& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(KGLShaderCBufferDesc)==16),"bad size");
		static_assert((offsetof(KGLShaderCBufferDesc,name)==0x0),"bad off");
		static_assert((offsetof(KGLShaderCBufferDesc,size)==0x8),"bad off");
		static_assert((offsetof(KGLShaderCBufferDesc,slot)==0xC),"bad off");
	};
};

//UDT: struct DIShifter @len=48
	//_Func: public void DIShifter(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: bool, isActive
	//_Data: this+0x1, Member, Type: bool, isShifterPrefered
	//_Data: this+0x4, Member, Type: int, joy
	//_Data: this+0x8, Member, Type: int[0xA], buttons
//UDT;

struct DIShifter {
public:
	bool isActive;
	bool isShifterPrefered;
	int joy;
	int buttons[10];
	inline DIShifter() { }
	inline DIShifter(const DIShifter& other) = default;
	inline DIShifter& operator=(const DIShifter& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(DIShifter)==48),"bad size");
		static_assert((offsetof(DIShifter,isActive)==0x0),"bad off");
		static_assert((offsetof(DIShifter,isShifterPrefered)==0x1),"bad off");
		static_assert((offsetof(DIShifter,joy)==0x4),"bad off");
		static_assert((offsetof(DIShifter,buttons)==0x8),"bad off");
	};
};

//UDT: class ICollisionObject @len=8 @vfcount=6
	//_VTable: 
	//_Func: public void release(); @intro @pure @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
	//_Func: public void setUserPointer(void *  _arg0); @intro @pure @virtual vtpo=0 vfid=1 @loc=optimized @len=0 @rva=0
	//_Func: public void * getUserPointer(); @intro @pure @virtual vtpo=0 vfid=2 @loc=optimized @len=0 @rva=0
	//_Func: public unsigned long getGroup(); @intro @pure @virtual vtpo=0 vfid=3 @loc=optimized @len=0 @rva=0
	//_Func: public unsigned long getMask(); @intro @pure @virtual vtpo=0 vfid=4 @loc=optimized @len=0 @rva=0
	//_Func: protected void ~ICollisionObject(); @intro @virtual vtpo=0 vfid=5 @loc=static @len=11 @rva=2939088
	//_Func: public void ICollisionObject(const ICollisionObject &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ICollisionObject(); @loc=optimized @len=0 @rva=0
	//_Func: public ICollisionObject & operator=(const ICollisionObject &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: protected void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=5 @loc=optimized @len=0 @rva=0
//UDT;

class ICollisionObject {
public:
	inline ICollisionObject() { }
	inline ICollisionObject(const ICollisionObject& other) = default;
	inline ICollisionObject& operator=(const ICollisionObject& other) = default;
	virtual void release_vf0() = 0;
	inline void release() { typedef void (ICollisionObject::*_fpt)(); auto _f=xcast<_fpt>(get_vfp(this, 0)); return (this->*_f)(); }
	virtual void setUserPointer_vf1(void *  _arg0) = 0;
	inline void setUserPointer(void *  _arg0) { typedef void (ICollisionObject::*_fpt)(void *); auto _f=xcast<_fpt>(get_vfp(this, 1)); return (this->*_f)( _arg0); }
	virtual void * getUserPointer_vf2() = 0;
	inline void * getUserPointer() { typedef void * (ICollisionObject::*_fpt)(); auto _f=xcast<_fpt>(get_vfp(this, 2)); return (this->*_f)(); }
	virtual unsigned long getGroup_vf3() = 0;
	inline unsigned long getGroup() { typedef unsigned long (ICollisionObject::*_fpt)(); auto _f=xcast<_fpt>(get_vfp(this, 3)); return (this->*_f)(); }
	virtual unsigned long getMask_vf4() = 0;
	inline unsigned long getMask() { typedef unsigned long (ICollisionObject::*_fpt)(); auto _f=xcast<_fpt>(get_vfp(this, 4)); return (this->*_f)(); }
	virtual ~ICollisionObject();
	inline void dtor() { typedef void (ICollisionObject::*_fpt)(); auto _f=xcast<_fpt>(_drva(2939088)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(ICollisionObject)==8),"bad size");
	};
};

//UDT: struct TyreStatus @len=184
	//_Func: public void TyreStatus(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, depth
	//_Data: this+0x4, Member, Type: float, load
	//_Data: this+0x8, Member, Type: float, camberRAD
	//_Data: this+0xC, Member, Type: float, slipAngleRAD
	//_Data: this+0x10, Member, Type: float, slipRatio
	//_Data: this+0x14, Member, Type: float, angularVelocity
	//_Data: this+0x18, Member, Type: float, Fy
	//_Data: this+0x1C, Member, Type: float, Fx
	//_Data: this+0x20, Member, Type: float, Mz
	//_Data: this+0x24, Member, Type: bool, isLocked
	//_Data: this+0x28, Member, Type: float, slipFactor
	//_Data: this+0x2C, Member, Type: float, ndSlip
	//_Data: this+0x30, Member, Type: float, distToGround
	//_Data: this+0x34, Member, Type: float, Dy
	//_Data: this+0x38, Member, Type: float, Dx
	//_Data: this+0x3C, Member, Type: float, D
	//_Data: this+0x40, Member, Type: float, dirtyLevel
	//_Data: this+0x44, Member, Type: float, rollingResistence
	//_Data: this+0x48, Member, Type: float, thermalInput
	//_Data: this+0x4C, Member, Type: float, feedbackTorque
	//_Data: this+0x50, Member, Type: float, loadedRadius
	//_Data: this+0x54, Member, Type: float, effectiveRadius
	//_Data: this+0x58, Member, Type: float, liveRadius
	//_Data: this+0x5C, Member, Type: float, pressureStatic
	//_Data: this+0x60, Member, Type: float, pressureDynamic
	//_Data: this+0x68, Member, Type: double, virtualKM
	//_Data: this+0x70, Member, Type: float[0x3], lastTempIMO
	//_Data: this+0x7C, Member, Type: float, peakSA
	//_Data: this+0x80, Member, Type: double, grain
	//_Data: this+0x88, Member, Type: double, blister
	//_Data: this+0x90, Member, Type: float, inflation
	//_Data: this+0x98, Member, Type: double, flatSpot
	//_Data: this+0xA0, Member, Type: float, lastGrain
	//_Data: this+0xA4, Member, Type: float, lastBlister
	//_Data: this+0xA8, Member, Type: float, normalizedSlideX
	//_Data: this+0xAC, Member, Type: float, normalizedSlideY
	//_Data: this+0xB0, Member, Type: float, finalDY
	//_Data: this+0xB4, Member, Type: float, wearMult
//UDT;

struct TyreStatus {
public:
	float depth;
	float load;
	float camberRAD;
	float slipAngleRAD;
	float slipRatio;
	float angularVelocity;
	float Fy;
	float Fx;
	float Mz;
	bool isLocked;
	float slipFactor;
	float ndSlip;
	float distToGround;
	float Dy;
	float Dx;
	float D;
	float dirtyLevel;
	float rollingResistence;
	float thermalInput;
	float feedbackTorque;
	float loadedRadius;
	float effectiveRadius;
	float liveRadius;
	float pressureStatic;
	float pressureDynamic;
	double virtualKM;
	float lastTempIMO[3];
	float peakSA;
	double grain;
	double blister;
	float inflation;
	double flatSpot;
	float lastGrain;
	float lastBlister;
	float normalizedSlideX;
	float normalizedSlideY;
	float finalDY;
	float wearMult;
	inline TyreStatus() { }
	inline TyreStatus(const TyreStatus& other) = default;
	inline TyreStatus& operator=(const TyreStatus& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(TyreStatus)==184),"bad size");
		static_assert((offsetof(TyreStatus,depth)==0x0),"bad off");
		static_assert((offsetof(TyreStatus,load)==0x4),"bad off");
		static_assert((offsetof(TyreStatus,camberRAD)==0x8),"bad off");
		static_assert((offsetof(TyreStatus,slipAngleRAD)==0xC),"bad off");
		static_assert((offsetof(TyreStatus,slipRatio)==0x10),"bad off");
		static_assert((offsetof(TyreStatus,angularVelocity)==0x14),"bad off");
		static_assert((offsetof(TyreStatus,Fy)==0x18),"bad off");
		static_assert((offsetof(TyreStatus,Fx)==0x1C),"bad off");
		static_assert((offsetof(TyreStatus,Mz)==0x20),"bad off");
		static_assert((offsetof(TyreStatus,isLocked)==0x24),"bad off");
		static_assert((offsetof(TyreStatus,slipFactor)==0x28),"bad off");
		static_assert((offsetof(TyreStatus,ndSlip)==0x2C),"bad off");
		static_assert((offsetof(TyreStatus,distToGround)==0x30),"bad off");
		static_assert((offsetof(TyreStatus,Dy)==0x34),"bad off");
		static_assert((offsetof(TyreStatus,Dx)==0x38),"bad off");
		static_assert((offsetof(TyreStatus,D)==0x3C),"bad off");
		static_assert((offsetof(TyreStatus,dirtyLevel)==0x40),"bad off");
		static_assert((offsetof(TyreStatus,rollingResistence)==0x44),"bad off");
		static_assert((offsetof(TyreStatus,thermalInput)==0x48),"bad off");
		static_assert((offsetof(TyreStatus,feedbackTorque)==0x4C),"bad off");
		static_assert((offsetof(TyreStatus,loadedRadius)==0x50),"bad off");
		static_assert((offsetof(TyreStatus,effectiveRadius)==0x54),"bad off");
		static_assert((offsetof(TyreStatus,liveRadius)==0x58),"bad off");
		static_assert((offsetof(TyreStatus,pressureStatic)==0x5C),"bad off");
		static_assert((offsetof(TyreStatus,pressureDynamic)==0x60),"bad off");
		static_assert((offsetof(TyreStatus,virtualKM)==0x68),"bad off");
		static_assert((offsetof(TyreStatus,lastTempIMO)==0x70),"bad off");
		static_assert((offsetof(TyreStatus,peakSA)==0x7C),"bad off");
		static_assert((offsetof(TyreStatus,grain)==0x80),"bad off");
		static_assert((offsetof(TyreStatus,blister)==0x88),"bad off");
		static_assert((offsetof(TyreStatus,inflation)==0x90),"bad off");
		static_assert((offsetof(TyreStatus,flatSpot)==0x98),"bad off");
		static_assert((offsetof(TyreStatus,lastGrain)==0xA0),"bad off");
		static_assert((offsetof(TyreStatus,lastBlister)==0xA4),"bad off");
		static_assert((offsetof(TyreStatus,normalizedSlideX)==0xA8),"bad off");
		static_assert((offsetof(TyreStatus,normalizedSlideY)==0xAC),"bad off");
		static_assert((offsetof(TyreStatus,finalDY)==0xB0),"bad off");
		static_assert((offsetof(TyreStatus,wearMult)==0xB4),"bad off");
	};
};

//UDT: struct ShadowMapSettings @len=12
	//_Data: this+0x0, Member, Type: float, nearSplit
	//_Data: this+0x4, Member, Type: float, farSplit
	//_Data: this+0x8, Member, Type: float, height
	//_Func: public void ShadowMapSettings(); @loc=optimized @len=0 @rva=0
//UDT;

struct ShadowMapSettings {
public:
	float nearSplit;
	float farSplit;
	float height;
	inline ShadowMapSettings() { }
	inline ShadowMapSettings(const ShadowMapSettings& other) = default;
	inline ShadowMapSettings& operator=(const ShadowMapSettings& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ShadowMapSettings)==12),"bad size");
		static_assert((offsetof(ShadowMapSettings,nearSplit)==0x0),"bad off");
		static_assert((offsetof(ShadowMapSettings,farSplit)==0x4),"bad off");
		static_assert((offsetof(ShadowMapSettings,height)==0x8),"bad off");
	};
};

//UDT: struct PerformanceSplit @len=16
	//_Data: this+0x0, Member, Type: double, t
	//_Data: this+0x8, Member, Type: float, speedMS
	//_Func: public void PerformanceSplit(); @loc=optimized @len=0 @rva=0
//UDT;

struct PerformanceSplit {
public:
	double t;
	float speedMS;
	inline PerformanceSplit() { }
	inline PerformanceSplit(const PerformanceSplit& other) = default;
	inline PerformanceSplit& operator=(const PerformanceSplit& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(PerformanceSplit)==16),"bad size");
		static_assert((offsetof(PerformanceSplit,t)==0x0),"bad off");
		static_assert((offsetof(PerformanceSplit,speedMS)==0x8),"bad off");
	};
};

//UDT: struct SusDamageDef @len=28
	//_Data: this+0x0, Member, Type: float, damageAmount
	//_Data: this+0x4, Member, Type: float, damageDirection
	//_Data: this+0x8, Member, Type: float, minVelocity
	//_Data: this+0xC, Member, Type: float, damageGain
	//_Data: this+0x10, Member, Type: float, maxDamage
	//_Data: this+0x14, Member, Type: bool, isDebug
	//_Data: this+0x18, Member, Type: float, lastAmount
	//_Func: public void SusDamageDef(); @loc=optimized @len=0 @rva=0
//UDT;

struct SusDamageDef {
public:
	float damageAmount;
	float damageDirection;
	float minVelocity;
	float damageGain;
	float maxDamage;
	bool isDebug;
	float lastAmount;
	inline SusDamageDef() { }
	inline SusDamageDef(const SusDamageDef& other) = default;
	inline SusDamageDef& operator=(const SusDamageDef& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(SusDamageDef)==28),"bad size");
		static_assert((offsetof(SusDamageDef,damageAmount)==0x0),"bad off");
		static_assert((offsetof(SusDamageDef,damageDirection)==0x4),"bad off");
		static_assert((offsetof(SusDamageDef,minVelocity)==0x8),"bad off");
		static_assert((offsetof(SusDamageDef,damageGain)==0xC),"bad off");
		static_assert((offsetof(SusDamageDef,maxDamage)==0x10),"bad off");
		static_assert((offsetof(SusDamageDef,isDebug)==0x14),"bad off");
		static_assert((offsetof(SusDamageDef,lastAmount)==0x18),"bad off");
	};
};

//UDT: struct GameStats @len=40
	//_Func: public void GameStats(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: double, cpuTime
	//_Data: this+0x8, Member, Type: double, updateTime
	//_Data: this+0x10, Member, Type: double, renderHUDTime
	//_Data: this+0x18, Member, Type: double, renderTime
	//_Data: this+0x20, Member, Type: double, renderAudioTime
//UDT;

struct GameStats {
public:
	double cpuTime;
	double updateTime;
	double renderHUDTime;
	double renderTime;
	double renderAudioTime;
	inline GameStats() { }
	inline GameStats(const GameStats& other) = default;
	inline GameStats& operator=(const GameStats& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(GameStats)==40),"bad size");
		static_assert((offsetof(GameStats,cpuTime)==0x0),"bad off");
		static_assert((offsetof(GameStats,updateTime)==0x8),"bad off");
		static_assert((offsetof(GameStats,renderHUDTime)==0x10),"bad off");
		static_assert((offsetof(GameStats,renderTime)==0x18),"bad off");
		static_assert((offsetof(GameStats,renderAudioTime)==0x20),"bad off");
	};
};

//UDT: struct DRSDetectionStatus @len=16
	//_Data: this+0x0, Member, Type: double, time
	//_Data: this+0x8, Member, Type: int, laps
	//_Data: this+0xC, Member, Type: bool, isRaceAvailable
	//_Data: this+0xD, Member, Type: bool, hasBeenSwitchedOnThisStep
	//_Func: public void DRSDetectionStatus(); @loc=optimized @len=0 @rva=0
//UDT;

struct DRSDetectionStatus {
public:
	double time;
	int laps;
	bool isRaceAvailable;
	bool hasBeenSwitchedOnThisStep;
	inline DRSDetectionStatus() { }
	inline DRSDetectionStatus(const DRSDetectionStatus& other) = default;
	inline DRSDetectionStatus& operator=(const DRSDetectionStatus& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(DRSDetectionStatus)==16),"bad size");
		static_assert((offsetof(DRSDetectionStatus,time)==0x0),"bad off");
		static_assert((offsetof(DRSDetectionStatus,laps)==0x8),"bad off");
		static_assert((offsetof(DRSDetectionStatus,isRaceAvailable)==0xC),"bad off");
		static_assert((offsetof(DRSDetectionStatus,hasBeenSwitchedOnThisStep)==0xD),"bad off");
	};
};

//UDT: struct VideoSettings @len=80
	//_Func: public void VideoSettings(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: int, aaSamples
	//_Data: this+0x4, Member, Type: int, width
	//_Data: this+0x8, Member, Type: int, height
	//_Data: this+0x10, Member, Type: void *, hWnd
	//_Data: this+0x18, Member, Type: bool, isFullscreen
	//_Data: this+0x19, Member, Type: bool, vSync
	//_Data: this+0x1C, Member, Type: int, anisotropic
	//_Data: this+0x20, Member, Type: int, aaQuality
	//_Data: this+0x24, Member, Type: int, shadowMapSize
	//_Data: this+0x28, Member, Type: double, fpsCapMS
	//_Data: this+0x30, Member, Type: int, dxgiModeIndex
	//_Data: this+0x34, Member, Type: int, worldDetail
	//_Data: this+0x38, Member, Type: bool, ppHDREnabled
	//_Data: this+0x39, Member, Type: bool, ppHeatShimmer
	//_Data: this+0x3A, Member, Type: bool, ppFXAA
	//_Data: this+0x3B, Member, Type: bool, ppRaysOfGod
	//_Data: this+0x3C, Member, Type: int, ppQuality
	//_Data: this+0x40, Member, Type: int, ppGlare
	//_Data: this+0x44, Member, Type: int, ppDof
	//_Data: this+0x48, Member, Type: bool, tripleBuffer
	//_Data: this+0x4C, Member, Type: float, refresh
//UDT;

struct VideoSettings {
public:
	int aaSamples;
	int width;
	int height;
	void * hWnd;
	bool isFullscreen;
	bool vSync;
	int anisotropic;
	int aaQuality;
	int shadowMapSize;
	double fpsCapMS;
	int dxgiModeIndex;
	int worldDetail;
	bool ppHDREnabled;
	bool ppHeatShimmer;
	bool ppFXAA;
	bool ppRaysOfGod;
	int ppQuality;
	int ppGlare;
	int ppDof;
	bool tripleBuffer;
	float refresh;
	inline VideoSettings() { }
	inline VideoSettings(const VideoSettings& other) = default;
	inline VideoSettings& operator=(const VideoSettings& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(VideoSettings)==80),"bad size");
		static_assert((offsetof(VideoSettings,aaSamples)==0x0),"bad off");
		static_assert((offsetof(VideoSettings,width)==0x4),"bad off");
		static_assert((offsetof(VideoSettings,height)==0x8),"bad off");
		static_assert((offsetof(VideoSettings,hWnd)==0x10),"bad off");
		static_assert((offsetof(VideoSettings,isFullscreen)==0x18),"bad off");
		static_assert((offsetof(VideoSettings,vSync)==0x19),"bad off");
		static_assert((offsetof(VideoSettings,anisotropic)==0x1C),"bad off");
		static_assert((offsetof(VideoSettings,aaQuality)==0x20),"bad off");
		static_assert((offsetof(VideoSettings,shadowMapSize)==0x24),"bad off");
		static_assert((offsetof(VideoSettings,fpsCapMS)==0x28),"bad off");
		static_assert((offsetof(VideoSettings,dxgiModeIndex)==0x30),"bad off");
		static_assert((offsetof(VideoSettings,worldDetail)==0x34),"bad off");
		static_assert((offsetof(VideoSettings,ppHDREnabled)==0x38),"bad off");
		static_assert((offsetof(VideoSettings,ppHeatShimmer)==0x39),"bad off");
		static_assert((offsetof(VideoSettings,ppFXAA)==0x3A),"bad off");
		static_assert((offsetof(VideoSettings,ppRaysOfGod)==0x3B),"bad off");
		static_assert((offsetof(VideoSettings,ppQuality)==0x3C),"bad off");
		static_assert((offsetof(VideoSettings,ppGlare)==0x40),"bad off");
		static_assert((offsetof(VideoSettings,ppDof)==0x44),"bad off");
		static_assert((offsetof(VideoSettings,tripleBuffer)==0x48),"bad off");
		static_assert((offsetof(VideoSettings,refresh)==0x4C),"bad off");
	};
};

//UDT: class GameTime @len=56 @vfcount=1
	//_VTable: 
	//_Func: public void GameTime(const GameTime &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void GameTime(); @loc=static @len=62 @rva=4506064
	//_Func: public void ~GameTime(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=11 @rva=4506128
	//_Data: this+0x8, Member, Type: double, now
	//_Data: this+0x10, Member, Type: float, deltaT
	//_Data: this+0x14, Member, Type: float, smoothDeltaT
	//_Data: this+0x18, Member, Type: float, fps
	//_Data: this+0x1C, Member, Type: bool, useStabilizer
	//_Data: this+0x20, Member, Type: double, cappedFPS
	//_Data: this+0x28, Member, Type: double, startTime
	//_Func: public void update(); @loc=static @len=341 @rva=4506192
	//_Func: public bool isUsingHRT(); @loc=optimized @len=0 @rva=0
	//_Func: protected void initTimer(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x30, Member, Type: bool, m_isUsingHRT
	//_Func: public GameTime & operator=(const GameTime &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class GameTime {
public:
	double now;
	float deltaT;
	float smoothDeltaT;
	float fps;
	bool useStabilizer;
	double cappedFPS;
	double startTime;
	bool m_isUsingHRT;
	inline GameTime() { }
	inline GameTime(const GameTime& other) = default;
	inline GameTime& operator=(const GameTime& other) = default;
	inline void ctor() { typedef void (GameTime::*_fpt)(); auto _f=xcast<_fpt>(_drva(4506064)); (this->*_f)(); }
	virtual ~GameTime();
	inline void dtor() { typedef void (GameTime::*_fpt)(); auto _f=xcast<_fpt>(_drva(4506128)); (this->*_f)(); }
	inline void update() { typedef void (GameTime::*_fpt)(); auto _f=xcast<_fpt>(_drva(4506192)); return (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(GameTime)==56),"bad size");
		static_assert((offsetof(GameTime,now)==0x8),"bad off");
		static_assert((offsetof(GameTime,deltaT)==0x10),"bad off");
		static_assert((offsetof(GameTime,smoothDeltaT)==0x14),"bad off");
		static_assert((offsetof(GameTime,fps)==0x18),"bad off");
		static_assert((offsetof(GameTime,useStabilizer)==0x1C),"bad off");
		static_assert((offsetof(GameTime,cappedFPS)==0x20),"bad off");
		static_assert((offsetof(GameTime,startTime)==0x28),"bad off");
		static_assert((offsetof(GameTime,m_isUsingHRT)==0x30),"bad off");
	};
};

//UDT: class ITorqueGenerator @len=8 @vfcount=2
	//_VTable: 
	//_Func: public void ~ITorqueGenerator(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=11 @rva=2549840
	//_Func: public float getOutputTorque(); @intro @pure @virtual vtpo=0 vfid=1 @loc=optimized @len=0 @rva=0
	//_Func: public void ITorqueGenerator(const ITorqueGenerator &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ITorqueGenerator(); @loc=optimized @len=0 @rva=0
	//_Func: public ITorqueGenerator & operator=(const ITorqueGenerator &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class ITorqueGenerator {
public:
	inline ITorqueGenerator() { }
	inline ITorqueGenerator(const ITorqueGenerator& other) = default;
	inline ITorqueGenerator& operator=(const ITorqueGenerator& other) = default;
	virtual ~ITorqueGenerator();
	inline void dtor() { typedef void (ITorqueGenerator::*_fpt)(); auto _f=xcast<_fpt>(_drva(2549840)); (this->*_f)(); }
	virtual float getOutputTorque_vf1() = 0;
	inline float getOutputTorque() { typedef float (ITorqueGenerator::*_fpt)(); auto _f=xcast<_fpt>(get_vfp(this, 1)); return (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(ITorqueGenerator)==8),"bad size");
	};
};

//UDT: struct ERSCockpitControls @len=3
	//_Data: this+0x0, Member, Type: bool, recovery
	//_Data: this+0x1, Member, Type: bool, mguHMode
	//_Data: this+0x2, Member, Type: bool, deliveryProfile
	//_Func: public void ERSCockpitControls(); @loc=optimized @len=0 @rva=0
//UDT;

struct ERSCockpitControls {
public:
	bool recovery;
	bool mguHMode;
	bool deliveryProfile;
	inline ERSCockpitControls() { }
	inline ERSCockpitControls(const ERSCockpitControls& other) = default;
	inline ERSCockpitControls& operator=(const ERSCockpitControls& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ERSCockpitControls)==3),"bad size");
		static_assert((offsetof(ERSCockpitControls,recovery)==0x0),"bad off");
		static_assert((offsetof(ERSCockpitControls,mguHMode)==0x1),"bad off");
		static_assert((offsetof(ERSCockpitControls,deliveryProfile)==0x2),"bad off");
	};
};

//UDT: struct ACClient::ClientEndSession @len=12
	//_Data: this+0x0, Member, Type: bool, isConnectionFinished
	//_Data: this+0x4, Member, Type: float, sendToPitsTimer
	//_Data: this+0x8, Member, Type: float, shutdownTimer
	//_Func: public void ClientEndSession(); @loc=optimized @len=0 @rva=0
//UDT;

struct ACClient_ClientEndSession {
public:
	bool isConnectionFinished;
	float sendToPitsTimer;
	float shutdownTimer;
	inline ACClient_ClientEndSession() { }
	inline ACClient_ClientEndSession(const ACClient_ClientEndSession& other) = default;
	inline ACClient_ClientEndSession& operator=(const ACClient_ClientEndSession& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ACClient_ClientEndSession)==12),"bad size");
		static_assert((offsetof(ACClient_ClientEndSession,isConnectionFinished)==0x0),"bad off");
		static_assert((offsetof(ACClient_ClientEndSession,sendToPitsTimer)==0x4),"bad off");
		static_assert((offsetof(ACClient_ClientEndSession,shutdownTimer)==0x8),"bad off");
	};
};

//UDT: struct SplineLocatorData @len=40
	//_Data: this+0x0, Member, Type: float, npos
	//_Data: this+0x4, Member, Type: unsigned int, currentIndex
	//_Data: this+0x8, Member, Type: float, lateralOffset
	//_Data: this+0xC, Member, Type: float, splineLength
	//_Data: this+0x10, Member, Type: float[0x2], sides
	//_Data: this+0x18, Member, Type: float[0x2], sidesFromIL
	//_Data: this+0x20, Member, Type: float, sideVelocity
	//_Data: this+0x24, Member, Type: bool, isOutsideTrackLimits
	//_Func: public void SplineLocatorData(); @loc=optimized @len=0 @rva=0
//UDT;

struct SplineLocatorData {
public:
	float npos;
	unsigned int currentIndex;
	float lateralOffset;
	float splineLength;
	float sides[2];
	float sidesFromIL[2];
	float sideVelocity;
	bool isOutsideTrackLimits;
	inline SplineLocatorData() { }
	inline SplineLocatorData(const SplineLocatorData& other) = default;
	inline SplineLocatorData& operator=(const SplineLocatorData& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(SplineLocatorData)==40),"bad size");
		static_assert((offsetof(SplineLocatorData,npos)==0x0),"bad off");
		static_assert((offsetof(SplineLocatorData,currentIndex)==0x4),"bad off");
		static_assert((offsetof(SplineLocatorData,lateralOffset)==0x8),"bad off");
		static_assert((offsetof(SplineLocatorData,splineLength)==0xC),"bad off");
		static_assert((offsetof(SplineLocatorData,sides)==0x10),"bad off");
		static_assert((offsetof(SplineLocatorData,sidesFromIL)==0x18),"bad off");
		static_assert((offsetof(SplineLocatorData,sideVelocity)==0x20),"bad off");
		static_assert((offsetof(SplineLocatorData,isOutsideTrackLimits)==0x24),"bad off");
	};
};

//UDT: struct ClientQOSData @len=24
	//_Data: this+0x0, Member, Type: bool, usingMegapackets
	//_Data: this+0x4, Member, Type: int, counter
	//_Data: this+0x8, Member, Type: double, startTime
	//_Data: this+0x10, Member, Type: int, lastQOS
	//_Func: public void ClientQOSData(); @loc=optimized @len=0 @rva=0
//UDT;

struct ClientQOSData {
public:
	bool usingMegapackets;
	int counter;
	double startTime;
	int lastQOS;
	inline ClientQOSData() { }
	inline ClientQOSData(const ClientQOSData& other) = default;
	inline ClientQOSData& operator=(const ClientQOSData& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ClientQOSData)==24),"bad size");
		static_assert((offsetof(ClientQOSData,usingMegapackets)==0x0),"bad off");
		static_assert((offsetof(ClientQOSData,counter)==0x4),"bad off");
		static_assert((offsetof(ClientQOSData,startTime)==0x8),"bad off");
		static_assert((offsetof(ClientQOSData,lastQOS)==0x10),"bad off");
	};
};

//UDT: struct CameraOnBoardCustomSettings @len=8
	//_Data: this+0x0, Member, Type: float, pitch
	//_Data: this+0x4, Member, Type: float, yaw
	//_Func: public void CameraOnBoardCustomSettings(); @loc=optimized @len=0 @rva=0
//UDT;

struct CameraOnBoardCustomSettings {
public:
	float pitch;
	float yaw;
	inline CameraOnBoardCustomSettings() { }
	inline CameraOnBoardCustomSettings(const CameraOnBoardCustomSettings& other) = default;
	inline CameraOnBoardCustomSettings& operator=(const CameraOnBoardCustomSettings& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(CameraOnBoardCustomSettings)==8),"bad size");
		static_assert((offsetof(CameraOnBoardCustomSettings,pitch)==0x0),"bad off");
		static_assert((offsetof(CameraOnBoardCustomSettings,yaw)==0x4),"bad off");
	};
};

//UDT: struct TyreData @len=72
	//_Func: public void TyreData(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, width
	//_Data: this+0x4, Member, Type: float, radius
	//_Data: this+0x8, Member, Type: float, k
	//_Data: this+0xC, Member, Type: float, d
	//_Data: this+0x10, Member, Type: float, angularInertia
	//_Data: this+0x14, Member, Type: float, thermalFrictionK
	//_Data: this+0x18, Member, Type: float, thermalRollingK
	//_Data: this+0x1C, Member, Type: float, thermalRollingSurfaceK
	//_Data: this+0x20, Member, Type: float, grainThreshold
	//_Data: this+0x24, Member, Type: float, blisterThreshold
	//_Data: this+0x28, Member, Type: float, grainGamma
	//_Data: this+0x2C, Member, Type: float, blisterGamma
	//_Data: this+0x30, Member, Type: float, grainGain
	//_Data: this+0x34, Member, Type: float, blisterGain
	//_Data: this+0x38, Member, Type: float, rimRadius
	//_Data: this+0x3C, Member, Type: float, optimumTemp
	//_Data: this+0x40, Member, Type: float, softnessIndex
	//_Data: this+0x44, Member, Type: float, radiusRaiseK
//UDT;

struct TyreData {
public:
	float width;
	float radius;
	float k;
	float d;
	float angularInertia;
	float thermalFrictionK;
	float thermalRollingK;
	float thermalRollingSurfaceK;
	float grainThreshold;
	float blisterThreshold;
	float grainGamma;
	float blisterGamma;
	float grainGain;
	float blisterGain;
	float rimRadius;
	float optimumTemp;
	float softnessIndex;
	float radiusRaiseK;
	inline TyreData() { }
	inline TyreData(const TyreData& other) = default;
	inline TyreData& operator=(const TyreData& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(TyreData)==72),"bad size");
		static_assert((offsetof(TyreData,width)==0x0),"bad off");
		static_assert((offsetof(TyreData,radius)==0x4),"bad off");
		static_assert((offsetof(TyreData,k)==0x8),"bad off");
		static_assert((offsetof(TyreData,d)==0xC),"bad off");
		static_assert((offsetof(TyreData,angularInertia)==0x10),"bad off");
		static_assert((offsetof(TyreData,thermalFrictionK)==0x14),"bad off");
		static_assert((offsetof(TyreData,thermalRollingK)==0x18),"bad off");
		static_assert((offsetof(TyreData,thermalRollingSurfaceK)==0x1C),"bad off");
		static_assert((offsetof(TyreData,grainThreshold)==0x20),"bad off");
		static_assert((offsetof(TyreData,blisterThreshold)==0x24),"bad off");
		static_assert((offsetof(TyreData,grainGamma)==0x28),"bad off");
		static_assert((offsetof(TyreData,blisterGamma)==0x2C),"bad off");
		static_assert((offsetof(TyreData,grainGain)==0x30),"bad off");
		static_assert((offsetof(TyreData,blisterGain)==0x34),"bad off");
		static_assert((offsetof(TyreData,rimRadius)==0x38),"bad off");
		static_assert((offsetof(TyreData,optimumTemp)==0x3C),"bad off");
		static_assert((offsetof(TyreData,softnessIndex)==0x40),"bad off");
		static_assert((offsetof(TyreData,radiusRaiseK)==0x44),"bad off");
	};
};

//UDT: struct TyreSlipInput @len=24
	//_Func: public void TyreSlipInput(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, slip
	//_Data: this+0x4, Member, Type: float, friction
	//_Data: this+0x8, Member, Type: float, load
	//_Data: this+0xC, Member, Type: float, normalizedSlipX
	//_Data: this+0x10, Member, Type: float, normalizedSlipY
	//_Data: this+0x14, Member, Type: float, D
//UDT;

struct TyreSlipInput {
public:
	float slip;
	float friction;
	float load;
	float normalizedSlipX;
	float normalizedSlipY;
	float D;
	inline TyreSlipInput() { }
	inline TyreSlipInput(const TyreSlipInput& other) = default;
	inline TyreSlipInput& operator=(const TyreSlipInput& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(TyreSlipInput)==24),"bad size");
		static_assert((offsetof(TyreSlipInput,slip)==0x0),"bad off");
		static_assert((offsetof(TyreSlipInput,friction)==0x4),"bad off");
		static_assert((offsetof(TyreSlipInput,load)==0x8),"bad off");
		static_assert((offsetof(TyreSlipInput,normalizedSlipX)==0xC),"bad off");
		static_assert((offsetof(TyreSlipInput,normalizedSlipY)==0x10),"bad off");
		static_assert((offsetof(TyreSlipInput,D)==0x14),"bad off");
	};
};

//UDT: class IJoint @len=8 @vfcount=3
	//_VTable: 
	//_Func: public void release(); @intro @pure @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
	//_Func: public void setERPCFM(float  _arg0, float  _arg1); @intro @pure @virtual vtpo=0 vfid=1 @loc=optimized @len=0 @rva=0
	//_Func: protected void ~IJoint(); @intro @virtual vtpo=0 vfid=2 @loc=optimized @len=0 @rva=0
	//_Func: public void IJoint(const IJoint &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void IJoint(); @loc=optimized @len=0 @rva=0
	//_Func: public IJoint & operator=(const IJoint &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: protected void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=2 @loc=optimized @len=0 @rva=0
//UDT;

class IJoint {
public:
	inline IJoint() { }
	inline IJoint(const IJoint& other) = default;
	inline IJoint& operator=(const IJoint& other) = default;
	virtual void release_vf0() = 0;
	inline void release() { typedef void (IJoint::*_fpt)(); auto _f=xcast<_fpt>(get_vfp(this, 0)); return (this->*_f)(); }
	virtual void setERPCFM_vf1(float  _arg0, float  _arg1) = 0;
	inline void setERPCFM(float  _arg0, float  _arg1) { typedef void (IJoint::*_fpt)(float, float); auto _f=xcast<_fpt>(get_vfp(this, 1)); return (this->*_f)( _arg0,  _arg1); }
	virtual ~IJoint();
	inline void _guard_obj() {
		static_assert((sizeof(IJoint)==8),"bad size");
	};
};

//UDT: struct DICommand @len=24
	//_Data: this+0x0, Member, Type: int, index
	//_Data: this+0x4, Member, Type: int, button
	//_Data: this+0x8, Member, Type: bool, status
	//_Data: this+0xC, Member, Type: unsigned int, keyCode
	//_Data: this+0x10, Member, Type: int, powIndex
	//_Data: this+0x14, Member, Type: int, powValue
	//_Func: public void DICommand(int  _arg0, int  _arg1, int  _arg2, int  _arg3, unsigned int  _arg4); @loc=optimized @len=0 @rva=0
	//_Func: public void DICommand(); @loc=optimized @len=0 @rva=0
//UDT;

struct DICommand {
public:
	int index;
	int button;
	bool status;
	unsigned int keyCode;
	int powIndex;
	int powValue;
	inline DICommand() { }
	inline DICommand(const DICommand& other) = default;
	inline DICommand& operator=(const DICommand& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(DICommand)==24),"bad size");
		static_assert((offsetof(DICommand,index)==0x0),"bad off");
		static_assert((offsetof(DICommand,button)==0x4),"bad off");
		static_assert((offsetof(DICommand,status)==0x8),"bad off");
		static_assert((offsetof(DICommand,keyCode)==0xC),"bad off");
		static_assert((offsetof(DICommand,powIndex)==0x10),"bad off");
		static_assert((offsetof(DICommand,powValue)==0x14),"bad off");
	};
};

//UDT: class ICoastGenerator @len=8 @vfcount=2
	//_VTable: 
	//_Func: public void ~ICoastGenerator(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=11 @rva=2693184
	//_Func: public float getCoastTorque(); @intro @pure @virtual vtpo=0 vfid=1 @loc=optimized @len=0 @rva=0
	//_Func: public void ICoastGenerator(const ICoastGenerator &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ICoastGenerator(); @loc=optimized @len=0 @rva=0
	//_Func: public ICoastGenerator & operator=(const ICoastGenerator &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class ICoastGenerator {
public:
	inline ICoastGenerator() { }
	inline ICoastGenerator(const ICoastGenerator& other) = default;
	inline ICoastGenerator& operator=(const ICoastGenerator& other) = default;
	virtual ~ICoastGenerator();
	inline void dtor() { typedef void (ICoastGenerator::*_fpt)(); auto _f=xcast<_fpt>(_drva(2693184)); (this->*_f)(); }
	virtual float getCoastTorque_vf1() = 0;
	inline float getCoastTorque() { typedef float (ICoastGenerator::*_fpt)(); auto _f=xcast<_fpt>(get_vfp(this, 1)); return (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(ICoastGenerator)==8),"bad size");
	};
};

//UDT: struct ksgui::ksRect @len=16
	//_Func: public void ksRect(); @loc=optimized @len=0 @rva=0
	//_Func: public void ksRect(float  _arg0, float  _arg1, float  _arg2, float  _arg3); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, left
	//_Data: this+0x4, Member, Type: float, right
	//_Data: this+0x8, Member, Type: float, top
	//_Data: this+0xC, Member, Type: float, bottom
	//_Func: public float getWidth(); @loc=static @len=10 @rva=694320
	//_Func: public float getHeight(); @loc=static @len=11 @rva=220096
	//_Func: public void scaleByMult(float  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct ksgui_ksRect {
public:
	float left;
	float right;
	float top;
	float bottom;
	inline ksgui_ksRect() { }
	inline ksgui_ksRect(const ksgui_ksRect& other) = default;
	inline ksgui_ksRect& operator=(const ksgui_ksRect& other) = default;
	inline float getWidth() { typedef float (ksgui_ksRect::*_fpt)(); auto _f=xcast<_fpt>(_drva(694320)); return (this->*_f)(); }
	inline float getHeight() { typedef float (ksgui_ksRect::*_fpt)(); auto _f=xcast<_fpt>(_drva(220096)); return (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_ksRect)==16),"bad size");
		static_assert((offsetof(ksgui_ksRect,left)==0x0),"bad off");
		static_assert((offsetof(ksgui_ksRect,right)==0x4),"bad off");
		static_assert((offsetof(ksgui_ksRect,top)==0x8),"bad off");
		static_assert((offsetof(ksgui_ksRect,bottom)==0xC),"bad off");
	};
};

//UDT: struct ksgui::GUI::FormData @len=16
	//_Data: this+0x0, Member, Type: float, x
	//_Data: this+0x4, Member, Type: float, y
	//_Data: this+0x8, Member, Type: bool, visible
	//_Data: this+0x9, Member, Type: bool, blocked
	//_Data: this+0xC, Member, Type: float, scale
	//_Func: public void FormData(); @loc=optimized @len=0 @rva=0
//UDT;

struct ksgui_GUI_FormData {
public:
	float x;
	float y;
	bool visible;
	bool blocked;
	float scale;
	inline ksgui_GUI_FormData() { }
	inline ksgui_GUI_FormData(const ksgui_GUI_FormData& other) = default;
	inline ksgui_GUI_FormData& operator=(const ksgui_GUI_FormData& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_GUI_FormData)==16),"bad size");
		static_assert((offsetof(ksgui_GUI_FormData,x)==0x0),"bad off");
		static_assert((offsetof(ksgui_GUI_FormData,y)==0x4),"bad off");
		static_assert((offsetof(ksgui_GUI_FormData,visible)==0x8),"bad off");
		static_assert((offsetof(ksgui_GUI_FormData,blocked)==0x9),"bad off");
		static_assert((offsetof(ksgui_GUI_FormData,scale)==0xC),"bad off");
	};
};

//UDT: struct MovementDelays @len=32
	//_Func: public void MovementDelays(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, delayRight
	//_Data: this+0x4, Member, Type: float, delayLeft
	//_Data: this+0x8, Member, Type: float, delayForward
	//_Data: this+0xC, Member, Type: float, delayBack
	//_Data: this+0x10, Member, Type: float, mouseDelayX
	//_Data: this+0x14, Member, Type: float, mouseDelayY
	//_Data: this+0x18, Member, Type: float, delayPitch
	//_Data: this+0x1C, Member, Type: float, delayYaw
//UDT;

struct MovementDelays {
public:
	float delayRight;
	float delayLeft;
	float delayForward;
	float delayBack;
	float mouseDelayX;
	float mouseDelayY;
	float delayPitch;
	float delayYaw;
	inline MovementDelays() { }
	inline MovementDelays(const MovementDelays& other) = default;
	inline MovementDelays& operator=(const MovementDelays& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(MovementDelays)==32),"bad size");
		static_assert((offsetof(MovementDelays,delayRight)==0x0),"bad off");
		static_assert((offsetof(MovementDelays,delayLeft)==0x4),"bad off");
		static_assert((offsetof(MovementDelays,delayForward)==0x8),"bad off");
		static_assert((offsetof(MovementDelays,delayBack)==0xC),"bad off");
		static_assert((offsetof(MovementDelays,mouseDelayX)==0x10),"bad off");
		static_assert((offsetof(MovementDelays,mouseDelayY)==0x14),"bad off");
		static_assert((offsetof(MovementDelays,delayPitch)==0x18),"bad off");
		static_assert((offsetof(MovementDelays,delayYaw)==0x1C),"bad off");
	};
};

//UDT: struct CoreCPUTimes @len=24
	//_Data: this+0x0, Member, Type: double, solverTime
	//_Data: this+0x8, Member, Type: double, collisionTime
	//_Data: this+0x10, Member, Type: int, contactPoints
	//_Data: this+0x14, Member, Type: int, narrowPhaseTests
	//_Func: public void CoreCPUTimes(); @loc=optimized @len=0 @rva=0
//UDT;

struct CoreCPUTimes {
public:
	double solverTime;
	double collisionTime;
	int contactPoints;
	int narrowPhaseTests;
	inline CoreCPUTimes() { }
	inline CoreCPUTimes(const CoreCPUTimes& other) = default;
	inline CoreCPUTimes& operator=(const CoreCPUTimes& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(CoreCPUTimes)==24),"bad size");
		static_assert((offsetof(CoreCPUTimes,solverTime)==0x0),"bad off");
		static_assert((offsetof(CoreCPUTimes,collisionTime)==0x8),"bad off");
		static_assert((offsetof(CoreCPUTimes,contactPoints)==0x10),"bad off");
		static_assert((offsetof(CoreCPUTimes,narrowPhaseTests)==0x14),"bad off");
	};
};

//UDT: class ThreadMutex @len=40
	//_Data: this+0x0, Member, Type: struct _RTL_CRITICAL_SECTION, criticalSection
	//_Func: public void ThreadMutex(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~ThreadMutex(); @loc=static @len=7 @rva=783552
	//_Func: public bool take(); @loc=optimized @len=0 @rva=0
	//_Func: public void release(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class ThreadMutex {
public:
	_RTL_CRITICAL_SECTION criticalSection;
	inline ThreadMutex() { }
	inline ThreadMutex(const ThreadMutex& other) = default;
	inline ThreadMutex& operator=(const ThreadMutex& other) = default;
	inline void dtor() { typedef void (ThreadMutex::*_fpt)(); auto _f=xcast<_fpt>(_drva(783552)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(ThreadMutex)==40),"bad size");
		static_assert((offsetof(ThreadMutex,criticalSection)==0x0),"bad off");
	};
};

//UDT: class PIDController @len=20
	//_Func: public void PIDController(); @loc=static @len=16 @rva=4515600
	//_Func: public void PIDController(float  _arg0, float  _arg1, float  _arg2); @loc=optimized @len=0 @rva=0
	//_Func: public void ~PIDController(); @loc=static @len=3 @rva=96368
	//_Data: this+0x0, Member, Type: float, P
	//_Data: this+0x4, Member, Type: float, I
	//_Data: this+0x8, Member, Type: float, D
	//_Data: this+0xC, Member, Type: float, currentError
	//_Func: public float eval(float targetv, float currentv, float dt); @loc=static @len=182 @rva=4515616
	//_Func: public void setPID(float p, float i, float d); @loc=static @len=15 @rva=4515824
	//_Func: public void reset(); @loc=static @len=7 @rva=4515808
	//_Data: this+0x10, Member, Type: float, integral
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class PIDController {
public:
	float P;
	float I;
	float D;
	float currentError;
	float integral;
	inline PIDController() { }
	inline PIDController(const PIDController& other) = default;
	inline PIDController& operator=(const PIDController& other) = default;
	inline void ctor() { typedef void (PIDController::*_fpt)(); auto _f=xcast<_fpt>(_drva(4515600)); (this->*_f)(); }
	inline void dtor() { typedef void (PIDController::*_fpt)(); auto _f=xcast<_fpt>(_drva(96368)); (this->*_f)(); }
	inline float eval(float targetv, float currentv, float dt) { typedef float (PIDController::*_fpt)(float, float, float); auto _f=xcast<_fpt>(_drva(4515616)); return (this->*_f)(targetv, currentv, dt); }
	inline void setPID(float p, float i, float d) { typedef void (PIDController::*_fpt)(float, float, float); auto _f=xcast<_fpt>(_drva(4515824)); return (this->*_f)(p, i, d); }
	inline void reset() { typedef void (PIDController::*_fpt)(); auto _f=xcast<_fpt>(_drva(4515808)); return (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(PIDController)==20),"bad size");
		static_assert((offsetof(PIDController,P)==0x0),"bad off");
		static_assert((offsetof(PIDController,I)==0x4),"bad off");
		static_assert((offsetof(PIDController,D)==0x8),"bad off");
		static_assert((offsetof(PIDController,currentError)==0xC),"bad off");
		static_assert((offsetof(PIDController,integral)==0x10),"bad off");
	};
};

//UDT: class KGLIndexBuffer @len=8
	//_Func: public void KGLIndexBuffer(ID3D11Device * device, unsigned int size, unsigned short * data); @loc=static @len=128 @rva=147296
	//_Func: public void ~KGLIndexBuffer(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: struct ID3D11Buffer *, buffer
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class KGLIndexBuffer {
public:
	ID3D11Buffer * buffer;
	inline KGLIndexBuffer() { }
	inline KGLIndexBuffer(const KGLIndexBuffer& other) = default;
	inline KGLIndexBuffer& operator=(const KGLIndexBuffer& other) = default;
	inline void ctor(ID3D11Device * device, unsigned int size, unsigned short * data) { typedef void (KGLIndexBuffer::*_fpt)(ID3D11Device *, unsigned int, unsigned short *); auto _f=xcast<_fpt>(_drva(147296)); (this->*_f)(device, size, data); }
	inline void _guard_obj() {
		static_assert((sizeof(KGLIndexBuffer)==8),"bad size");
		static_assert((offsetof(KGLIndexBuffer,buffer)==0x0),"bad off");
	};
};

//UDT: struct PitStopTimings @len=20
	//_Data: this+0x0, Member, Type: float, tyreChangeTimeSec
	//_Data: this+0x4, Member, Type: float, fuelChangeTimeSec
	//_Data: this+0x8, Member, Type: float, bodyRepairTimeSec
	//_Data: this+0xC, Member, Type: float, engineRepairTimeSec
	//_Data: this+0x10, Member, Type: float, suspRepairTimeSec
	//_Func: public void PitStopTimings(); @loc=optimized @len=0 @rva=0
//UDT;

struct PitStopTimings {
public:
	float tyreChangeTimeSec;
	float fuelChangeTimeSec;
	float bodyRepairTimeSec;
	float engineRepairTimeSec;
	float suspRepairTimeSec;
	inline PitStopTimings() { }
	inline PitStopTimings(const PitStopTimings& other) = default;
	inline PitStopTimings& operator=(const PitStopTimings& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(PitStopTimings)==20),"bad size");
		static_assert((offsetof(PitStopTimings,tyreChangeTimeSec)==0x0),"bad off");
		static_assert((offsetof(PitStopTimings,fuelChangeTimeSec)==0x4),"bad off");
		static_assert((offsetof(PitStopTimings,bodyRepairTimeSec)==0x8),"bad off");
		static_assert((offsetof(PitStopTimings,engineRepairTimeSec)==0xC),"bad off");
		static_assert((offsetof(PitStopTimings,suspRepairTimeSec)==0x10),"bad off");
	};
};

//UDT: struct KGLShaderVarDesc @len=32
	//_Data: this+0x0, Member, Type: const wchar_t *, name
	//_Data: this+0x8, Member, Type: const wchar_t *, cBufferName
	//_Data: this+0x10, Member, Type: unsigned int, cBufferSlot
	//_Data: this+0x14, Member, Type: unsigned int, size
	//_Data: this+0x18, Member, Type: unsigned int, offset
//UDT;

struct KGLShaderVarDesc {
public:
	const wchar_t * name;
	const wchar_t * cBufferName;
	unsigned int cBufferSlot;
	unsigned int size;
	unsigned int offset;
	inline KGLShaderVarDesc() { }
	inline KGLShaderVarDesc(const KGLShaderVarDesc& other) = default;
	inline KGLShaderVarDesc& operator=(const KGLShaderVarDesc& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(KGLShaderVarDesc)==32),"bad size");
		static_assert((offsetof(KGLShaderVarDesc,name)==0x0),"bad off");
		static_assert((offsetof(KGLShaderVarDesc,cBufferName)==0x8),"bad off");
		static_assert((offsetof(KGLShaderVarDesc,cBufferSlot)==0x10),"bad off");
		static_assert((offsetof(KGLShaderVarDesc,size)==0x14),"bad off");
		static_assert((offsetof(KGLShaderVarDesc,offset)==0x18),"bad off");
	};
};

//UDT: class KGLRenderTarget @len=48
	//_Func: public void KGLRenderTarget(ID3D11DepthStencilView *  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void KGLRenderTarget(ID3D11RenderTargetView *  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void KGLRenderTarget(ID3D11Device * device, DXGI_FORMAT fmt, unsigned int iwidth, unsigned int iheight, bool isDepth, int aSamples, int mips); @loc=static @len=608 @rva=144080
	//_Func: public void ~KGLRenderTarget(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: struct ID3D11Texture2D *, rtTexture
	//_Data: this+0x8, Member, Type: struct ID3D11RenderTargetView *, renderTargetView
	//_Data: this+0x10, Member, Type: struct ID3D11ShaderResourceView *, shaderResourceView
	//_Data: this+0x18, Member, Type: struct ID3D11DepthStencilView *, renderTargetViewDepth
	//_Data: this+0x20, Member, Type: enum DXGI_FORMAT, format
	//_Data: this+0x24, Member, Type: unsigned int, width
	//_Data: this+0x28, Member, Type: unsigned int, height
	//_Data: this+0x2C, Member, Type: int, samples
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class KGLRenderTarget {
public:
	ID3D11Texture2D * rtTexture;
	ID3D11RenderTargetView * renderTargetView;
	ID3D11ShaderResourceView * shaderResourceView;
	ID3D11DepthStencilView * renderTargetViewDepth;
	DXGI_FORMAT format;
	unsigned int width;
	unsigned int height;
	int samples;
	inline KGLRenderTarget() { }
	inline KGLRenderTarget(const KGLRenderTarget& other) = default;
	inline KGLRenderTarget& operator=(const KGLRenderTarget& other) = default;
	inline void ctor(ID3D11Device * device, DXGI_FORMAT fmt, unsigned int iwidth, unsigned int iheight, bool isDepth, int aSamples, int mips) { typedef void (KGLRenderTarget::*_fpt)(ID3D11Device *, DXGI_FORMAT, unsigned int, unsigned int, bool, int, int); auto _f=xcast<_fpt>(_drva(144080)); (this->*_f)(device, fmt, iwidth, iheight, isDepth, aSamples, mips); }
	inline void _guard_obj() {
		static_assert((sizeof(KGLRenderTarget)==48),"bad size");
		static_assert((offsetof(KGLRenderTarget,rtTexture)==0x0),"bad off");
		static_assert((offsetof(KGLRenderTarget,renderTargetView)==0x8),"bad off");
		static_assert((offsetof(KGLRenderTarget,shaderResourceView)==0x10),"bad off");
		static_assert((offsetof(KGLRenderTarget,renderTargetViewDepth)==0x18),"bad off");
		static_assert((offsetof(KGLRenderTarget,format)==0x20),"bad off");
		static_assert((offsetof(KGLRenderTarget,width)==0x24),"bad off");
		static_assert((offsetof(KGLRenderTarget,height)==0x28),"bad off");
		static_assert((offsetof(KGLRenderTarget,samples)==0x2C),"bad off");
	};
};

//UDT: struct SteerMzLowSpeedReduction @len=8
	//_Data: this+0x0, Member, Type: float, speedKMH
	//_Data: this+0x4, Member, Type: float, minValue
	//_Func: public void SteerMzLowSpeedReduction(); @loc=optimized @len=0 @rva=0
//UDT;

struct SteerMzLowSpeedReduction {
public:
	float speedKMH;
	float minValue;
	inline SteerMzLowSpeedReduction() { }
	inline SteerMzLowSpeedReduction(const SteerMzLowSpeedReduction& other) = default;
	inline SteerMzLowSpeedReduction& operator=(const SteerMzLowSpeedReduction& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(SteerMzLowSpeedReduction)==8),"bad size");
		static_assert((offsetof(SteerMzLowSpeedReduction,speedKMH)==0x0),"bad off");
		static_assert((offsetof(SteerMzLowSpeedReduction,minValue)==0x4),"bad off");
	};
};

//UDT: struct RenderStats @len=20
	//_Func: public void RenderStats(); @loc=optimized @len=0 @rva=0
	//_Func: public void reset(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: int, dipCalls
	//_Data: this+0x4, Member, Type: int, sceneDipCalls
	//_Data: this+0x8, Member, Type: int, triangles
	//_Data: this+0xC, Member, Type: int, sceneTriangles
	//_Data: this+0x10, Member, Type: bool, isInMainRenderPass
//UDT;

struct RenderStats {
public:
	int dipCalls;
	int sceneDipCalls;
	int triangles;
	int sceneTriangles;
	bool isInMainRenderPass;
	inline RenderStats() { }
	inline RenderStats(const RenderStats& other) = default;
	inline RenderStats& operator=(const RenderStats& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(RenderStats)==20),"bad size");
		static_assert((offsetof(RenderStats,dipCalls)==0x0),"bad off");
		static_assert((offsetof(RenderStats,sceneDipCalls)==0x4),"bad off");
		static_assert((offsetof(RenderStats,triangles)==0x8),"bad off");
		static_assert((offsetof(RenderStats,sceneTriangles)==0xC),"bad off");
		static_assert((offsetof(RenderStats,isInMainRenderPass)==0x10),"bad off");
	};
};

//UDT: struct HDRLevels @len=8
	//_Func: public void HDRLevels(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, minExposure
	//_Data: this+0x4, Member, Type: float, maxExposure
//UDT;

struct HDRLevels {
public:
	float minExposure;
	float maxExposure;
	inline HDRLevels() { }
	inline HDRLevels(const HDRLevels& other) = default;
	inline HDRLevels& operator=(const HDRLevels& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(HDRLevels)==8),"bad size");
		static_assert((offsetof(HDRLevels,minExposure)==0x0),"bad off");
		static_assert((offsetof(HDRLevels,maxExposure)==0x4),"bad off");
	};
};

//UDT: struct WindSettings @len=8
	//_Data: this+0x0, Member, Type: float, baseSpeed
	//_Data: this+0x4, Member, Type: float, baseDirection
	//_Func: public void WindSettings(); @loc=optimized @len=0 @rva=0
//UDT;

struct WindSettings {
public:
	float baseSpeed;
	float baseDirection;
	inline WindSettings() { }
	inline WindSettings(const WindSettings& other) = default;
	inline WindSettings& operator=(const WindSettings& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(WindSettings)==8),"bad size");
		static_assert((offsetof(WindSettings,baseSpeed)==0x0),"bad off");
		static_assert((offsetof(WindSettings,baseDirection)==0x4),"bad off");
	};
};

//UDT: struct SplineLocationData @len=4
	//_Func: public void SplineLocationData(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: int, currentIndex
//UDT;

struct SplineLocationData {
public:
	int currentIndex;
	inline SplineLocationData() { }
	inline SplineLocationData(const SplineLocationData& other) = default;
	inline SplineLocationData& operator=(const SplineLocationData& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(SplineLocationData)==4),"bad size");
		static_assert((offsetof(SplineLocationData,currentIndex)==0x0),"bad off");
	};
};

//UDT: struct OnKeyCharEvent @len=4
	//_Func: public void OnKeyCharEvent(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: unsigned int, key
//UDT;

struct OnKeyCharEvent {
public:
	unsigned int key;
	inline OnKeyCharEvent() { }
	inline OnKeyCharEvent(const OnKeyCharEvent& other) = default;
	inline OnKeyCharEvent& operator=(const OnKeyCharEvent& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(OnKeyCharEvent)==4),"bad size");
		static_assert((offsetof(OnKeyCharEvent,key)==0x0),"bad off");
	};
};

//UDT: struct CommandItem @len=4
	//_Func: public void CommandItem(int akey); @loc=static @len=6 @rva=953184
	//_Func: public void CommandItem(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: int, key
//UDT;

struct CommandItem {
public:
	int key;
	inline CommandItem() { }
	inline CommandItem(const CommandItem& other) = default;
	inline CommandItem& operator=(const CommandItem& other) = default;
	inline void ctor(int akey) { typedef void (CommandItem::*_fpt)(int); auto _f=xcast<_fpt>(_drva(953184)); (this->*_f)(akey); }
	inline void _guard_obj() {
		static_assert((sizeof(CommandItem)==4),"bad size");
		static_assert((offsetof(CommandItem,key)==0x0),"bad off");
	};
};

//UDT: struct AWD2Data @len=24
	//_Data: this+0x0, Member, Type: double, ramp
	//_Data: this+0x8, Member, Type: double, maxTorque
	//_Data: this+0x10, Member, Type: float, currentLockTorque
	//_Func: public void AWD2Data(); @loc=optimized @len=0 @rva=0
//UDT;

struct AWD2Data {
public:
	double ramp;
	double maxTorque;
	float currentLockTorque;
	inline AWD2Data() { }
	inline AWD2Data(const AWD2Data& other) = default;
	inline AWD2Data& operator=(const AWD2Data& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(AWD2Data)==24),"bad size");
		static_assert((offsetof(AWD2Data,ramp)==0x0),"bad off");
		static_assert((offsetof(AWD2Data,maxTorque)==0x8),"bad off");
		static_assert((offsetof(AWD2Data,currentLockTorque)==0x10),"bad off");
	};
};

//UDT: struct NetCarPushToPass @len=20
	//_Data: this+0x0, Member, Type: bool, enabled
	//_Data: this+0x1, Member, Type: bool, active
	//_Data: this+0x4, Member, Type: float, coolDownS
	//_Data: this+0x8, Member, Type: float, timeS
	//_Data: this+0xC, Member, Type: float, timeAccum
	//_Data: this+0x10, Member, Type: int, activations
	//_Func: public void NetCarPushToPass(); @loc=optimized @len=0 @rva=0
//UDT;

struct NetCarPushToPass {
public:
	bool enabled;
	bool active;
	float coolDownS;
	float timeS;
	float timeAccum;
	int activations;
	inline NetCarPushToPass() { }
	inline NetCarPushToPass(const NetCarPushToPass& other) = default;
	inline NetCarPushToPass& operator=(const NetCarPushToPass& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(NetCarPushToPass)==20),"bad size");
		static_assert((offsetof(NetCarPushToPass,enabled)==0x0),"bad off");
		static_assert((offsetof(NetCarPushToPass,active)==0x1),"bad off");
		static_assert((offsetof(NetCarPushToPass,coolDownS)==0x4),"bad off");
		static_assert((offsetof(NetCarPushToPass,timeS)==0x8),"bad off");
		static_assert((offsetof(NetCarPushToPass,timeAccum)==0xC),"bad off");
		static_assert((offsetof(NetCarPushToPass,activations)==0x10),"bad off");
	};
};

//UDT: struct OnRaceInitEvent @len=4
	//_Func: public void OnRaceInitEvent(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: int, laps
//UDT;

struct OnRaceInitEvent {
public:
	int laps;
	inline OnRaceInitEvent() { }
	inline OnRaceInitEvent(const OnRaceInitEvent& other) = default;
	inline OnRaceInitEvent& operator=(const OnRaceInitEvent& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(OnRaceInitEvent)==4),"bad size");
		static_assert((offsetof(OnRaceInitEvent,laps)==0x0),"bad off");
	};
};

//UDT: class Trigger @len=12
	//_Func: public void Trigger(); @loc=static @len=13 @rva=2339728
	//_Func: public void ~Trigger(); @loc=static @len=3 @rva=96368
	//_Func: public bool hasSwitchedState(bool  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public bool ignoreSubsequentTrue(bool value); @loc=static @len=32 @rva=2339744
	//_Func: public bool keepSteady(float dt, bool value); @loc=static @len=60 @rva=2339776
	//_Func: public bool turnOn(bool  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public bool turnOff(bool  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void setAccumulatorLimit(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: bool, state
	//_Data: this+0x1, Member, Type: bool, lastState
	//_Data: this+0x4, Member, Type: float, accumulator
	//_Data: this+0x8, Member, Type: float, accumulatorLimit
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class Trigger {
public:
	bool state;
	bool lastState;
	float accumulator;
	float accumulatorLimit;
	inline Trigger() { }
	inline Trigger(const Trigger& other) = default;
	inline Trigger& operator=(const Trigger& other) = default;
	inline void ctor() { typedef void (Trigger::*_fpt)(); auto _f=xcast<_fpt>(_drva(2339728)); (this->*_f)(); }
	inline void dtor() { typedef void (Trigger::*_fpt)(); auto _f=xcast<_fpt>(_drva(96368)); (this->*_f)(); }
	inline bool ignoreSubsequentTrue(bool value) { typedef bool (Trigger::*_fpt)(bool); auto _f=xcast<_fpt>(_drva(2339744)); return (this->*_f)(value); }
	inline bool keepSteady(float dt, bool value) { typedef bool (Trigger::*_fpt)(float, bool); auto _f=xcast<_fpt>(_drva(2339776)); return (this->*_f)(dt, value); }
	inline void _guard_obj() {
		static_assert((sizeof(Trigger)==12),"bad size");
		static_assert((offsetof(Trigger,state)==0x0),"bad off");
		static_assert((offsetof(Trigger,lastState)==0x1),"bad off");
		static_assert((offsetof(Trigger,accumulator)==0x4),"bad off");
		static_assert((offsetof(Trigger,accumulatorLimit)==0x8),"bad off");
	};
};

//UDT: class CBuffer @len=40
	//_Func: public void CBuffer(); @loc=static @len=27 @rva=2201856
	//_Func: public void CBuffer(int islot, int isize); @loc=static @len=104 @rva=2201744
	//_Func: public void ~CBuffer(); @loc=static @len=55 @rva=2202128
	//_Data: this+0x0, Member, Type: int, size
	//_Data: this+0x4, Member, Type: int, slot
	//_Data: this+0x8, Member, Type: bool, isSystem
	//_Data: this+0x9, Member, Type: bool, isPS
	//_Data: this+0xA, Member, Type: bool, isVS
	//_Data: this+0x10, Member, Type: void *, kid
	//_Func: public void set(int * value, int offset, int size); @loc=static @len=37 @rva=2202192
	//_Func: public void set(float * value, int offset, int size); @loc=static @len=37 @rva=2202192
	//_Func: public void get(int *  _arg0, int  _arg1, int  _arg2); @loc=optimized @len=0 @rva=0
	//_Func: public void get(float * value, int offset, int size); @loc=static @len=24 @rva=2201968
	//_Func: public void commit(); @loc=static @len=77 @rva=2201888
	//_Func: public void touch(); @loc=static @len=5 @rva=2202240
	//_Func: public void map(void * bdata, int bsize); @loc=static @len=28 @rva=2202096
	//_Func: public void init(int islot, int isize); @loc=static @len=82 @rva=2202000
	//_Func: public void release(); @loc=static @len=55 @rva=2202128
	//_Data: this+0x18, Member, Type: unsigned char *, data
	//_Data: this+0x20, Member, Type: bool, touched
	//_Func: public void __autoclassinit2(unsigned __int64  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class CBuffer {
public:
	int size;
	int slot;
	bool isSystem;
	bool isPS;
	bool isVS;
	void * kid;
	unsigned char * data;
	bool touched;
	inline CBuffer() { }
	inline CBuffer(const CBuffer& other) = default;
	inline CBuffer& operator=(const CBuffer& other) = default;
	inline void ctor() { typedef void (CBuffer::*_fpt)(); auto _f=xcast<_fpt>(_drva(2201856)); (this->*_f)(); }
	inline void ctor(int islot, int isize) { typedef void (CBuffer::*_fpt)(int, int); auto _f=xcast<_fpt>(_drva(2201744)); (this->*_f)(islot, isize); }
	inline void dtor() { typedef void (CBuffer::*_fpt)(); auto _f=xcast<_fpt>(_drva(2202128)); (this->*_f)(); }
	inline void set(int * value, int offset, int size) { typedef void (CBuffer::*_fpt)(int *, int, int); auto _f=xcast<_fpt>(_drva(2202192)); return (this->*_f)(value, offset, size); }
	inline void set(float * value, int offset, int size) { typedef void (CBuffer::*_fpt)(float *, int, int); auto _f=xcast<_fpt>(_drva(2202192)); return (this->*_f)(value, offset, size); }
	inline void get(float * value, int offset, int size) { typedef void (CBuffer::*_fpt)(float *, int, int); auto _f=xcast<_fpt>(_drva(2201968)); return (this->*_f)(value, offset, size); }
	inline void commit() { typedef void (CBuffer::*_fpt)(); auto _f=xcast<_fpt>(_drva(2201888)); return (this->*_f)(); }
	inline void touch() { typedef void (CBuffer::*_fpt)(); auto _f=xcast<_fpt>(_drva(2202240)); return (this->*_f)(); }
	inline void map(void * bdata, int bsize) { typedef void (CBuffer::*_fpt)(void *, int); auto _f=xcast<_fpt>(_drva(2202096)); return (this->*_f)(bdata, bsize); }
	inline void init(int islot, int isize) { typedef void (CBuffer::*_fpt)(int, int); auto _f=xcast<_fpt>(_drva(2202000)); return (this->*_f)(islot, isize); }
	inline void release() { typedef void (CBuffer::*_fpt)(); auto _f=xcast<_fpt>(_drva(2202128)); return (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(CBuffer)==40),"bad size");
		static_assert((offsetof(CBuffer,size)==0x0),"bad off");
		static_assert((offsetof(CBuffer,slot)==0x4),"bad off");
		static_assert((offsetof(CBuffer,isSystem)==0x8),"bad off");
		static_assert((offsetof(CBuffer,isPS)==0x9),"bad off");
		static_assert((offsetof(CBuffer,isVS)==0xA),"bad off");
		static_assert((offsetof(CBuffer,kid)==0x10),"bad off");
		static_assert((offsetof(CBuffer,data)==0x18),"bad off");
		static_assert((offsetof(CBuffer,touched)==0x20),"bad off");
	};
};

//UDT: struct TyreModelInput @len=48
	//_Data: this+0x0, Member, Type: float, load
	//_Data: this+0x4, Member, Type: float, slipAngleRAD
	//_Data: this+0x8, Member, Type: float, slipRatio
	//_Data: this+0xC, Member, Type: float, camberRAD
	//_Data: this+0x10, Member, Type: float, speed
	//_Data: this+0x14, Member, Type: float, u
	//_Data: this+0x18, Member, Type: int, tyreIndex
	//_Data: this+0x1C, Member, Type: float, cpLength
	//_Data: this+0x20, Member, Type: float, grain
	//_Data: this+0x24, Member, Type: float, blister
	//_Data: this+0x28, Member, Type: float, pressureRatio
	//_Data: this+0x2C, Member, Type: bool, useSimpleModel
//UDT;

struct TyreModelInput {
public:
	float load;
	float slipAngleRAD;
	float slipRatio;
	float camberRAD;
	float speed;
	float u;
	int tyreIndex;
	float cpLength;
	float grain;
	float blister;
	float pressureRatio;
	bool useSimpleModel;
	inline TyreModelInput() { }
	inline TyreModelInput(const TyreModelInput& other) = default;
	inline TyreModelInput& operator=(const TyreModelInput& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(TyreModelInput)==48),"bad size");
		static_assert((offsetof(TyreModelInput,load)==0x0),"bad off");
		static_assert((offsetof(TyreModelInput,slipAngleRAD)==0x4),"bad off");
		static_assert((offsetof(TyreModelInput,slipRatio)==0x8),"bad off");
		static_assert((offsetof(TyreModelInput,camberRAD)==0xC),"bad off");
		static_assert((offsetof(TyreModelInput,speed)==0x10),"bad off");
		static_assert((offsetof(TyreModelInput,u)==0x14),"bad off");
		static_assert((offsetof(TyreModelInput,tyreIndex)==0x18),"bad off");
		static_assert((offsetof(TyreModelInput,cpLength)==0x1C),"bad off");
		static_assert((offsetof(TyreModelInput,grain)==0x20),"bad off");
		static_assert((offsetof(TyreModelInput,blister)==0x24),"bad off");
		static_assert((offsetof(TyreModelInput,pressureRatio)==0x28),"bad off");
		static_assert((offsetof(TyreModelInput,useSimpleModel)==0x2C),"bad off");
	};
};

//UDT: struct SurfaceDef @len=200
	//_Func: public void SurfaceDef(const SurfaceDef &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void SurfaceDef(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: wchar_t[0x40], wavString
	//_Data: this+0x80, Member, Type: float, wavPitchSpeed
	//_Data: this+0x88, Member, Type: void *, userPointer
	//_Data: this+0x90, Member, Type: float, gripMod
	//_Data: this+0x94, Member, Type: int, sectorID
	//_Data: this+0x98, Member, Type: float, dirtAdditiveK
	//_Data: this+0x9C, Member, Type: unsigned int, collisionCategory
	//_Data: this+0xA0, Member, Type: bool, isValidTrack
	//_Data: this+0xA4, Member, Type: float, blackFlagTime
	//_Data: this+0xA8, Member, Type: float, sinHeight
	//_Data: this+0xAC, Member, Type: float, sinLength
	//_Data: this+0xB0, Member, Type: bool, isPitlane
	//_Data: this+0xB4, Member, Type: float, damping
	//_Data: this+0xB8, Member, Type: float, granularity
	//_Data: this+0xBC, Member, Type: float, vibrationGain
	//_Data: this+0xC0, Member, Type: float, vibrationLength
//UDT;

struct SurfaceDef {
public:
	wchar_t wavString[64];
	float wavPitchSpeed;
	void * userPointer;
	float gripMod;
	int sectorID;
	float dirtAdditiveK;
	unsigned int collisionCategory;
	bool isValidTrack;
	float blackFlagTime;
	float sinHeight;
	float sinLength;
	bool isPitlane;
	float damping;
	float granularity;
	float vibrationGain;
	float vibrationLength;
	inline SurfaceDef() { }
	inline SurfaceDef(const SurfaceDef& other) = default;
	inline SurfaceDef& operator=(const SurfaceDef& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(SurfaceDef)==200),"bad size");
		static_assert((offsetof(SurfaceDef,wavString)==0x0),"bad off");
		static_assert((offsetof(SurfaceDef,wavPitchSpeed)==0x80),"bad off");
		static_assert((offsetof(SurfaceDef,userPointer)==0x88),"bad off");
		static_assert((offsetof(SurfaceDef,gripMod)==0x90),"bad off");
		static_assert((offsetof(SurfaceDef,sectorID)==0x94),"bad off");
		static_assert((offsetof(SurfaceDef,dirtAdditiveK)==0x98),"bad off");
		static_assert((offsetof(SurfaceDef,collisionCategory)==0x9C),"bad off");
		static_assert((offsetof(SurfaceDef,isValidTrack)==0xA0),"bad off");
		static_assert((offsetof(SurfaceDef,blackFlagTime)==0xA4),"bad off");
		static_assert((offsetof(SurfaceDef,sinHeight)==0xA8),"bad off");
		static_assert((offsetof(SurfaceDef,sinLength)==0xAC),"bad off");
		static_assert((offsetof(SurfaceDef,isPitlane)==0xB0),"bad off");
		static_assert((offsetof(SurfaceDef,damping)==0xB4),"bad off");
		static_assert((offsetof(SurfaceDef,granularity)==0xB8),"bad off");
		static_assert((offsetof(SurfaceDef,vibrationGain)==0xBC),"bad off");
		static_assert((offsetof(SurfaceDef,vibrationLength)==0xC0),"bad off");
	};
};

//UDT: struct TrackInfo @len=4
	//_Data: this+0x0, Member, Type: float, length
	//_Func: public void TrackInfo(); @loc=optimized @len=0 @rva=0
//UDT;

struct TrackInfo {
public:
	float length;
	inline TrackInfo() { }
	inline TrackInfo(const TrackInfo& other) = default;
	inline TrackInfo& operator=(const TrackInfo& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(TrackInfo)==4),"bad size");
		static_assert((offsetof(TrackInfo,length)==0x0),"bad off");
	};
};

//UDT: struct SusStrutDamageDef @len=28
	//_Data: this+0x0, Member, Type: float, damageAmount
	//_Data: this+0x4, Member, Type: float, damageDirection
	//_Data: this+0x8, Member, Type: float, minVelocity
	//_Data: this+0xC, Member, Type: float, damageGain
	//_Data: this+0x10, Member, Type: float, maxDamage
	//_Data: this+0x14, Member, Type: bool, isDebug
	//_Data: this+0x18, Member, Type: float, lastAmount
	//_Func: public void SusStrutDamageDef(); @loc=optimized @len=0 @rva=0
//UDT;

struct SusStrutDamageDef {
public:
	float damageAmount;
	float damageDirection;
	float minVelocity;
	float damageGain;
	float maxDamage;
	bool isDebug;
	float lastAmount;
	inline SusStrutDamageDef() { }
	inline SusStrutDamageDef(const SusStrutDamageDef& other) = default;
	inline SusStrutDamageDef& operator=(const SusStrutDamageDef& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(SusStrutDamageDef)==28),"bad size");
		static_assert((offsetof(SusStrutDamageDef,damageAmount)==0x0),"bad off");
		static_assert((offsetof(SusStrutDamageDef,damageDirection)==0x4),"bad off");
		static_assert((offsetof(SusStrutDamageDef,minVelocity)==0x8),"bad off");
		static_assert((offsetof(SusStrutDamageDef,damageGain)==0xC),"bad off");
		static_assert((offsetof(SusStrutDamageDef,maxDamage)==0x10),"bad off");
		static_assert((offsetof(SusStrutDamageDef,isDebug)==0x14),"bad off");
		static_assert((offsetof(SusStrutDamageDef,lastAmount)==0x18),"bad off");
	};
};

//UDT: struct AISplineSlimPayload @len=16
	//_Data: this+0x0, Member, Type: float, camber
	//_Data: this+0x4, Member, Type: float, grip
	//_Data: this+0x8, Member, Type: float, grade
	//_Data: this+0xC, Member, Type: bool, isPitlane
	//_Func: public void AISplineSlimPayload(); @loc=optimized @len=0 @rva=0
//UDT;

struct AISplineSlimPayload {
public:
	float camber;
	float grip;
	float grade;
	bool isPitlane;
	inline AISplineSlimPayload() { }
	inline AISplineSlimPayload(const AISplineSlimPayload& other) = default;
	inline AISplineSlimPayload& operator=(const AISplineSlimPayload& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(AISplineSlimPayload)==16),"bad size");
		static_assert((offsetof(AISplineSlimPayload,camber)==0x0),"bad off");
		static_assert((offsetof(AISplineSlimPayload,grip)==0x4),"bad off");
		static_assert((offsetof(AISplineSlimPayload,grade)==0x8),"bad off");
		static_assert((offsetof(AISplineSlimPayload,isPitlane)==0xC),"bad off");
	};
};

//UDT: struct AIStraightData @len=12
	//_Data: this+0x0, Member, Type: float, start
	//_Data: this+0x4, Member, Type: float, end
	//_Data: this+0x8, Member, Type: float, length
	//_Func: public void AIStraightData(); @loc=optimized @len=0 @rva=0
//UDT;

struct AIStraightData {
public:
	float start;
	float end;
	float length;
	inline AIStraightData() { }
	inline AIStraightData(const AIStraightData& other) = default;
	inline AIStraightData& operator=(const AIStraightData& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(AIStraightData)==12),"bad size");
		static_assert((offsetof(AIStraightData,start)==0x0),"bad off");
		static_assert((offsetof(AIStraightData,end)==0x4),"bad off");
		static_assert((offsetof(AIStraightData,length)==0x8),"bad off");
	};
};

//UDT: class Speed @len=4
	//_Func: private void Speed(float v); @loc=static @len=8 @rva=2333072
	//_Func: public void Speed(); @loc=static @len=10 @rva=2333024
	//_Func: public void ~Speed(); @loc=static @len=3 @rva=96368
	//_Func: public Speed fromMS(float ms); @pure @loc=static @len=8 @rva=2333072
	//_Func: public Speed fromKMH(float ms); @pure @loc=static @len=16 @rva=2333040
	//_Func: public Speed fromMPH(float ms); @pure @loc=static @len=16 @rva=2333056
	//_Data: static, [0155A5AE][0003:000475AE], Static Member, Type: bool, useMPH
	//_Func: public float ms(); @loc=optimized @len=0 @rva=0
	//_Func: public float kmh(); @loc=static @len=13 @rva=364368
	//_Func: public float mph(); @loc=optimized @len=0 @rva=0
	//_Func: public float toSystemDefault(); @loc=optimized @len=0 @rva=0
	//_Func: public Speed operator-(const Speed &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public Speed operator+(const Speed &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public Speed operator*(float v2); @loc=static @len=41 @rva=2502224
	//_Func: public Speed operator/(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, value
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class Speed {
public:
	float value;
	inline Speed() { }
	inline Speed(const Speed& other) = default;
	inline Speed& operator=(const Speed& other) = default;
	inline void ctor(float v) { typedef void (Speed::*_fpt)(float); auto _f=xcast<_fpt>(_drva(2333072)); (this->*_f)(v); }
	inline void ctor() { typedef void (Speed::*_fpt)(); auto _f=xcast<_fpt>(_drva(2333024)); (this->*_f)(); }
	inline void dtor() { typedef void (Speed::*_fpt)(); auto _f=xcast<_fpt>(_drva(96368)); (this->*_f)(); }
	inline static Speed fromMS(float ms) { typedef Speed (*_fpt)(float); auto _f=(_fpt)_drva(2333072); return _f(ms); }
	inline static Speed fromKMH(float ms) { typedef Speed (*_fpt)(float); auto _f=(_fpt)_drva(2333040); return _f(ms); }
	inline static Speed fromMPH(float ms) { typedef Speed (*_fpt)(float); auto _f=(_fpt)_drva(2333056); return _f(ms); }
	inline float kmh() { typedef float (Speed::*_fpt)(); auto _f=xcast<_fpt>(_drva(364368)); return (this->*_f)(); }
	inline Speed operator*(float v2) { typedef Speed (Speed::*_fpt)(float); auto _f=xcast<_fpt>(_drva(2502224)); return (this->*_f)(v2); }
	inline void _guard_obj() {
		static_assert((sizeof(Speed)==4),"bad size");
		static_assert((offsetof(Speed,value)==0x0),"bad off");
	};
};

//UDT: struct ACCarState @len=328
	//_Data: this+0x0, Member, Type: float[0x3], wheelLF_localPos
	//_Data: this+0xC, Member, Type: float[0x3], wheelRF_localPos
	//_Data: this+0x18, Member, Type: float[0x3], wheelLR_localPos
	//_Data: this+0x24, Member, Type: float[0x3], wheelRR_localPos
	//_Data: this+0x30, Member, Type: float[0x3], localVelocity
	//_Data: this+0x3C, Member, Type: float[0x3], worldVelocity
	//_Data: this+0x48, Member, Type: float[0x3], accG
	//_Data: this+0x54, Member, Type: float, engineRPMS
	//_Data: this+0x58, Member, Type: float[0x3], worldPosition
	//_Data: this+0x64, Member, Type: float[0x10], bodyMatrix
	//_Data: this+0xA4, Member, Type: int, gear
	//_Data: this+0xA8, Member, Type: bool, isEngineLimiterOn
	//_Data: this+0xAC, Member, Type: float[0x4], wheelAngularSpeed
	//_Data: this+0xBC, Member, Type: float, steer
	//_Data: this+0xC0, Member, Type: float, gas
	//_Data: this+0xC4, Member, Type: float, brake
	//_Data: this+0xC8, Member, Type: float, clutch
	//_Data: this+0xCC, Member, Type: float[0x3], localAngularVelocity
	//_Data: this+0xD8, Member, Type: float[0x4], ndSlip
	//_Data: this+0xE8, Member, Type: float[0x4], load
	//_Data: this+0xF8, Member, Type: float[0x4], Mz
	//_Data: this+0x108, Member, Type: float[0x4], tyreDirtyLevel
	//_Data: this+0x118, Member, Type: float, lastFF
	//_Data: this+0x11C, Member, Type: float, drivetrainSpeed
	//_Data: this+0x120, Member, Type: float, turboBoost
	//_Data: this+0x124, Member, Type: float, performanceMeter
	//_Data: this+0x128, Member, Type: bool, isGearGrinding
	//_Data: this+0x12C, Member, Type: float[0x5], damageZoneLevel
	//_Data: this+0x140, Member, Type: int, limiterRPM
	//_Data: this+0x144, Member, Type: float, speedMS
//UDT;

struct ACCarState {
public:
	float wheelLF_localPos[3];
	float wheelRF_localPos[3];
	float wheelLR_localPos[3];
	float wheelRR_localPos[3];
	float localVelocity[3];
	float worldVelocity[3];
	float accG[3];
	float engineRPMS;
	float worldPosition[3];
	float bodyMatrix[16];
	int gear;
	bool isEngineLimiterOn;
	float wheelAngularSpeed[4];
	float steer;
	float gas;
	float brake;
	float clutch;
	float localAngularVelocity[3];
	float ndSlip[4];
	float load[4];
	float Mz[4];
	float tyreDirtyLevel[4];
	float lastFF;
	float drivetrainSpeed;
	float turboBoost;
	float performanceMeter;
	bool isGearGrinding;
	float damageZoneLevel[5];
	int limiterRPM;
	float speedMS;
	inline ACCarState() { }
	inline ACCarState(const ACCarState& other) = default;
	inline ACCarState& operator=(const ACCarState& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ACCarState)==328),"bad size");
		static_assert((offsetof(ACCarState,wheelLF_localPos)==0x0),"bad off");
		static_assert((offsetof(ACCarState,wheelRF_localPos)==0xC),"bad off");
		static_assert((offsetof(ACCarState,wheelLR_localPos)==0x18),"bad off");
		static_assert((offsetof(ACCarState,wheelRR_localPos)==0x24),"bad off");
		static_assert((offsetof(ACCarState,localVelocity)==0x30),"bad off");
		static_assert((offsetof(ACCarState,worldVelocity)==0x3C),"bad off");
		static_assert((offsetof(ACCarState,accG)==0x48),"bad off");
		static_assert((offsetof(ACCarState,engineRPMS)==0x54),"bad off");
		static_assert((offsetof(ACCarState,worldPosition)==0x58),"bad off");
		static_assert((offsetof(ACCarState,bodyMatrix)==0x64),"bad off");
		static_assert((offsetof(ACCarState,gear)==0xA4),"bad off");
		static_assert((offsetof(ACCarState,isEngineLimiterOn)==0xA8),"bad off");
		static_assert((offsetof(ACCarState,wheelAngularSpeed)==0xAC),"bad off");
		static_assert((offsetof(ACCarState,steer)==0xBC),"bad off");
		static_assert((offsetof(ACCarState,gas)==0xC0),"bad off");
		static_assert((offsetof(ACCarState,brake)==0xC4),"bad off");
		static_assert((offsetof(ACCarState,clutch)==0xC8),"bad off");
		static_assert((offsetof(ACCarState,localAngularVelocity)==0xCC),"bad off");
		static_assert((offsetof(ACCarState,ndSlip)==0xD8),"bad off");
		static_assert((offsetof(ACCarState,load)==0xE8),"bad off");
		static_assert((offsetof(ACCarState,Mz)==0xF8),"bad off");
		static_assert((offsetof(ACCarState,tyreDirtyLevel)==0x108),"bad off");
		static_assert((offsetof(ACCarState,lastFF)==0x118),"bad off");
		static_assert((offsetof(ACCarState,drivetrainSpeed)==0x11C),"bad off");
		static_assert((offsetof(ACCarState,turboBoost)==0x120),"bad off");
		static_assert((offsetof(ACCarState,performanceMeter)==0x124),"bad off");
		static_assert((offsetof(ACCarState,isGearGrinding)==0x128),"bad off");
		static_assert((offsetof(ACCarState,damageZoneLevel)==0x12C),"bad off");
		static_assert((offsetof(ACCarState,limiterRPM)==0x140),"bad off");
		static_assert((offsetof(ACCarState,speedMS)==0x144),"bad off");
	};
};

//UDT: struct ServerDrivingAssists @len=12
	//_Data: this+0x0, Member, Type: int, tc
	//_Data: this+0x4, Member, Type: int, abs
	//_Data: this+0x8, Member, Type: bool, stability
	//_Data: this+0x9, Member, Type: bool, autoClutch
	//_Func: public void ServerDrivingAssists(); @loc=optimized @len=0 @rva=0
//UDT;

struct ServerDrivingAssists {
public:
	int tc;
	int abs;
	bool stability;
	bool autoClutch;
	inline ServerDrivingAssists() { }
	inline ServerDrivingAssists(const ServerDrivingAssists& other) = default;
	inline ServerDrivingAssists& operator=(const ServerDrivingAssists& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ServerDrivingAssists)==12),"bad size");
		static_assert((offsetof(ServerDrivingAssists,tc)==0x0),"bad off");
		static_assert((offsetof(ServerDrivingAssists,abs)==0x4),"bad off");
		static_assert((offsetof(ServerDrivingAssists,stability)==0x8),"bad off");
		static_assert((offsetof(ServerDrivingAssists,autoClutch)==0x9),"bad off");
	};
};

//UDT: struct DRSZone @len=12
	//_Data: this+0x0, Member, Type: float, detection
	//_Data: this+0x4, Member, Type: float, start
	//_Data: this+0x8, Member, Type: float, end
	//_Func: public void DRSZone(); @loc=optimized @len=0 @rva=0
//UDT;

struct DRSZone {
public:
	float detection;
	float start;
	float end;
	inline DRSZone() { }
	inline DRSZone(const DRSZone& other) = default;
	inline DRSZone& operator=(const DRSZone& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(DRSZone)==12),"bad size");
		static_assert((offsetof(DRSZone,detection)==0x0),"bad off");
		static_assert((offsetof(DRSZone,start)==0x4),"bad off");
		static_assert((offsetof(DRSZone,end)==0x8),"bad off");
	};
};

//UDT: struct FFUpgrades @len=16
	//_Data: this+0x0, Member, Type: float, curbsGain
	//_Data: this+0x4, Member, Type: float, gforceGain
	//_Data: this+0x8, Member, Type: float, slipsGain
	//_Data: this+0xC, Member, Type: float, absGain
	//_Func: public void FFUpgrades(); @loc=optimized @len=0 @rva=0
//UDT;

struct FFUpgrades {
public:
	float curbsGain;
	float gforceGain;
	float slipsGain;
	float absGain;
	inline FFUpgrades() { }
	inline FFUpgrades(const FFUpgrades& other) = default;
	inline FFUpgrades& operator=(const FFUpgrades& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(FFUpgrades)==16),"bad size");
		static_assert((offsetof(FFUpgrades,curbsGain)==0x0),"bad off");
		static_assert((offsetof(FFUpgrades,gforceGain)==0x4),"bad off");
		static_assert((offsetof(FFUpgrades,slipsGain)==0x8),"bad off");
		static_assert((offsetof(FFUpgrades,absGain)==0xC),"bad off");
	};
};

//UDT: struct PitStopTime @len=16
	//_Data: this+0x0, Member, Type: float, total
	//_Data: this+0x4, Member, Type: float, tyres
	//_Data: this+0x8, Member, Type: float, repair
	//_Data: this+0xC, Member, Type: float, fuel
	//_Func: public void PitStopTime(); @loc=optimized @len=0 @rva=0
//UDT;

struct PitStopTime {
public:
	float total;
	float tyres;
	float repair;
	float fuel;
	inline PitStopTime() { }
	inline PitStopTime(const PitStopTime& other) = default;
	inline PitStopTime& operator=(const PitStopTime& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(PitStopTime)==16),"bad size");
		static_assert((offsetof(PitStopTime,total)==0x0),"bad off");
		static_assert((offsetof(PitStopTime,tyres)==0x4),"bad off");
		static_assert((offsetof(PitStopTime,repair)==0x8),"bad off");
		static_assert((offsetof(PitStopTime,fuel)==0xC),"bad off");
	};
};

//UDT: struct TyreInputs @len=12
	//_Func: public void TyreInputs(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, brakeTorque
	//_Data: this+0x4, Member, Type: float, handBrakeTorque
	//_Data: this+0x8, Member, Type: float, electricTorque
//UDT;

struct TyreInputs {
public:
	float brakeTorque;
	float handBrakeTorque;
	float electricTorque;
	inline TyreInputs() { }
	inline TyreInputs(const TyreInputs& other) = default;
	inline TyreInputs& operator=(const TyreInputs& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(TyreInputs)==12),"bad size");
		static_assert((offsetof(TyreInputs,brakeTorque)==0x0),"bad off");
		static_assert((offsetof(TyreInputs,handBrakeTorque)==0x4),"bad off");
		static_assert((offsetof(TyreInputs,electricTorque)==0x8),"bad off");
	};
};

//UDT: struct TyreExternalInputs @len=16
	//_Data: this+0x0, Member, Type: bool, isActive
	//_Data: this+0x4, Member, Type: float, load
	//_Data: this+0x8, Member, Type: float, slipAngle
	//_Data: this+0xC, Member, Type: float, slipRatio
	//_Func: public void TyreExternalInputs(); @loc=optimized @len=0 @rva=0
//UDT;

struct TyreExternalInputs {
public:
	bool isActive;
	float load;
	float slipAngle;
	float slipRatio;
	inline TyreExternalInputs() { }
	inline TyreExternalInputs(const TyreExternalInputs& other) = default;
	inline TyreExternalInputs& operator=(const TyreExternalInputs& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(TyreExternalInputs)==16),"bad size");
		static_assert((offsetof(TyreExternalInputs,isActive)==0x0),"bad off");
		static_assert((offsetof(TyreExternalInputs,load)==0x4),"bad off");
		static_assert((offsetof(TyreExternalInputs,slipAngle)==0x8),"bad off");
		static_assert((offsetof(TyreExternalInputs,slipRatio)==0xC),"bad off");
	};
};

//UDT: class KGLVertexBuffer @len=16
	//_Func: public void KGLVertexBuffer(ID3D11Device * device, unsigned int size, unsigned int stride, void * data, bool isDynamic); @loc=static @len=239 @rva=146752
	//_Func: public void ~KGLVertexBuffer(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: struct ID3D11Buffer *, buffer
	//_Data: this+0x8, Member, Type: unsigned int, stride
	//_Func: public void map(void * data, unsigned int size, ID3D11DeviceContext * context); @loc=static @len=129 @rva=146992
	//_Func: public void mapNoOverWrite(void * data, unsigned int offset, unsigned int size, ID3D11DeviceContext * context); @loc=static @len=146 @rva=147136
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class KGLVertexBuffer {
public:
	ID3D11Buffer * buffer;
	unsigned int stride;
	inline KGLVertexBuffer() { }
	inline KGLVertexBuffer(const KGLVertexBuffer& other) = default;
	inline KGLVertexBuffer& operator=(const KGLVertexBuffer& other) = default;
	inline void ctor(ID3D11Device * device, unsigned int size, unsigned int stride, void * data, bool isDynamic) { typedef void (KGLVertexBuffer::*_fpt)(ID3D11Device *, unsigned int, unsigned int, void *, bool); auto _f=xcast<_fpt>(_drva(146752)); (this->*_f)(device, size, stride, data, isDynamic); }
	inline void map(void * data, unsigned int size, ID3D11DeviceContext * context) { typedef void (KGLVertexBuffer::*_fpt)(void *, unsigned int, ID3D11DeviceContext *); auto _f=xcast<_fpt>(_drva(146992)); return (this->*_f)(data, size, context); }
	inline void mapNoOverWrite(void * data, unsigned int offset, unsigned int size, ID3D11DeviceContext * context) { typedef void (KGLVertexBuffer::*_fpt)(void *, unsigned int, unsigned int, ID3D11DeviceContext *); auto _f=xcast<_fpt>(_drva(147136)); return (this->*_f)(data, offset, size, context); }
	inline void _guard_obj() {
		static_assert((sizeof(KGLVertexBuffer)==16),"bad size");
		static_assert((offsetof(KGLVertexBuffer,buffer)==0x0),"bad off");
		static_assert((offsetof(KGLVertexBuffer,stride)==0x8),"bad off");
	};
};

//UDT: struct TyreModelOutput @len=28
	//_Data: this+0x0, Member, Type: float, Fy
	//_Data: this+0x4, Member, Type: float, Fx
	//_Data: this+0x8, Member, Type: float, Mz
	//_Data: this+0xC, Member, Type: float, trail
	//_Data: this+0x10, Member, Type: float, ndSlip
	//_Data: this+0x14, Member, Type: float, Dy
	//_Data: this+0x18, Member, Type: float, Dx
//UDT;

struct TyreModelOutput {
public:
	float Fy;
	float Fx;
	float Mz;
	float trail;
	float ndSlip;
	float Dy;
	float Dx;
	inline TyreModelOutput() { }
	inline TyreModelOutput(const TyreModelOutput& other) = default;
	inline TyreModelOutput& operator=(const TyreModelOutput& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(TyreModelOutput)==28),"bad size");
		static_assert((offsetof(TyreModelOutput,Fy)==0x0),"bad off");
		static_assert((offsetof(TyreModelOutput,Fx)==0x4),"bad off");
		static_assert((offsetof(TyreModelOutput,Mz)==0x8),"bad off");
		static_assert((offsetof(TyreModelOutput,trail)==0xC),"bad off");
		static_assert((offsetof(TyreModelOutput,ndSlip)==0x10),"bad off");
		static_assert((offsetof(TyreModelOutput,Dy)==0x14),"bad off");
		static_assert((offsetof(TyreModelOutput,Dx)==0x18),"bad off");
	};
};

//UDT: struct AISplineHint @len=12
	//_Data: this+0x0, Member, Type: float, startPos
	//_Data: this+0x4, Member, Type: float, endPos
	//_Data: this+0x8, Member, Type: float, value
	//_Func: public void AISplineHint(); @loc=optimized @len=0 @rva=0
//UDT;

struct AISplineHint {
public:
	float startPos;
	float endPos;
	float value;
	inline AISplineHint() { }
	inline AISplineHint(const AISplineHint& other) = default;
	inline AISplineHint& operator=(const AISplineHint& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(AISplineHint)==12),"bad size");
		static_assert((offsetof(AISplineHint,startPos)==0x0),"bad off");
		static_assert((offsetof(AISplineHint,endPos)==0x4),"bad off");
		static_assert((offsetof(AISplineHint,value)==0x8),"bad off");
	};
};

//UDT: struct SCarStateAero @len=12
	//_Func: public void SCarStateAero(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, CD
	//_Data: this+0x4, Member, Type: float, CL_Front
	//_Data: this+0x8, Member, Type: float, CL_Rear
//UDT;

struct SCarStateAero {
public:
	float CD;
	float CL_Front;
	float CL_Rear;
	inline SCarStateAero() { }
	inline SCarStateAero(const SCarStateAero& other) = default;
	inline SCarStateAero& operator=(const SCarStateAero& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(SCarStateAero)==12),"bad size");
		static_assert((offsetof(SCarStateAero,CD)==0x0),"bad off");
		static_assert((offsetof(SCarStateAero,CL_Front)==0x4),"bad off");
		static_assert((offsetof(SCarStateAero,CL_Rear)==0x8),"bad off");
	};
};

//UDT: class SignalGenerator @len=16 @vfcount=3
	//_VTable: 
	//_Func: public void SignalGenerator(const SignalGenerator &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void SignalGenerator(); @loc=static @len=22 @rva=2282048
	//_Func: public void ~SignalGenerator(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=11 @rva=2282080
	//_Data: this+0x8, Member, Type: float, freqScale
	//_Func: public void step(float dt); @intro @virtual vtpo=0 vfid=1 @loc=static @len=21 @rva=2282240
	//_Func: public float getValue(); @intro @pure @virtual vtpo=0 vfid=2 @loc=optimized @len=0 @rva=0
	//_Data: this+0xC, Member, Type: int, value
	//_Func: public SignalGenerator & operator=(const SignalGenerator &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class SignalGenerator {
public:
	float freqScale;
	int value;
	inline SignalGenerator() { }
	inline SignalGenerator(const SignalGenerator& other) = default;
	inline SignalGenerator& operator=(const SignalGenerator& other) = default;
	inline void ctor() { typedef void (SignalGenerator::*_fpt)(); auto _f=xcast<_fpt>(_drva(2282048)); (this->*_f)(); }
	virtual ~SignalGenerator();
	inline void dtor() { typedef void (SignalGenerator::*_fpt)(); auto _f=xcast<_fpt>(_drva(2282080)); (this->*_f)(); }
	virtual void step_vf1(float dt);
	inline void step_impl(float dt) { typedef void (SignalGenerator::*_fpt)(float); auto _f=xcast<_fpt>(_drva(2282240)); return (this->*_f)(dt); }
	inline void step(float dt) { typedef void (SignalGenerator::*_fpt)(float); auto _f=xcast<_fpt>(get_vfp(this, 1)); return (this->*_f)(dt); }
	virtual float getValue_vf2() = 0;
	inline float getValue() { typedef float (SignalGenerator::*_fpt)(); auto _f=xcast<_fpt>(get_vfp(this, 2)); return (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(SignalGenerator)==16),"bad size");
		static_assert((offsetof(SignalGenerator,freqScale)==0x8),"bad off");
		static_assert((offsetof(SignalGenerator,value)==0xC),"bad off");
	};
};

//UDT: struct CoastSettings @len=8
	//_Data: this+0x0, Member, Type: float, coast1
	//_Data: this+0x4, Member, Type: float, coast2
//UDT;

struct CoastSettings {
public:
	float coast1;
	float coast2;
	inline CoastSettings() { }
	inline CoastSettings(const CoastSettings& other) = default;
	inline CoastSettings& operator=(const CoastSettings& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(CoastSettings)==8),"bad size");
		static_assert((offsetof(CoastSettings,coast1)==0x0),"bad off");
		static_assert((offsetof(CoastSettings,coast2)==0x4),"bad off");
	};
};

//UDT: struct TurboDef @len=28
	//_Func: public void TurboDef(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, maxBoost
	//_Data: this+0x4, Member, Type: float, lagUP
	//_Data: this+0x8, Member, Type: float, lagDN
	//_Data: this+0xC, Member, Type: float, rpmRef
	//_Data: this+0x10, Member, Type: float, gamma
	//_Data: this+0x14, Member, Type: float, wastegate
	//_Data: this+0x18, Member, Type: bool, isAdjustable
//UDT;

struct TurboDef {
public:
	float maxBoost;
	float lagUP;
	float lagDN;
	float rpmRef;
	float gamma;
	float wastegate;
	bool isAdjustable;
	inline TurboDef() { }
	inline TurboDef(const TurboDef& other) = default;
	inline TurboDef& operator=(const TurboDef& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(TurboDef)==28),"bad size");
		static_assert((offsetof(TurboDef,maxBoost)==0x0),"bad off");
		static_assert((offsetof(TurboDef,lagUP)==0x4),"bad off");
		static_assert((offsetof(TurboDef,lagDN)==0x8),"bad off");
		static_assert((offsetof(TurboDef,rpmRef)==0xC),"bad off");
		static_assert((offsetof(TurboDef,gamma)==0x10),"bad off");
		static_assert((offsetof(TurboDef,wastegate)==0x14),"bad off");
		static_assert((offsetof(TurboDef,isAdjustable)==0x18),"bad off");
	};
};

//UDT: struct ClientRules @len=4
	//_Data: this+0x0, Member, Type: float, maxMetersWrongWay
	//_Func: public void ClientRules(); @loc=optimized @len=0 @rva=0
//UDT;

struct ClientRules {
public:
	float maxMetersWrongWay;
	inline ClientRules() { }
	inline ClientRules(const ClientRules& other) = default;
	inline ClientRules& operator=(const ClientRules& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ClientRules)==4),"bad size");
		static_assert((offsetof(ClientRules,maxMetersWrongWay)==0x0),"bad off");
	};
};

//UDT: struct OnWindowResize @len=8
	//_Data: this+0x0, Member, Type: int, width
	//_Data: this+0x4, Member, Type: int, height
//UDT;

struct OnWindowResize {
public:
	int width;
	int height;
	inline OnWindowResize() { }
	inline OnWindowResize(const OnWindowResize& other) = default;
	inline OnWindowResize& operator=(const OnWindowResize& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(OnWindowResize)==8),"bad size");
		static_assert((offsetof(OnWindowResize,width)==0x0),"bad off");
		static_assert((offsetof(OnWindowResize,height)==0x4),"bad off");
	};
};

//UDT: struct Axis @len=16
	//_Func: public void Axis(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: int, joy
	//_Data: this+0x4, Member, Type: int, index
	//_Data: this+0x8, Member, Type: float, minv
	//_Data: this+0xC, Member, Type: float, maxv
//UDT;

struct Axis {
public:
	int joy;
	int index;
	float minv;
	float maxv;
	inline Axis() { }
	inline Axis(const Axis& other) = default;
	inline Axis& operator=(const Axis& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(Axis)==16),"bad size");
		static_assert((offsetof(Axis,joy)==0x0),"bad off");
		static_assert((offsetof(Axis,index)==0x4),"bad off");
		static_assert((offsetof(Axis,minv)==0x8),"bad off");
		static_assert((offsetof(Axis,maxv)==0xC),"bad off");
	};
};

//UDT: struct VibrationDef @len=20
	//_Data: this+0x0, Member, Type: float, curbs
	//_Data: this+0x4, Member, Type: float, gforce
	//_Data: this+0x8, Member, Type: float, slips
	//_Data: this+0xC, Member, Type: float, engine
	//_Data: this+0x10, Member, Type: float, abs
	//_Func: public void VibrationDef(); @loc=optimized @len=0 @rva=0
//UDT;

struct VibrationDef {
public:
	float curbs;
	float gforce;
	float slips;
	float engine;
	float abs;
	inline VibrationDef() { }
	inline VibrationDef(const VibrationDef& other) = default;
	inline VibrationDef& operator=(const VibrationDef& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(VibrationDef)==20),"bad size");
		static_assert((offsetof(VibrationDef,curbs)==0x0),"bad off");
		static_assert((offsetof(VibrationDef,gforce)==0x4),"bad off");
		static_assert((offsetof(VibrationDef,slips)==0x8),"bad off");
		static_assert((offsetof(VibrationDef,engine)==0xC),"bad off");
		static_assert((offsetof(VibrationDef,abs)==0x10),"bad off");
	};
};

//UDT: struct DamageReportDef @len=32
	//_Func: public void DamageReportDef(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: double, lastSendTime
	//_Data: this+0x8, Member, Type: float[0x5], damageZoneLevel
//UDT;

struct DamageReportDef {
public:
	double lastSendTime;
	float damageZoneLevel[5];
	inline DamageReportDef() { }
	inline DamageReportDef(const DamageReportDef& other) = default;
	inline DamageReportDef& operator=(const DamageReportDef& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(DamageReportDef)==32),"bad size");
		static_assert((offsetof(DamageReportDef,lastSendTime)==0x0),"bad off");
		static_assert((offsetof(DamageReportDef,damageZoneLevel)==0x8),"bad off");
	};
};

//UDT: struct TyreThermalState @len=192
	//_Data: this+0x0, Member, Type: float[0x3][0xC], temps
	//_Data: this+0x90, Member, Type: float, coreTemp
	//_Data: this+0x94, Member, Type: float, thermalInput
	//_Data: this+0x98, Member, Type: float, dynamicPressure
	//_Data: this+0x9C, Member, Type: float, staticPressure
	//_Data: this+0xA0, Member, Type: float[0x3], lastSetIMO
	//_Data: this+0xAC, Member, Type: float, cpTemperature
	//_Data: this+0xB0, Member, Type: float, lastGrain
	//_Data: this+0xB4, Member, Type: float, lastBlister
	//_Data: this+0xB8, Member, Type: float, mult
	//_Data: this+0xBC, Member, Type: bool, isHot
	//_Func: public void TyreThermalState(); @loc=optimized @len=0 @rva=0
//UDT;

struct TyreThermalState {
public:
	float temps[3][12];
	float coreTemp;
	float thermalInput;
	float dynamicPressure;
	float staticPressure;
	float lastSetIMO[3];
	float cpTemperature;
	float lastGrain;
	float lastBlister;
	float mult;
	bool isHot;
	inline TyreThermalState() { }
	inline TyreThermalState(const TyreThermalState& other) = default;
	inline TyreThermalState& operator=(const TyreThermalState& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(TyreThermalState)==192),"bad size");
		static_assert((offsetof(TyreThermalState,temps)==0x0),"bad off");
		static_assert((offsetof(TyreThermalState,coreTemp)==0x90),"bad off");
		static_assert((offsetof(TyreThermalState,thermalInput)==0x94),"bad off");
		static_assert((offsetof(TyreThermalState,dynamicPressure)==0x98),"bad off");
		static_assert((offsetof(TyreThermalState,staticPressure)==0x9C),"bad off");
		static_assert((offsetof(TyreThermalState,lastSetIMO)==0xA0),"bad off");
		static_assert((offsetof(TyreThermalState,cpTemperature)==0xAC),"bad off");
		static_assert((offsetof(TyreThermalState,lastGrain)==0xB0),"bad off");
		static_assert((offsetof(TyreThermalState,lastBlister)==0xB4),"bad off");
		static_assert((offsetof(TyreThermalState,mult)==0xB8),"bad off");
		static_assert((offsetof(TyreThermalState,isHot)==0xBC),"bad off");
	};
};

//UDT: struct PushToPass @len=40
	//_Data: this+0x0, Member, Type: bool, enabled
	//_Data: this+0x1, Member, Type: bool, active
	//_Data: this+0x4, Member, Type: float, overboost
	//_Data: this+0x8, Member, Type: float, timeS
	//_Data: this+0xC, Member, Type: float, coolDownS
	//_Data: this+0x10, Member, Type: float, timeAccum
	//_Data: this+0x14, Member, Type: int, activations
	//_Data: this+0x18, Member, Type: float, baseWastegate
	//_Data: this+0x1C, Member, Type: int, baseActivations
	//_Data: this+0x20, Member, Type: int, basePositionCoeff
	//_Data: this+0x24, Member, Type: int, maxActivations
	//_Func: public void PushToPass(); @loc=optimized @len=0 @rva=0
//UDT;

struct PushToPass {
public:
	bool enabled;
	bool active;
	float overboost;
	float timeS;
	float coolDownS;
	float timeAccum;
	int activations;
	float baseWastegate;
	int baseActivations;
	int basePositionCoeff;
	int maxActivations;
	inline PushToPass() { }
	inline PushToPass(const PushToPass& other) = default;
	inline PushToPass& operator=(const PushToPass& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(PushToPass)==40),"bad size");
		static_assert((offsetof(PushToPass,enabled)==0x0),"bad off");
		static_assert((offsetof(PushToPass,active)==0x1),"bad off");
		static_assert((offsetof(PushToPass,overboost)==0x4),"bad off");
		static_assert((offsetof(PushToPass,timeS)==0x8),"bad off");
		static_assert((offsetof(PushToPass,coolDownS)==0xC),"bad off");
		static_assert((offsetof(PushToPass,timeAccum)==0x10),"bad off");
		static_assert((offsetof(PushToPass,activations)==0x14),"bad off");
		static_assert((offsetof(PushToPass,baseWastegate)==0x18),"bad off");
		static_assert((offsetof(PushToPass,baseActivations)==0x1C),"bad off");
		static_assert((offsetof(PushToPass,basePositionCoeff)==0x20),"bad off");
		static_assert((offsetof(PushToPass,maxActivations)==0x24),"bad off");
	};
};

//UDT: struct SACEngineInput @len=16
	//_Data: this+0x0, Member, Type: float, gasInput
	//_Data: this+0x4, Member, Type: float, carSpeed
	//_Data: this+0x8, Member, Type: float, altitude
	//_Data: this+0xC, Member, Type: float, rpm
	//_Func: public void SACEngineInput(); @loc=optimized @len=0 @rva=0
//UDT;

struct SACEngineInput {
public:
	float gasInput;
	float carSpeed;
	float altitude;
	float rpm;
	inline SACEngineInput() { }
	inline SACEngineInput(const SACEngineInput& other) = default;
	inline SACEngineInput& operator=(const SACEngineInput& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(SACEngineInput)==16),"bad size");
		static_assert((offsetof(SACEngineInput,gasInput)==0x0),"bad off");
		static_assert((offsetof(SACEngineInput,carSpeed)==0x4),"bad off");
		static_assert((offsetof(SACEngineInput,altitude)==0x8),"bad off");
		static_assert((offsetof(SACEngineInput,rpm)==0xC),"bad off");
	};
};

//UDT: struct DownshiftProtection @len=12
	//_Data: this+0x0, Member, Type: bool, isActive
	//_Data: this+0x1, Member, Type: bool, isDebug
	//_Data: this+0x4, Member, Type: int, overrev
	//_Data: this+0x8, Member, Type: bool, lockN
	//_Func: public void DownshiftProtection(); @loc=optimized @len=0 @rva=0
//UDT;

struct DownshiftProtection {
public:
	bool isActive;
	bool isDebug;
	int overrev;
	bool lockN;
	inline DownshiftProtection() { }
	inline DownshiftProtection(const DownshiftProtection& other) = default;
	inline DownshiftProtection& operator=(const DownshiftProtection& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(DownshiftProtection)==12),"bad size");
		static_assert((offsetof(DownshiftProtection,isActive)==0x0),"bad off");
		static_assert((offsetof(DownshiftProtection,isDebug)==0x1),"bad off");
		static_assert((offsetof(DownshiftProtection,overrev)==0x4),"bad off");
		static_assert((offsetof(DownshiftProtection,lockN)==0x8),"bad off");
	};
};

//UDT: struct EngineStatus @len=24
	//_Data: this+0x0, Member, Type: double, outTorque
	//_Data: this+0x8, Member, Type: double, externalCoastTorque
	//_Data: this+0x10, Member, Type: float, turboBoost
	//_Data: this+0x14, Member, Type: bool, isLimiterOn
	//_Func: public void EngineStatus(); @loc=optimized @len=0 @rva=0
//UDT;

struct EngineStatus {
public:
	double outTorque;
	double externalCoastTorque;
	float turboBoost;
	bool isLimiterOn;
	inline EngineStatus() { }
	inline EngineStatus(const EngineStatus& other) = default;
	inline EngineStatus& operator=(const EngineStatus& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(EngineStatus)==24),"bad size");
		static_assert((offsetof(EngineStatus,outTorque)==0x0),"bad off");
		static_assert((offsetof(EngineStatus,externalCoastTorque)==0x8),"bad off");
		static_assert((offsetof(EngineStatus,turboBoost)==0x10),"bad off");
		static_assert((offsetof(EngineStatus,isLimiterOn)==0x14),"bad off");
	};
};

//UDT: struct HeaveSpringStatus @len=4
	//_Func: public void HeaveSpringStatus(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, travel
//UDT;

struct HeaveSpringStatus {
public:
	float travel;
	inline HeaveSpringStatus() { }
	inline HeaveSpringStatus(const HeaveSpringStatus& other) = default;
	inline HeaveSpringStatus& operator=(const HeaveSpringStatus& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(HeaveSpringStatus)==4),"bad size");
		static_assert((offsetof(HeaveSpringStatus,travel)==0x0),"bad off");
	};
};

//UDT: class CarControls @len=52
	//_Func: public void CarControls(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: bool, gearUp
	//_Data: this+0x1, Member, Type: bool, gearDn
	//_Data: this+0x2, Member, Type: bool, drs
	//_Data: this+0x3, Member, Type: bool, kers
	//_Data: this+0x4, Member, Type: bool, brakeBalanceUp
	//_Data: this+0x5, Member, Type: bool, brakeBalanceDn
	//_Data: this+0x8, Member, Type: int, requestedGearIndex
	//_Data: this+0xC, Member, Type: bool, isShifterSupported
	//_Data: this+0x10, Member, Type: float, handBrake
	//_Data: this+0x14, Member, Type: bool, absUp
	//_Data: this+0x15, Member, Type: bool, absDn
	//_Data: this+0x16, Member, Type: bool, tcUp
	//_Data: this+0x17, Member, Type: bool, tcDn
	//_Data: this+0x18, Member, Type: bool, turboUp
	//_Data: this+0x19, Member, Type: bool, turboDn
	//_Data: this+0x1A, Member, Type: bool, engineBrakeUp
	//_Data: this+0x1B, Member, Type: bool, engineBrakeDn
	//_Data: this+0x1C, Member, Type: bool, MGUKDeliveryUp
	//_Data: this+0x1D, Member, Type: bool, MGUKDeliveryDn
	//_Data: this+0x1E, Member, Type: bool, MGUKRecoveryUp
	//_Data: this+0x1F, Member, Type: bool, MGUKRecoveryDn
	//_Data: this+0x20, Member, Type: bool, MGUHMode
	//_Func: public void setSteer(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public float getSteer(); @loc=optimized @len=0 @rva=0
	//_Func: public void setGas(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public float getGas(); @loc=optimized @len=0 @rva=0
	//_Func: public void setBrake(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public float getBrake(); @loc=optimized @len=0 @rva=0
	//_Func: public void setClutch(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public float getClutch(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x24, Member, Type: float, gas
	//_Data: this+0x28, Member, Type: float, brake
	//_Data: this+0x2C, Member, Type: float, steer
	//_Data: this+0x30, Member, Type: float, clutch
//UDT;

class CarControls {
public:
	bool gearUp;
	bool gearDn;
	bool drs;
	bool kers;
	bool brakeBalanceUp;
	bool brakeBalanceDn;
	int requestedGearIndex;
	bool isShifterSupported;
	float handBrake;
	bool absUp;
	bool absDn;
	bool tcUp;
	bool tcDn;
	bool turboUp;
	bool turboDn;
	bool engineBrakeUp;
	bool engineBrakeDn;
	bool MGUKDeliveryUp;
	bool MGUKDeliveryDn;
	bool MGUKRecoveryUp;
	bool MGUKRecoveryDn;
	bool MGUHMode;
	float gas;
	float brake;
	float steer;
	float clutch;
	inline CarControls() { }
	inline CarControls(const CarControls& other) = default;
	inline CarControls& operator=(const CarControls& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(CarControls)==52),"bad size");
		static_assert((offsetof(CarControls,gearUp)==0x0),"bad off");
		static_assert((offsetof(CarControls,gearDn)==0x1),"bad off");
		static_assert((offsetof(CarControls,drs)==0x2),"bad off");
		static_assert((offsetof(CarControls,kers)==0x3),"bad off");
		static_assert((offsetof(CarControls,brakeBalanceUp)==0x4),"bad off");
		static_assert((offsetof(CarControls,brakeBalanceDn)==0x5),"bad off");
		static_assert((offsetof(CarControls,requestedGearIndex)==0x8),"bad off");
		static_assert((offsetof(CarControls,isShifterSupported)==0xC),"bad off");
		static_assert((offsetof(CarControls,handBrake)==0x10),"bad off");
		static_assert((offsetof(CarControls,absUp)==0x14),"bad off");
		static_assert((offsetof(CarControls,absDn)==0x15),"bad off");
		static_assert((offsetof(CarControls,tcUp)==0x16),"bad off");
		static_assert((offsetof(CarControls,tcDn)==0x17),"bad off");
		static_assert((offsetof(CarControls,turboUp)==0x18),"bad off");
		static_assert((offsetof(CarControls,turboDn)==0x19),"bad off");
		static_assert((offsetof(CarControls,engineBrakeUp)==0x1A),"bad off");
		static_assert((offsetof(CarControls,engineBrakeDn)==0x1B),"bad off");
		static_assert((offsetof(CarControls,MGUKDeliveryUp)==0x1C),"bad off");
		static_assert((offsetof(CarControls,MGUKDeliveryDn)==0x1D),"bad off");
		static_assert((offsetof(CarControls,MGUKRecoveryUp)==0x1E),"bad off");
		static_assert((offsetof(CarControls,MGUKRecoveryDn)==0x1F),"bad off");
		static_assert((offsetof(CarControls,MGUHMode)==0x20),"bad off");
		static_assert((offsetof(CarControls,gas)==0x24),"bad off");
		static_assert((offsetof(CarControls,brake)==0x28),"bad off");
		static_assert((offsetof(CarControls,steer)==0x2C),"bad off");
		static_assert((offsetof(CarControls,clutch)==0x30),"bad off");
	};
};

//UDT: struct BrushOutput @len=8
	//_Func: public void BrushOutput(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, force
	//_Data: this+0x4, Member, Type: float, slip
//UDT;

struct BrushOutput {
public:
	float force;
	float slip;
	inline BrushOutput() { }
	inline BrushOutput(const BrushOutput& other) = default;
	inline BrushOutput& operator=(const BrushOutput& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(BrushOutput)==8),"bad size");
		static_assert((offsetof(BrushOutput,force)==0x0),"bad off");
		static_assert((offsetof(BrushOutput,slip)==0x4),"bad off");
	};
};

//UDT: struct ERSStatus @len=8
	//_Data: this+0x0, Member, Type: float, kineticRecovery
	//_Data: this+0x4, Member, Type: float, heatRecovery
	//_Func: public void ERSStatus(); @loc=optimized @len=0 @rva=0
//UDT;

struct ERSStatus {
public:
	float kineticRecovery;
	float heatRecovery;
	inline ERSStatus() { }
	inline ERSStatus(const ERSStatus& other) = default;
	inline ERSStatus& operator=(const ERSStatus& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ERSStatus)==8),"bad size");
		static_assert((offsetof(ERSStatus,kineticRecovery)==0x0),"bad off");
		static_assert((offsetof(ERSStatus,heatRecovery)==0x4),"bad off");
	};
};

//UDT: class Damper @len=24
	//_Func: public void Damper(); @loc=static @len=45 @rva=2830928
	//_Func: public void ~Damper(); @loc=static @len=3 @rva=96368
	//_Data: this+0x0, Member, Type: float, reboundSlow
	//_Data: this+0x4, Member, Type: float, reboundFast
	//_Data: this+0x8, Member, Type: float, bumpSlow
	//_Data: this+0xC, Member, Type: float, bumpFast
	//_Data: this+0x10, Member, Type: float, fastThresholdBump
	//_Data: this+0x14, Member, Type: float, fastThresholdRebound
	//_Func: public float getForce(float v); @loc=static @len=119 @rva=2830976
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class Damper {
public:
	float reboundSlow;
	float reboundFast;
	float bumpSlow;
	float bumpFast;
	float fastThresholdBump;
	float fastThresholdRebound;
	inline Damper() { }
	inline Damper(const Damper& other) = default;
	inline Damper& operator=(const Damper& other) = default;
	inline void ctor() { typedef void (Damper::*_fpt)(); auto _f=xcast<_fpt>(_drva(2830928)); (this->*_f)(); }
	inline void dtor() { typedef void (Damper::*_fpt)(); auto _f=xcast<_fpt>(_drva(96368)); (this->*_f)(); }
	inline float getForce(float v) { typedef float (Damper::*_fpt)(float); auto _f=xcast<_fpt>(_drva(2830976)); return (this->*_f)(v); }
	inline void _guard_obj() {
		static_assert((sizeof(Damper)==24),"bad size");
		static_assert((offsetof(Damper,reboundSlow)==0x0),"bad off");
		static_assert((offsetof(Damper,reboundFast)==0x4),"bad off");
		static_assert((offsetof(Damper,bumpSlow)==0x8),"bad off");
		static_assert((offsetof(Damper,bumpFast)==0xC),"bad off");
		static_assert((offsetof(Damper,fastThresholdBump)==0x10),"bad off");
		static_assert((offsetof(Damper,fastThresholdRebound)==0x14),"bad off");
	};
};

//UDT: struct WingOverrideDef @len=8
	//_Data: this+0x0, Member, Type: float, overrideAngle
	//_Data: this+0x4, Member, Type: bool, isActive
	//_Func: public void WingOverrideDef(); @loc=optimized @len=0 @rva=0
//UDT;

struct WingOverrideDef {
public:
	float overrideAngle;
	bool isActive;
	inline WingOverrideDef() { }
	inline WingOverrideDef(const WingOverrideDef& other) = default;
	inline WingOverrideDef& operator=(const WingOverrideDef& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(WingOverrideDef)==8),"bad size");
		static_assert((offsetof(WingOverrideDef,overrideAngle)==0x0),"bad off");
		static_assert((offsetof(WingOverrideDef,isActive)==0x4),"bad off");
	};
};

//UDT: struct NetCarStateProvider::LagDebug @len=24
	//_Data: this+0x0, Member, Type: double, rcvTime
	//_Data: this+0x8, Member, Type: double, physicsTime
	//_Data: this+0x10, Member, Type: bool, wasLagging
	//_Func: public void LagDebug(); @loc=optimized @len=0 @rva=0
//UDT;

struct NetCarStateProvider_LagDebug {
public:
	double rcvTime;
	double physicsTime;
	bool wasLagging;
	inline NetCarStateProvider_LagDebug() { }
	inline NetCarStateProvider_LagDebug(const NetCarStateProvider_LagDebug& other) = default;
	inline NetCarStateProvider_LagDebug& operator=(const NetCarStateProvider_LagDebug& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(NetCarStateProvider_LagDebug)==24),"bad size");
		static_assert((offsetof(NetCarStateProvider_LagDebug,rcvTime)==0x0),"bad off");
		static_assert((offsetof(NetCarStateProvider_LagDebug,physicsTime)==0x8),"bad off");
		static_assert((offsetof(NetCarStateProvider_LagDebug,wasLagging)==0x10),"bad off");
	};
};

//UDT: struct SunPosition::Location @len=32
	//_Data: this+0x0, Member, Type: double, longitude
	//_Data: this+0x8, Member, Type: double, latitude
	//_Data: this+0x10, Member, Type: int, gmt
	//_Data: this+0x18, Member, Type: double, nordOffset
//UDT;

struct SunPosition_Location {
public:
	double longitude;
	double latitude;
	int gmt;
	double nordOffset;
	inline SunPosition_Location() { }
	inline SunPosition_Location(const SunPosition_Location& other) = default;
	inline SunPosition_Location& operator=(const SunPosition_Location& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(SunPosition_Location)==32),"bad size");
		static_assert((offsetof(SunPosition_Location,longitude)==0x0),"bad off");
		static_assert((offsetof(SunPosition_Location,latitude)==0x8),"bad off");
		static_assert((offsetof(SunPosition_Location,gmt)==0x10),"bad off");
		static_assert((offsetof(SunPosition_Location,nordOffset)==0x18),"bad off");
	};
};

//UDT: struct WheelValues @len=16
	//_Data: this+0x0, Member, Type: float, lf
	//_Data: this+0x4, Member, Type: float, rf
	//_Data: this+0x8, Member, Type: float, lr
	//_Data: this+0xC, Member, Type: float, rr
	//_Func: public void WheelValues(); @loc=optimized @len=0 @rva=0
//UDT;

struct WheelValues {
public:
	float lf;
	float rf;
	float lr;
	float rr;
	inline WheelValues() { }
	inline WheelValues(const WheelValues& other) = default;
	inline WheelValues& operator=(const WheelValues& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(WheelValues)==16),"bad size");
		static_assert((offsetof(WheelValues,lf)==0x0),"bad off");
		static_assert((offsetof(WheelValues,rf)==0x4),"bad off");
		static_assert((offsetof(WheelValues,lr)==0x8),"bad off");
		static_assert((offsetof(WheelValues,rr)==0xC),"bad off");
	};
};

//UDT: struct BrushTyreModelData @len=28
	//_Func: public void BrushTyreModelData(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, CF
	//_Data: this+0x4, Member, Type: float, xu
	//_Data: this+0x8, Member, Type: float, CF1
	//_Data: this+0xC, Member, Type: float, Fz0
	//_Data: this+0x10, Member, Type: float, maxSlip0
	//_Data: this+0x14, Member, Type: float, maxSlip1
	//_Data: this+0x18, Member, Type: float, falloffSpeed
//UDT;

struct BrushTyreModelData {
public:
	float CF;
	float xu;
	float CF1;
	float Fz0;
	float maxSlip0;
	float maxSlip1;
	float falloffSpeed;
	inline BrushTyreModelData() { }
	inline BrushTyreModelData(const BrushTyreModelData& other) = default;
	inline BrushTyreModelData& operator=(const BrushTyreModelData& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(BrushTyreModelData)==28),"bad size");
		static_assert((offsetof(BrushTyreModelData,CF)==0x0),"bad off");
		static_assert((offsetof(BrushTyreModelData,xu)==0x4),"bad off");
		static_assert((offsetof(BrushTyreModelData,CF1)==0x8),"bad off");
		static_assert((offsetof(BrushTyreModelData,Fz0)==0xC),"bad off");
		static_assert((offsetof(BrushTyreModelData,maxSlip0)==0x10),"bad off");
		static_assert((offsetof(BrushTyreModelData,maxSlip1)==0x14),"bad off");
		static_assert((offsetof(BrushTyreModelData,falloffSpeed)==0x18),"bad off");
	};
};

//UDT: struct TyreSlipOutput @len=8
	//_Data: this+0x0, Member, Type: float, normalizedForce
	//_Data: this+0x4, Member, Type: float, slip
//UDT;

struct TyreSlipOutput {
public:
	float normalizedForce;
	float slip;
	inline TyreSlipOutput() { }
	inline TyreSlipOutput(const TyreSlipOutput& other) = default;
	inline TyreSlipOutput& operator=(const TyreSlipOutput& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(TyreSlipOutput)==8),"bad size");
		static_assert((offsetof(TyreSlipOutput,normalizedForce)==0x0),"bad off");
		static_assert((offsetof(TyreSlipOutput,slip)==0x4),"bad off");
	};
};

//UDT: struct ChaseCamData @len=12
	//_Data: this+0x0, Member, Type: float, distance
	//_Data: this+0x4, Member, Type: float, height
	//_Data: this+0x8, Member, Type: float, pitchRAD
	//_Func: public void ChaseCamData(); @loc=optimized @len=0 @rva=0
//UDT;

struct ChaseCamData {
public:
	float distance;
	float height;
	float pitchRAD;
	inline ChaseCamData() { }
	inline ChaseCamData(const ChaseCamData& other) = default;
	inline ChaseCamData& operator=(const ChaseCamData& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ChaseCamData)==12),"bad size");
		static_assert((offsetof(ChaseCamData,distance)==0x0),"bad off");
		static_assert((offsetof(ChaseCamData,height)==0x4),"bad off");
		static_assert((offsetof(ChaseCamData,pitchRAD)==0x8),"bad off");
	};
};

//UDT: struct DRSWingSetting @len=8
	//_Data: this+0x0, Member, Type: int, index
	//_Data: this+0x4, Member, Type: float, angle
//UDT;

struct DRSWingSetting {
public:
	int index;
	float angle;
	inline DRSWingSetting() { }
	inline DRSWingSetting(const DRSWingSetting& other) = default;
	inline DRSWingSetting& operator=(const DRSWingSetting& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(DRSWingSetting)==8),"bad size");
		static_assert((offsetof(DRSWingSetting,index)==0x0),"bad off");
		static_assert((offsetof(DRSWingSetting,angle)==0x4),"bad off");
	};
};

//UDT: struct OnKeyEvent @len=4
	//_Func: public void OnKeyEvent(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: unsigned int, keyCode
//UDT;

struct OnKeyEvent {
public:
	unsigned int keyCode;
	inline OnKeyEvent() { }
	inline OnKeyEvent(const OnKeyEvent& other) = default;
	inline OnKeyEvent& operator=(const OnKeyEvent& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(OnKeyEvent)==4),"bad size");
		static_assert((offsetof(OnKeyEvent,keyCode)==0x0),"bad off");
	};
};

//UDT: struct MouseEvent @len=12
	//_Func: public void MouseEvent(int  _arg0, int  _arg1); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: int, x
	//_Data: this+0x4, Member, Type: int, y
	//_Data: this+0x8, Member, Type: enum MouseButton, button
//UDT;

struct MouseEvent {
public:
	int x;
	int y;
	MouseButton button;
	inline MouseEvent() { }
	inline MouseEvent(const MouseEvent& other) = default;
	inline MouseEvent& operator=(const MouseEvent& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(MouseEvent)==12),"bad size");
		static_assert((offsetof(MouseEvent,x)==0x0),"bad off");
		static_assert((offsetof(MouseEvent,y)==0x4),"bad off");
		static_assert((offsetof(MouseEvent,button)==0x8),"bad off");
	};
};

//UDT: class vec4f @len=16
	//_Data: this+0x0, Member, Type: float, x
	//_Data: this+0x4, Member, Type: float, y
	//_Data: this+0x8, Member, Type: float, z
	//_Data: this+0xC, Member, Type: float, w
	//_Func: public void vec4f(const vec3f & v3, float vw); @loc=static @len=25 @rva=962960
	//_Func: public void vec4f(float *  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void vec4f(float ix, float iy, float iz, float iw); @loc=static @len=29 @rva=3178496
	//_Func: public void vec4f(); @loc=static @len=13 @rva=508768
	//_Func: public vec3f toVec3fLinear(); @loc=optimized @len=0 @rva=0
	//_Func: public float length(); @loc=optimized @len=0 @rva=0
//UDT;

class vec4f {
public:
	float x;
	float y;
	float z;
	float w;
	inline vec4f() { }
	inline vec4f(const vec4f& other) = default;
	inline vec4f& operator=(const vec4f& other) = default;
	inline void ctor(const vec3f & v3, float vw) { typedef void (vec4f::*_fpt)(const vec3f &, float); auto _f=xcast<_fpt>(_drva(962960)); (this->*_f)(v3, vw); }
	inline void ctor(float ix, float iy, float iz, float iw) { typedef void (vec4f::*_fpt)(float, float, float, float); auto _f=xcast<_fpt>(_drva(3178496)); (this->*_f)(ix, iy, iz, iw); }
	inline void ctor() { typedef void (vec4f::*_fpt)(); auto _f=xcast<_fpt>(_drva(508768)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(vec4f)==16),"bad size");
		static_assert((offsetof(vec4f,x)==0x0),"bad off");
		static_assert((offsetof(vec4f,y)==0x4),"bad off");
		static_assert((offsetof(vec4f,z)==0x8),"bad off");
		static_assert((offsetof(vec4f,w)==0xC),"bad off");
	};
};

//UDT: struct LeaderboardEntry @len=32
	//_Func: public void LeaderboardEntry(CarAvatar *  _arg0, double  _arg1, double  _arg2, int  _arg3, bool  _arg4, bool  _arg5, bool  _arg6); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class CarAvatar *, car
	//_Data: this+0x8, Member, Type: double, totalTime
	//_Data: this+0x10, Member, Type: double, bestLap
	//_Data: this+0x18, Member, Type: int, laps
	//_Data: this+0x1C, Member, Type: bool, isRaceMode
	//_Data: this+0x1D, Member, Type: bool, isBlackFlagged
	//_Data: this+0x1E, Member, Type: bool, hasCompletedLastLap
	//_Func: public bool operator<(const LeaderboardEntry & l); @loc=static @len=338 @rva=1327408
//UDT;

struct LeaderboardEntry {
public:
	CarAvatar * car;
	double totalTime;
	double bestLap;
	int laps;
	bool isRaceMode;
	bool isBlackFlagged;
	bool hasCompletedLastLap;
	inline LeaderboardEntry() { }
	inline LeaderboardEntry(const LeaderboardEntry& other) = default;
	inline LeaderboardEntry& operator=(const LeaderboardEntry& other) = default;
	inline bool operator<(const LeaderboardEntry & l) { typedef bool (LeaderboardEntry::*_fpt)(const LeaderboardEntry &); auto _f=xcast<_fpt>(_drva(1327408)); return (this->*_f)(l); }
	inline void _guard_obj() {
		static_assert((sizeof(LeaderboardEntry)==32),"bad size");
		static_assert((offsetof(LeaderboardEntry,car)==0x0),"bad off");
		static_assert((offsetof(LeaderboardEntry,totalTime)==0x8),"bad off");
		static_assert((offsetof(LeaderboardEntry,bestLap)==0x10),"bad off");
		static_assert((offsetof(LeaderboardEntry,laps)==0x18),"bad off");
		static_assert((offsetof(LeaderboardEntry,isRaceMode)==0x1C),"bad off");
		static_assert((offsetof(LeaderboardEntry,isBlackFlagged)==0x1D),"bad off");
		static_assert((offsetof(LeaderboardEntry,hasCompletedLastLap)==0x1E),"bad off");
	};
};

//UDT: struct RaceStatusCarDesc @len=24
	//_Func: public void RaceStatusCarDesc(CarAvatar *  _arg0); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class CarAvatar *, car
	//_Data: this+0x8, Member, Type: float, resetTimer
	//_Data: this+0xC, Member, Type: bool, retired
	//_Data: this+0x10, Member, Type: float, invalidStateTimer
	//_Data: this+0x14, Member, Type: float, maxInvalidStateTimer
//UDT;

struct RaceStatusCarDesc {
public:
	CarAvatar * car;
	float resetTimer;
	bool retired;
	float invalidStateTimer;
	float maxInvalidStateTimer;
	inline RaceStatusCarDesc() { }
	inline RaceStatusCarDesc(const RaceStatusCarDesc& other) = default;
	inline RaceStatusCarDesc& operator=(const RaceStatusCarDesc& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(RaceStatusCarDesc)==24),"bad size");
		static_assert((offsetof(RaceStatusCarDesc,car)==0x0),"bad off");
		static_assert((offsetof(RaceStatusCarDesc,resetTimer)==0x8),"bad off");
		static_assert((offsetof(RaceStatusCarDesc,retired)==0xC),"bad off");
		static_assert((offsetof(RaceStatusCarDesc,invalidStateTimer)==0x10),"bad off");
		static_assert((offsetof(RaceStatusCarDesc,maxInvalidStateTimer)==0x14),"bad off");
	};
};

//UDT: struct OnChatMessageEvent @len=40
	//_Data: this+0x0, Member, Type: int, sessionID
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, message
	//_Func: public void OnChatMessageEvent(const OnChatMessageEvent &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void OnChatMessageEvent(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~OnChatMessageEvent(); @loc=static @len=49 @rva=2180672
	//_Func: public OnChatMessageEvent & operator=(const OnChatMessageEvent &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct OnChatMessageEvent {
public:
	int sessionID;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > message;
	inline OnChatMessageEvent() { }
	inline OnChatMessageEvent(const OnChatMessageEvent& other) = default;
	inline OnChatMessageEvent& operator=(const OnChatMessageEvent& other) = default;
	inline void dtor() { typedef void (OnChatMessageEvent::*_fpt)(); auto _f=xcast<_fpt>(_drva(2180672)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(OnChatMessageEvent)==40),"bad size");
		static_assert((offsetof(OnChatMessageEvent,sessionID)==0x0),"bad off");
		static_assert((offsetof(OnChatMessageEvent,message)==0x8),"bad off");
	};
};

//UDT: struct RealTimeCarDesc @len=16
	//_Func: public void RealTimeCarDesc(CarAvatar *  _arg0); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class CarAvatar *, car
	//_Data: this+0x8, Member, Type: bool, crossedForTheFirstTime
	//_Data: this+0xC, Member, Type: float, approxPos
//UDT;

struct RealTimeCarDesc {
public:
	CarAvatar * car;
	bool crossedForTheFirstTime;
	float approxPos;
	inline RealTimeCarDesc() { }
	inline RealTimeCarDesc(const RealTimeCarDesc& other) = default;
	inline RealTimeCarDesc& operator=(const RealTimeCarDesc& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(RealTimeCarDesc)==16),"bad size");
		static_assert((offsetof(RealTimeCarDesc,car)==0x0),"bad off");
		static_assert((offsetof(RealTimeCarDesc,crossedForTheFirstTime)==0x8),"bad off");
		static_assert((offsetof(RealTimeCarDesc,approxPos)==0xC),"bad off");
	};
};

//UDT: struct MultiplayerStatus @len=32
	//_Data: this+0x0, Member, Type: class std::vector<bool,std::allocator<bool> >, completedFlags
	//_Func: public void MultiplayerStatus(const MultiplayerStatus &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void MultiplayerStatus(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~MultiplayerStatus(); @loc=static @len=60 @rva=1258160
	//_Func: public MultiplayerStatus & operator=(const MultiplayerStatus &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct MultiplayerStatus {
public:
	std::vector<bool,std::allocator<bool> > completedFlags;
	inline MultiplayerStatus() { }
	inline MultiplayerStatus(const MultiplayerStatus& other) = default;
	inline MultiplayerStatus& operator=(const MultiplayerStatus& other) = default;
	inline void dtor() { typedef void (MultiplayerStatus::*_fpt)(); auto _f=xcast<_fpt>(_drva(1258160)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(MultiplayerStatus)==32),"bad size");
		static_assert((offsetof(MultiplayerStatus,completedFlags)==0x0),"bad off");
	};
};

//UDT: struct CarCollisionBox @len=32
	//_Func: public void CarCollisionBox(const vec3f &  _arg0, const vec3f &  _arg1); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class vec3f, centre
	//_Data: this+0xC, Member, Type: class vec3f, size
	//_Data: this+0x18, Member, Type: unsigned __int64, id
//UDT;

struct CarCollisionBox {
public:
	vec3f centre;
	vec3f size;
	unsigned __int64 id;
	inline CarCollisionBox() { }
	inline CarCollisionBox(const CarCollisionBox& other) = default;
	inline CarCollisionBox& operator=(const CarCollisionBox& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(CarCollisionBox)==32),"bad size");
		static_assert((offsetof(CarCollisionBox,centre)==0x0),"bad off");
		static_assert((offsetof(CarCollisionBox,size)==0xC),"bad off");
		static_assert((offsetof(CarCollisionBox,id)==0x18),"bad off");
	};
};

//UDT: struct UDPMessage @len=32
	//_Data: this+0x0, Member, Type: void *, data
	//_Data: this+0x8, Member, Type: int, size
	//_Data: this+0xC, Member, Type: struct sockaddr_in, srcAddress
	//_Func: public void UDPMessage(); @loc=optimized @len=0 @rva=0
//UDT;

struct UDPMessage {
public:
	void * data;
	int size;
	sockaddr_in srcAddress;
	inline UDPMessage() { }
	inline UDPMessage(const UDPMessage& other) = default;
	inline UDPMessage& operator=(const UDPMessage& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(UDPMessage)==32),"bad size");
		static_assert((offsetof(UDPMessage,data)==0x0),"bad off");
		static_assert((offsetof(UDPMessage,size)==0x8),"bad off");
		static_assert((offsetof(UDPMessage,srcAddress)==0xC),"bad off");
	};
};

//UDT: struct FadeModeDef @len=24
	//_Func: public void FadeModeDef(FadeMode aMode, void * aSender, float aTime); @loc=static @len=22 @rva=242368
	//_Func: public void FadeModeDef(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: enum FadeMode, mode
	//_Data: this+0x4, Member, Type: float, fadeTime
	//_Data: this+0x8, Member, Type: float, fadeTotalTime
	//_Data: this+0x10, Member, Type: void *, sender
//UDT;

struct FadeModeDef {
public:
	FadeMode mode;
	float fadeTime;
	float fadeTotalTime;
	void * sender;
	inline FadeModeDef() { }
	inline FadeModeDef(const FadeModeDef& other) = default;
	inline FadeModeDef& operator=(const FadeModeDef& other) = default;
	inline void ctor(FadeMode aMode, void * aSender, float aTime) { typedef void (FadeModeDef::*_fpt)(FadeMode, void *, float); auto _f=xcast<_fpt>(_drva(242368)); (this->*_f)(aMode, aSender, aTime); }
	inline void _guard_obj() {
		static_assert((sizeof(FadeModeDef)==24),"bad size");
		static_assert((offsetof(FadeModeDef,mode)==0x0),"bad off");
		static_assert((offsetof(FadeModeDef,fadeTime)==0x4),"bad off");
		static_assert((offsetof(FadeModeDef,fadeTotalTime)==0x8),"bad off");
		static_assert((offsetof(FadeModeDef,sender)==0x10),"bad off");
	};
};

//UDT: struct ClientRemoteCarDef @len=216
	//_Data: this+0x0, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, model
	//_Data: this+0x20, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, config
	//_Data: this+0x40, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, skin
	//_Data: this+0x60, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, driverName
	//_Data: this+0x80, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, team
	//_Data: this+0xA0, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, nationCode
	//_Data: this+0xC0, Member, Type: unsigned char, sessionID
	//_Data: this+0xC4, Member, Type: float[0x5], damageZoneLevel
	//_Func: public void ClientRemoteCarDef(const ClientRemoteCarDef & __that); @loc=static @len=314 @rva=241776
	//_Func: public void ClientRemoteCarDef(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~ClientRemoteCarDef(); @loc=static @len=246 @rva=246128
	//_Func: public ClientRemoteCarDef & operator=(const ClientRemoteCarDef &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct ClientRemoteCarDef {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > model;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > config;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > skin;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > driverName;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > team;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > nationCode;
	unsigned char sessionID;
	float damageZoneLevel[5];
	inline ClientRemoteCarDef() { }
	inline ClientRemoteCarDef(const ClientRemoteCarDef& other) = default;
	inline ClientRemoteCarDef& operator=(const ClientRemoteCarDef& other) = default;
	inline void ctor(const ClientRemoteCarDef & __that) { typedef void (ClientRemoteCarDef::*_fpt)(const ClientRemoteCarDef &); auto _f=xcast<_fpt>(_drva(241776)); (this->*_f)(__that); }
	inline void dtor() { typedef void (ClientRemoteCarDef::*_fpt)(); auto _f=xcast<_fpt>(_drva(246128)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(ClientRemoteCarDef)==216),"bad size");
		static_assert((offsetof(ClientRemoteCarDef,model)==0x0),"bad off");
		static_assert((offsetof(ClientRemoteCarDef,config)==0x20),"bad off");
		static_assert((offsetof(ClientRemoteCarDef,skin)==0x40),"bad off");
		static_assert((offsetof(ClientRemoteCarDef,driverName)==0x60),"bad off");
		static_assert((offsetof(ClientRemoteCarDef,team)==0x80),"bad off");
		static_assert((offsetof(ClientRemoteCarDef,nationCode)==0xA0),"bad off");
		static_assert((offsetof(ClientRemoteCarDef,sessionID)==0xC0),"bad off");
		static_assert((offsetof(ClientRemoteCarDef,damageZoneLevel)==0xC4),"bad off");
	};
};

//UDT: struct CollisionEvent @len=44
	//_Data: this+0x0, Member, Type: int, carIndex
	//_Data: this+0x4, Member, Type: float, normalForce
	//_Data: this+0x8, Member, Type: class vec3f, pos
	//_Data: this+0x14, Member, Type: class vec3f, normal
	//_Data: this+0x20, Member, Type: float, impactAngle
	//_Data: this+0x24, Member, Type: float, relativeSpeed
	//_Data: this+0x28, Member, Type: unsigned long, colliderCategory
	//_Func: public void CollisionEvent(); @loc=optimized @len=0 @rva=0
//UDT;

struct CollisionEvent {
public:
	int carIndex;
	float normalForce;
	vec3f pos;
	vec3f normal;
	float impactAngle;
	float relativeSpeed;
	unsigned long colliderCategory;
	inline CollisionEvent() { }
	inline CollisionEvent(const CollisionEvent& other) = default;
	inline CollisionEvent& operator=(const CollisionEvent& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(CollisionEvent)==44),"bad size");
		static_assert((offsetof(CollisionEvent,carIndex)==0x0),"bad off");
		static_assert((offsetof(CollisionEvent,normalForce)==0x4),"bad off");
		static_assert((offsetof(CollisionEvent,pos)==0x8),"bad off");
		static_assert((offsetof(CollisionEvent,normal)==0x14),"bad off");
		static_assert((offsetof(CollisionEvent,impactAngle)==0x20),"bad off");
		static_assert((offsetof(CollisionEvent,relativeSpeed)==0x24),"bad off");
		static_assert((offsetof(CollisionEvent,colliderCategory)==0x28),"bad off");
	};
};

//UDT: struct ClientHandshakeResult @len=144
	//_Data: this+0x0, Member, Type: bool, success
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, model
	//_Data: this+0x28, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, skin
	//_Data: this+0x48, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, track
	//_Data: this+0x68, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, track_config
	//_Data: this+0x88, Member, Type: float, sunAngle
	//_Data: this+0x8C, Member, Type: unsigned char, sessionID
	//_Func: public void ClientHandshakeResult(const ClientHandshakeResult & __that); @loc=static @len=229 @rva=241536
	//_Func: public void ClientHandshakeResult(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~ClientHandshakeResult(); @loc=static @len=160 @rva=245968
	//_Func: public ClientHandshakeResult & operator=(const ClientHandshakeResult &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct ClientHandshakeResult {
public:
	bool success;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > model;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > skin;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > track;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > track_config;
	float sunAngle;
	unsigned char sessionID;
	inline ClientHandshakeResult() { }
	inline ClientHandshakeResult(const ClientHandshakeResult& other) = default;
	inline ClientHandshakeResult& operator=(const ClientHandshakeResult& other) = default;
	inline void ctor(const ClientHandshakeResult & __that) { typedef void (ClientHandshakeResult::*_fpt)(const ClientHandshakeResult &); auto _f=xcast<_fpt>(_drva(241536)); (this->*_f)(__that); }
	inline void dtor() { typedef void (ClientHandshakeResult::*_fpt)(); auto _f=xcast<_fpt>(_drva(245968)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(ClientHandshakeResult)==144),"bad size");
		static_assert((offsetof(ClientHandshakeResult,success)==0x0),"bad off");
		static_assert((offsetof(ClientHandshakeResult,model)==0x8),"bad off");
		static_assert((offsetof(ClientHandshakeResult,skin)==0x28),"bad off");
		static_assert((offsetof(ClientHandshakeResult,track)==0x48),"bad off");
		static_assert((offsetof(ClientHandshakeResult,track_config)==0x68),"bad off");
		static_assert((offsetof(ClientHandshakeResult,sunAngle)==0x88),"bad off");
		static_assert((offsetof(ClientHandshakeResult,sessionID)==0x8C),"bad off");
	};
};

//UDT: class plane4f @len=16
	//_Data: this+0x0, Member, Type: class vec3f, normal
	//_Data: this+0xC, Member, Type: float, d
	//_Func: public void plane4f(const vec3f & point1, const vec3f & point2, const vec3f & point3); @loc=static @len=308 @rva=1146576
	//_Func: public void plane4f(const vec3f &  _arg0, const vec3f &  _arg1); @loc=optimized @len=0 @rva=0
	//_Func: public void plane4f(); @loc=optimized @len=0 @rva=0
	//_Func: public vec3f getRayIntersection(const vec3f &  _arg0, const vec3f &  _arg1); @loc=optimized @len=0 @rva=0
//UDT;

class plane4f {
public:
	vec3f normal;
	float d;
	inline plane4f() { }
	inline plane4f(const plane4f& other) = default;
	inline plane4f& operator=(const plane4f& other) = default;
	inline void ctor(const vec3f & point1, const vec3f & point2, const vec3f & point3) { typedef void (plane4f::*_fpt)(const vec3f &, const vec3f &, const vec3f &); auto _f=xcast<_fpt>(_drva(1146576)); (this->*_f)(point1, point2, point3); }
	inline void _guard_obj() {
		static_assert((sizeof(plane4f)==16),"bad size");
		static_assert((offsetof(plane4f,normal)==0x0),"bad off");
		static_assert((offsetof(plane4f,d)==0xC),"bad off");
	};
};

//UDT: struct OnESCMenuTriggered @len=16
	//_Func: public void OnESCMenuTriggered(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class ESCMenu *, menu
	//_Data: this+0x8, Member, Type: bool, visible
	//_Data: this+0x9, Member, Type: bool, startReplay
//UDT;

struct OnESCMenuTriggered {
public:
	ESCMenu * menu;
	bool visible;
	bool startReplay;
	inline OnESCMenuTriggered() { }
	inline OnESCMenuTriggered(const OnESCMenuTriggered& other) = default;
	inline OnESCMenuTriggered& operator=(const OnESCMenuTriggered& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(OnESCMenuTriggered)==16),"bad size");
		static_assert((offsetof(OnESCMenuTriggered,menu)==0x0),"bad off");
		static_assert((offsetof(OnESCMenuTriggered,visible)==0x8),"bad off");
		static_assert((offsetof(OnESCMenuTriggered,startReplay)==0x9),"bad off");
	};
};

//UDT: struct StabilityControl @len=24
	//_Func: public void ~StabilityControl(); @loc=static @len=3 @rva=96368
	//_Data: this+0x0, Member, Type: float, gain
	//_Data: this+0x4, Member, Type: bool, useBeta
	//_Func: public void init(Car * car); @loc=static @len=22 @rva=2882096
	//_Func: public void step(float dt); @loc=static @len=511 @rva=2882128
	//_Data: this+0x8, Member, Type: class Car *, car
	//_Data: this+0x10, Member, Type: float, maxGain
	//_Func: public void StabilityControl(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct StabilityControl {
public:
	float gain;
	bool useBeta;
	Car * car;
	float maxGain;
	inline StabilityControl() { }
	inline StabilityControl(const StabilityControl& other) = default;
	inline StabilityControl& operator=(const StabilityControl& other) = default;
	inline void dtor() { typedef void (StabilityControl::*_fpt)(); auto _f=xcast<_fpt>(_drva(96368)); (this->*_f)(); }
	inline void init(Car * car) { typedef void (StabilityControl::*_fpt)(Car *); auto _f=xcast<_fpt>(_drva(2882096)); return (this->*_f)(car); }
	inline void step(float dt) { typedef void (StabilityControl::*_fpt)(float); auto _f=xcast<_fpt>(_drva(2882128)); return (this->*_f)(dt); }
	inline void _guard_obj() {
		static_assert((sizeof(StabilityControl)==24),"bad size");
		static_assert((offsetof(StabilityControl,gain)==0x0),"bad off");
		static_assert((offsetof(StabilityControl,useBeta)==0x4),"bad off");
		static_assert((offsetof(StabilityControl,car)==0x8),"bad off");
		static_assert((offsetof(StabilityControl,maxGain)==0x10),"bad off");
	};
};

//UDT: struct OnNewCarLoadedEvent @len=8
	//_Data: this+0x0, Member, Type: class CarAvatar *, car
//UDT;

struct OnNewCarLoadedEvent {
public:
	CarAvatar * car;
	inline OnNewCarLoadedEvent() { }
	inline OnNewCarLoadedEvent(const OnNewCarLoadedEvent& other) = default;
	inline OnNewCarLoadedEvent& operator=(const OnNewCarLoadedEvent& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(OnNewCarLoadedEvent)==8),"bad size");
		static_assert((offsetof(OnNewCarLoadedEvent,car)==0x0),"bad off");
	};
};

//UDT: class IVarCallback @len=8 @vfcount=1
	//_VTable: 
	//_Func: public void onSetVar(SVar *  _arg0, float  _arg1); @intro @pure @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
	//_Func: public void IVarCallback(const IVarCallback &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void IVarCallback(); @loc=optimized @len=0 @rva=0
	//_Func: public IVarCallback & operator=(const IVarCallback &  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class IVarCallback {
public:
	inline IVarCallback() { }
	inline IVarCallback(const IVarCallback& other) = default;
	inline IVarCallback& operator=(const IVarCallback& other) = default;
	virtual void onSetVar_vf0(SVar *  _arg0, float  _arg1) = 0;
	inline void onSetVar(SVar *  _arg0, float  _arg1) { typedef void (IVarCallback::*_fpt)(SVar *, float); auto _f=xcast<_fpt>(get_vfp(this, 0)); return (this->*_f)( _arg0,  _arg1); }
	inline void _guard_obj() {
		static_assert((sizeof(IVarCallback)==8),"bad size");
	};
};

//UDT: struct SStrutSuspensionData @len=112
	//_Data: this+0x0, Member, Type: class vec3f, carStrut
	//_Data: this+0xC, Member, Type: class vec3f, tyreStrut
	//_Data: this+0x18, Member, Type: class vec3f, carBottomWB_F
	//_Data: this+0x24, Member, Type: class vec3f, carBottomWB_R
	//_Data: this+0x30, Member, Type: class vec3f, tyreBottomWB
	//_Data: this+0x3C, Member, Type: class vec3f, carSteer
	//_Data: this+0x48, Member, Type: class vec3f, tyreSteer
	//_Data: this+0x54, Member, Type: class vec3f, refPoint
	//_Data: this+0x60, Member, Type: float, hubMass
	//_Data: this+0x64, Member, Type: class vec3f, hubInertiaBox
	//_Func: public void SStrutSuspensionData(); @loc=optimized @len=0 @rva=0
//UDT;

struct SStrutSuspensionData {
public:
	vec3f carStrut;
	vec3f tyreStrut;
	vec3f carBottomWB_F;
	vec3f carBottomWB_R;
	vec3f tyreBottomWB;
	vec3f carSteer;
	vec3f tyreSteer;
	vec3f refPoint;
	float hubMass;
	vec3f hubInertiaBox;
	inline SStrutSuspensionData() { }
	inline SStrutSuspensionData(const SStrutSuspensionData& other) = default;
	inline SStrutSuspensionData& operator=(const SStrutSuspensionData& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(SStrutSuspensionData)==112),"bad size");
		static_assert((offsetof(SStrutSuspensionData,carStrut)==0x0),"bad off");
		static_assert((offsetof(SStrutSuspensionData,tyreStrut)==0xC),"bad off");
		static_assert((offsetof(SStrutSuspensionData,carBottomWB_F)==0x18),"bad off");
		static_assert((offsetof(SStrutSuspensionData,carBottomWB_R)==0x24),"bad off");
		static_assert((offsetof(SStrutSuspensionData,tyreBottomWB)==0x30),"bad off");
		static_assert((offsetof(SStrutSuspensionData,carSteer)==0x3C),"bad off");
		static_assert((offsetof(SStrutSuspensionData,tyreSteer)==0x48),"bad off");
		static_assert((offsetof(SStrutSuspensionData,refPoint)==0x54),"bad off");
		static_assert((offsetof(SStrutSuspensionData,hubMass)==0x60),"bad off");
		static_assert((offsetof(SStrutSuspensionData,hubInertiaBox)==0x64),"bad off");
	};
};

//UDT: struct ModelBoundariesCoordinates @len=24
	//_Data: this+0x0, Member, Type: float, front
	//_Data: this+0x4, Member, Type: float, rear
	//_Data: this+0x8, Member, Type: float, left
	//_Data: this+0xC, Member, Type: float, right
	//_Data: this+0x10, Member, Type: float, top
	//_Data: this+0x14, Member, Type: float, bottom
	//_Func: public void update(vec3f  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ModelBoundariesCoordinates(); @loc=optimized @len=0 @rva=0
//UDT;

struct ModelBoundariesCoordinates {
public:
	float front;
	float rear;
	float left;
	float right;
	float top;
	float bottom;
	inline ModelBoundariesCoordinates() { }
	inline ModelBoundariesCoordinates(const ModelBoundariesCoordinates& other) = default;
	inline ModelBoundariesCoordinates& operator=(const ModelBoundariesCoordinates& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ModelBoundariesCoordinates)==24),"bad size");
		static_assert((offsetof(ModelBoundariesCoordinates,front)==0x0),"bad off");
		static_assert((offsetof(ModelBoundariesCoordinates,rear)==0x4),"bad off");
		static_assert((offsetof(ModelBoundariesCoordinates,left)==0x8),"bad off");
		static_assert((offsetof(ModelBoundariesCoordinates,right)==0xC),"bad off");
		static_assert((offsetof(ModelBoundariesCoordinates,top)==0x10),"bad off");
		static_assert((offsetof(ModelBoundariesCoordinates,bottom)==0x14),"bad off");
	};
};

//UDT: struct TrackData @len=72
	//_Data: this+0x0, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Data: this+0x20, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, configuration
	//_Data: this+0x40, Member, Type: int, gridPlaces
	//_Func: public void TrackData(const TrackData &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void TrackData(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~TrackData(); @loc=static @len=88 @rva=776352
	//_Func: public TrackData & operator=(const TrackData &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct TrackData {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > configuration;
	int gridPlaces;
	inline TrackData() { }
	inline TrackData(const TrackData& other) = default;
	inline TrackData& operator=(const TrackData& other) = default;
	inline void dtor() { typedef void (TrackData::*_fpt)(); auto _f=xcast<_fpt>(_drva(776352)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(TrackData)==72),"bad size");
		static_assert((offsetof(TrackData,name)==0x0),"bad off");
		static_assert((offsetof(TrackData,configuration)==0x20),"bad off");
		static_assert((offsetof(TrackData,gridPlaces)==0x40),"bad off");
	};
};

//UDT: struct WingState @len=68
	//_Data: this+0x0, Member, Type: float, aoa
	//_Data: this+0x4, Member, Type: float, cd
	//_Data: this+0x8, Member, Type: float, cl
	//_Data: this+0xC, Member, Type: float, angle
	//_Data: this+0x10, Member, Type: float, inputAngle
	//_Data: this+0x14, Member, Type: float, groundHeight
	//_Data: this+0x18, Member, Type: float, frontShare
	//_Data: this+0x1C, Member, Type: float, dragKG
	//_Data: this+0x20, Member, Type: float, liftKG
	//_Data: this+0x24, Member, Type: float, angleMult
	//_Data: this+0x28, Member, Type: float, groundEffectLift
	//_Data: this+0x2C, Member, Type: float, groundEffectDrag
	//_Data: this+0x30, Member, Type: float, yawAngle
	//_Data: this+0x34, Member, Type: bool, isVertical
	//_Data: this+0x38, Member, Type: class vec3f, liftVector
	//_Func: public void WingState(); @loc=optimized @len=0 @rva=0
//UDT;

struct WingState {
public:
	float aoa;
	float cd;
	float cl;
	float angle;
	float inputAngle;
	float groundHeight;
	float frontShare;
	float dragKG;
	float liftKG;
	float angleMult;
	float groundEffectLift;
	float groundEffectDrag;
	float yawAngle;
	bool isVertical;
	vec3f liftVector;
	inline WingState() { }
	inline WingState(const WingState& other) = default;
	inline WingState& operator=(const WingState& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(WingState)==68),"bad size");
		static_assert((offsetof(WingState,aoa)==0x0),"bad off");
		static_assert((offsetof(WingState,cd)==0x4),"bad off");
		static_assert((offsetof(WingState,cl)==0x8),"bad off");
		static_assert((offsetof(WingState,angle)==0xC),"bad off");
		static_assert((offsetof(WingState,inputAngle)==0x10),"bad off");
		static_assert((offsetof(WingState,groundHeight)==0x14),"bad off");
		static_assert((offsetof(WingState,frontShare)==0x18),"bad off");
		static_assert((offsetof(WingState,dragKG)==0x1C),"bad off");
		static_assert((offsetof(WingState,liftKG)==0x20),"bad off");
		static_assert((offsetof(WingState,angleMult)==0x24),"bad off");
		static_assert((offsetof(WingState,groundEffectLift)==0x28),"bad off");
		static_assert((offsetof(WingState,groundEffectDrag)==0x2C),"bad off");
		static_assert((offsetof(WingState,yawAngle)==0x30),"bad off");
		static_assert((offsetof(WingState,isVertical)==0x34),"bad off");
		static_assert((offsetof(WingState,liftVector)==0x38),"bad off");
	};
};

//UDT: struct DisconnectCountdown @len=40
	//_Data: this+0x0, Member, Type: bool, isSignaled
	//_Data: this+0x4, Member, Type: float, timeToDisconnection
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, message
	//_Func: public void DisconnectCountdown(const DisconnectCountdown &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void DisconnectCountdown(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~DisconnectCountdown(); @loc=static @len=49 @rva=2180672
	//_Func: public DisconnectCountdown & operator=(const DisconnectCountdown &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct DisconnectCountdown {
public:
	bool isSignaled;
	float timeToDisconnection;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > message;
	inline DisconnectCountdown() { }
	inline DisconnectCountdown(const DisconnectCountdown& other) = default;
	inline DisconnectCountdown& operator=(const DisconnectCountdown& other) = default;
	inline void dtor() { typedef void (DisconnectCountdown::*_fpt)(); auto _f=xcast<_fpt>(_drva(2180672)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(DisconnectCountdown)==40),"bad size");
		static_assert((offsetof(DisconnectCountdown,isSignaled)==0x0),"bad off");
		static_assert((offsetof(DisconnectCountdown,timeToDisconnection)==0x4),"bad off");
		static_assert((offsetof(DisconnectCountdown,message)==0x8),"bad off");
	};
};

//UDT: class Task @len=40
	//_Func: public void Task(const Task &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void Task(); @loc=optimized @len=0 @rva=0
	//_Func: public void Task(std::function<void __cdecl(void)>  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void run(); @loc=optimized @len=0 @rva=0
	//_Func: public void spinWait(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: volatile bool, isDone
	//_Data: this+0x8, Member, Type: class std::function<void __cdecl(void)>, function
	//_Func: public void ~Task(); @loc=static @len=74 @rva=175552
	//_Func: public Task & operator=(const Task &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class Task {
public:
	bool isDone;
	std::function<void __cdecl(void)> function;
	inline Task() { }
	inline Task(const Task& other) = default;
	inline Task& operator=(const Task& other) = default;
	inline void dtor() { typedef void (Task::*_fpt)(); auto _f=xcast<_fpt>(_drva(175552)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(Task)==40),"bad size");
		static_assert((offsetof(Task,isDone)==0x0),"bad off");
		static_assert((offsetof(Task,function)==0x8),"bad off");
	};
};

//UDT: struct DriverActionsState @len=4
	//_Data: this+0x0, Member, Type: int, state
	//_Func: public void reset(); @loc=optimized @len=0 @rva=0
	//_Func: public void setState(DriverActions  _arg0, bool  _arg1); @loc=optimized @len=0 @rva=0
	//_Func: public bool getState(DriverActions  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void DriverActionsState(); @loc=optimized @len=0 @rva=0
//UDT;

struct DriverActionsState {
public:
	int state;
	inline DriverActionsState() { }
	inline DriverActionsState(const DriverActionsState& other) = default;
	inline DriverActionsState& operator=(const DriverActionsState& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(DriverActionsState)==4),"bad size");
		static_assert((offsetof(DriverActionsState,state)==0x0),"bad off");
	};
};

//UDT: struct ksgui::GraphReferenceAxis @len=20
	//_Func: public void GraphReferenceAxis(const vec3f & acolor, float arefValue, bool bisVertical); @loc=static @len=35 @rva=2987152
	//_Data: this+0x0, Member, Type: class vec3f, color
	//_Data: this+0xC, Member, Type: float, refValue
	//_Data: this+0x10, Member, Type: bool, isVertical
//UDT;

struct ksgui_GraphReferenceAxis {
public:
	vec3f color;
	float refValue;
	bool isVertical;
	inline ksgui_GraphReferenceAxis() { }
	inline ksgui_GraphReferenceAxis(const ksgui_GraphReferenceAxis& other) = default;
	inline ksgui_GraphReferenceAxis& operator=(const ksgui_GraphReferenceAxis& other) = default;
	inline void ctor(const vec3f & acolor, float arefValue, bool bisVertical) { typedef void (ksgui_GraphReferenceAxis::*_fpt)(const vec3f &, float, bool); auto _f=xcast<_fpt>(_drva(2987152)); (this->*_f)(acolor, arefValue, bisVertical); }
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_GraphReferenceAxis)==20),"bad size");
		static_assert((offsetof(ksgui_GraphReferenceAxis,color)==0x0),"bad off");
		static_assert((offsetof(ksgui_GraphReferenceAxis,refValue)==0xC),"bad off");
		static_assert((offsetof(ksgui_GraphReferenceAxis,isVertical)==0x10),"bad off");
	};
};

//UDT: struct SplinePoint @len=20
	//_Func: public void SplinePoint(const vec3f &  _arg0, float  _arg1, int  _arg2); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class vec3f, point
	//_Data: this+0xC, Member, Type: float, pointLength
	//_Data: this+0x10, Member, Type: int, tag
//UDT;

struct SplinePoint {
public:
	vec3f point;
	float pointLength;
	int tag;
	inline SplinePoint() { }
	inline SplinePoint(const SplinePoint& other) = default;
	inline SplinePoint& operator=(const SplinePoint& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(SplinePoint)==20),"bad size");
		static_assert((offsetof(SplinePoint,point)==0x0),"bad off");
		static_assert((offsetof(SplinePoint,pointLength)==0xC),"bad off");
		static_assert((offsetof(SplinePoint,tag)==0x10),"bad off");
	};
};

//UDT: class TCPQueue @len=65540
	//_Func: public void TCPQueue(); @loc=optimized @len=0 @rva=0
	//_Func: public void push(unsigned char * data, unsigned int size); @loc=static @len=215 @rva=2482992
	//_Func: public std::vector<unsigned char,std::allocator<unsigned char> > getPacket(); @loc=static @len=238 @rva=2482752
	//_Data: this+0x0, Member, Type: unsigned char[0x10000], buffer
	//_Data: this+0x10000, Member, Type: unsigned int, cursor
//UDT;

class TCPQueue {
public:
	unsigned char buffer[65536];
	unsigned int cursor;
	inline TCPQueue() { }
	inline TCPQueue(const TCPQueue& other) = default;
	inline TCPQueue& operator=(const TCPQueue& other) = default;
	inline void push(unsigned char * data, unsigned int size) { typedef void (TCPQueue::*_fpt)(unsigned char *, unsigned int); auto _f=xcast<_fpt>(_drva(2482992)); return (this->*_f)(data, size); }
	inline std::vector<unsigned char,std::allocator<unsigned char> > getPacket() { typedef std::vector<unsigned char,std::allocator<unsigned char> > (TCPQueue::*_fpt)(); auto _f=xcast<_fpt>(_drva(2482752)); return (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(TCPQueue)==65540),"bad size");
		static_assert((offsetof(TCPQueue,buffer)==0x0),"bad off");
		static_assert((offsetof(TCPQueue,cursor)==0x10000),"bad off");
	};
};

//UDT: struct PenaltyRules @len=8
	//_Data: this+0x0, Member, Type: enum JumpStartPenaltyMode, jumpStartPenaltyMode
	//_Data: this+0x4, Member, Type: short, basePitPenaltyLaps
	//_Func: public bool isFirstGearLocked(); @loc=optimized @len=0 @rva=0
	//_Func: public void PenaltyRules(); @loc=optimized @len=0 @rva=0
//UDT;

struct PenaltyRules {
public:
	JumpStartPenaltyMode jumpStartPenaltyMode;
	short basePitPenaltyLaps;
	inline PenaltyRules() { }
	inline PenaltyRules(const PenaltyRules& other) = default;
	inline PenaltyRules& operator=(const PenaltyRules& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(PenaltyRules)==8),"bad size");
		static_assert((offsetof(PenaltyRules,jumpStartPenaltyMode)==0x0),"bad off");
		static_assert((offsetof(PenaltyRules,basePitPenaltyLaps)==0x4),"bad off");
	};
};

//UDT: struct SessionInfo @len=32
	//_Func: public void SessionInfo(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: enum SessionType, type
	//_Data: this+0x8, Member, Type: double, startTimeMS
	//_Data: this+0x10, Member, Type: double, timeSecs
	//_Data: this+0x18, Member, Type: int, laps
	//_Data: this+0x1C, Member, Type: int, index
//UDT;

struct SessionInfo {
public:
	SessionType type;
	double startTimeMS;
	double timeSecs;
	int laps;
	int index;
	inline SessionInfo() { }
	inline SessionInfo(const SessionInfo& other) = default;
	inline SessionInfo& operator=(const SessionInfo& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(SessionInfo)==32),"bad size");
		static_assert((offsetof(SessionInfo,type)==0x0),"bad off");
		static_assert((offsetof(SessionInfo,startTimeMS)==0x8),"bad off");
		static_assert((offsetof(SessionInfo,timeSecs)==0x10),"bad off");
		static_assert((offsetof(SessionInfo,laps)==0x18),"bad off");
		static_assert((offsetof(SessionInfo,index)==0x1C),"bad off");
	};
};

//UDT: class ICollisionCallback @len=8 @vfcount=2
	//_VTable: 
	//_Func: public void ~ICollisionCallback(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=11 @rva=2501856
	//_Func: public void onCollisionCallBack(void *  _arg0, void *  _arg1, void *  _arg2, void *  _arg3, vec3f  _arg4, vec3f  _arg5, float  _arg6); @intro @pure @virtual vtpo=0 vfid=1 @loc=optimized @len=0 @rva=0
	//_Func: public void ICollisionCallback(const ICollisionCallback &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ICollisionCallback(); @loc=optimized @len=0 @rva=0
	//_Func: public ICollisionCallback & operator=(const ICollisionCallback &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class ICollisionCallback {
public:
	inline ICollisionCallback() { }
	inline ICollisionCallback(const ICollisionCallback& other) = default;
	inline ICollisionCallback& operator=(const ICollisionCallback& other) = default;
	virtual ~ICollisionCallback();
	inline void dtor() { typedef void (ICollisionCallback::*_fpt)(); auto _f=xcast<_fpt>(_drva(2501856)); (this->*_f)(); }
	virtual void onCollisionCallBack_vf1(void *  _arg0, void *  _arg1, void *  _arg2, void *  _arg3, vec3f  _arg4, vec3f  _arg5, float  _arg6) = 0;
	inline void onCollisionCallBack(void *  _arg0, void *  _arg1, void *  _arg2, void *  _arg3, vec3f  _arg4, vec3f  _arg5, float  _arg6) { typedef void (ICollisionCallback::*_fpt)(void *, void *, void *, void *, vec3f, vec3f, float); auto _f=xcast<_fpt>(get_vfp(this, 1)); return (this->*_f)( _arg0,  _arg1,  _arg2,  _arg3,  _arg4,  _arg5,  _arg6); }
	inline void _guard_obj() {
		static_assert((sizeof(ICollisionCallback)==8),"bad size");
	};
};

//UDT: struct BodyCollisionMesh @len=24
	//_Func: public void ~BodyCollisionMesh(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float *, vertices
	//_Data: this+0x8, Member, Type: unsigned short *, indices
	//_Data: this+0x10, Member, Type: struct dxGeom *, geomID
	//_Func: public void BodyCollisionMesh(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct BodyCollisionMesh {
public:
	float * vertices;
	unsigned short * indices;
	dxGeom * geomID;
	inline BodyCollisionMesh() { }
	inline BodyCollisionMesh(const BodyCollisionMesh& other) = default;
	inline BodyCollisionMesh& operator=(const BodyCollisionMesh& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(BodyCollisionMesh)==24),"bad size");
		static_assert((offsetof(BodyCollisionMesh,vertices)==0x0),"bad off");
		static_assert((offsetof(BodyCollisionMesh,indices)==0x8),"bad off");
		static_assert((offsetof(BodyCollisionMesh,geomID)==0x10),"bad off");
	};
};

//UDT: struct OnWindowClosedEvent @len=8
	//_Func: public void OnWindowClosedEvent(RenderWindow *  _arg0); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class RenderWindow *, renderWindow
//UDT;

struct OnWindowClosedEvent {
public:
	RenderWindow * renderWindow;
	inline OnWindowClosedEvent() { }
	inline OnWindowClosedEvent(const OnWindowClosedEvent& other) = default;
	inline OnWindowClosedEvent& operator=(const OnWindowClosedEvent& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(OnWindowClosedEvent)==8),"bad size");
		static_assert((offsetof(OnWindowClosedEvent,renderWindow)==0x0),"bad off");
	};
};

//UDT: struct LapInvalidator @len=32
	//_Func: public void ~LapInvalidator(); @loc=static @len=3 @rva=96368
	//_Data: this+0x0, Member, Type: double, collisionSafeTime
	//_Func: public void init(Car * car); @loc=static @len=5 @rva=2865408
	//_Func: public int getCurrentTyresOut(); @loc=optimized @len=0 @rva=0
	//_Func: public void step(float dt); @loc=static @len=402 @rva=2884992
	//_Data: this+0x8, Member, Type: class Car *, car
	//_Data: this+0x10, Member, Type: int, currentTyresOut
	//_Data: this+0x14, Member, Type: bool, isInPenaltyZone
	//_Data: this+0x18, Member, Type: float, lastBlackFlagTime
	//_Func: private void onEnterPenaltyZone(int tyre_count, float black_flag_time); @loc=static @len=431 @rva=2884560
	//_Func: private void onInPenaltyZone(int  _arg0, float  _arg1); @loc=optimized @len=0 @rva=0
	//_Func: public void LapInvalidator(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct LapInvalidator {
public:
	double collisionSafeTime;
	Car * car;
	int currentTyresOut;
	bool isInPenaltyZone;
	float lastBlackFlagTime;
	inline LapInvalidator() { }
	inline LapInvalidator(const LapInvalidator& other) = default;
	inline LapInvalidator& operator=(const LapInvalidator& other) = default;
	inline void dtor() { typedef void (LapInvalidator::*_fpt)(); auto _f=xcast<_fpt>(_drva(96368)); (this->*_f)(); }
	inline void init(Car * car) { typedef void (LapInvalidator::*_fpt)(Car *); auto _f=xcast<_fpt>(_drva(2865408)); return (this->*_f)(car); }
	inline void step(float dt) { typedef void (LapInvalidator::*_fpt)(float); auto _f=xcast<_fpt>(_drva(2884992)); return (this->*_f)(dt); }
	inline void onEnterPenaltyZone(int tyre_count, float black_flag_time) { typedef void (LapInvalidator::*_fpt)(int, float); auto _f=xcast<_fpt>(_drva(2884560)); return (this->*_f)(tyre_count, black_flag_time); }
	inline void _guard_obj() {
		static_assert((sizeof(LapInvalidator)==32),"bad size");
		static_assert((offsetof(LapInvalidator,collisionSafeTime)==0x0),"bad off");
		static_assert((offsetof(LapInvalidator,car)==0x8),"bad off");
		static_assert((offsetof(LapInvalidator,currentTyresOut)==0x10),"bad off");
		static_assert((offsetof(LapInvalidator,isInPenaltyZone)==0x14),"bad off");
		static_assert((offsetof(LapInvalidator,lastBlackFlagTime)==0x18),"bad off");
	};
};

//UDT: struct OnStepCompleteEvent @len=16
	//_Data: this+0x0, Member, Type: class Car *, car
	//_Data: this+0x8, Member, Type: double, physicsTime
//UDT;

struct OnStepCompleteEvent {
public:
	Car * car;
	double physicsTime;
	inline OnStepCompleteEvent() { }
	inline OnStepCompleteEvent(const OnStepCompleteEvent& other) = default;
	inline OnStepCompleteEvent& operator=(const OnStepCompleteEvent& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(OnStepCompleteEvent)==16),"bad size");
		static_assert((offsetof(OnStepCompleteEvent,car)==0x0),"bad off");
		static_assert((offsetof(OnStepCompleteEvent,physicsTime)==0x8),"bad off");
	};
};

//UDT: class Joypad @len=8 @vfcount=7
	//_VTable: 
	//_Func: public void acquire(); @intro @pure @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
	//_Func: public vec2f getLeftStick(); @intro @pure @virtual vtpo=0 vfid=1 @loc=optimized @len=0 @rva=0
	//_Func: public vec2f getRightStick(); @intro @pure @virtual vtpo=0 vfid=2 @loc=optimized @len=0 @rva=0
	//_Func: public float getLeftTrigger(); @intro @pure @virtual vtpo=0 vfid=3 @loc=optimized @len=0 @rva=0
	//_Func: public float getRightTrigger(); @intro @pure @virtual vtpo=0 vfid=4 @loc=optimized @len=0 @rva=0
	//_Func: public unsigned int getButtonMask(); @intro @pure @virtual vtpo=0 vfid=5 @loc=optimized @len=0 @rva=0
	//_Func: public void setVibrations(float  _arg0, float  _arg1); @intro @pure @virtual vtpo=0 vfid=6 @loc=optimized @len=0 @rva=0
	//_Func: public void Joypad(const Joypad &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void Joypad(); @loc=optimized @len=0 @rva=0
	//_Func: public Joypad & operator=(const Joypad &  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class Joypad {
public:
	inline Joypad() { }
	inline Joypad(const Joypad& other) = default;
	inline Joypad& operator=(const Joypad& other) = default;
	virtual void acquire_vf0() = 0;
	inline void acquire() { typedef void (Joypad::*_fpt)(); auto _f=xcast<_fpt>(get_vfp(this, 0)); return (this->*_f)(); }
	virtual vec2f getLeftStick_vf1() = 0;
	inline vec2f getLeftStick() { typedef vec2f (Joypad::*_fpt)(); auto _f=xcast<_fpt>(get_vfp(this, 1)); return (this->*_f)(); }
	virtual vec2f getRightStick_vf2() = 0;
	inline vec2f getRightStick() { typedef vec2f (Joypad::*_fpt)(); auto _f=xcast<_fpt>(get_vfp(this, 2)); return (this->*_f)(); }
	virtual float getLeftTrigger_vf3() = 0;
	inline float getLeftTrigger() { typedef float (Joypad::*_fpt)(); auto _f=xcast<_fpt>(get_vfp(this, 3)); return (this->*_f)(); }
	virtual float getRightTrigger_vf4() = 0;
	inline float getRightTrigger() { typedef float (Joypad::*_fpt)(); auto _f=xcast<_fpt>(get_vfp(this, 4)); return (this->*_f)(); }
	virtual unsigned int getButtonMask_vf5() = 0;
	inline unsigned int getButtonMask() { typedef unsigned int (Joypad::*_fpt)(); auto _f=xcast<_fpt>(get_vfp(this, 5)); return (this->*_f)(); }
	virtual void setVibrations_vf6(float  _arg0, float  _arg1) = 0;
	inline void setVibrations(float  _arg0, float  _arg1) { typedef void (Joypad::*_fpt)(float, float); auto _f=xcast<_fpt>(get_vfp(this, 6)); return (this->*_f)( _arg0,  _arg1); }
	inline void _guard_obj() {
		static_assert((sizeof(Joypad)==8),"bad size");
	};
};

//UDT: struct GearChanger @len=24
	//_Func: public void ~GearChanger(); @loc=static @len=3 @rva=96368
	//_Data: this+0x0, Member, Type: bool, wasGearUpTriggered
	//_Data: this+0x1, Member, Type: bool, wasGearDnTriggered
	//_Func: public void init(Car * car); @loc=static @len=11 @rva=2861888
	//_Func: public void step(float dt); @loc=static @len=146 @rva=2861904
	//_Data: this+0x8, Member, Type: class Car *, car
	//_Data: this+0x10, Member, Type: bool, lastGearUp
	//_Data: this+0x11, Member, Type: bool, lastGearDn
	//_Func: public void GearChanger(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct GearChanger {
public:
	bool wasGearUpTriggered;
	bool wasGearDnTriggered;
	Car * car;
	bool lastGearUp;
	bool lastGearDn;
	inline GearChanger() { }
	inline GearChanger(const GearChanger& other) = default;
	inline GearChanger& operator=(const GearChanger& other) = default;
	inline void dtor() { typedef void (GearChanger::*_fpt)(); auto _f=xcast<_fpt>(_drva(96368)); (this->*_f)(); }
	inline void init(Car * car) { typedef void (GearChanger::*_fpt)(Car *); auto _f=xcast<_fpt>(_drva(2861888)); return (this->*_f)(car); }
	inline void step(float dt) { typedef void (GearChanger::*_fpt)(float); auto _f=xcast<_fpt>(_drva(2861904)); return (this->*_f)(dt); }
	inline void _guard_obj() {
		static_assert((sizeof(GearChanger)==24),"bad size");
		static_assert((offsetof(GearChanger,wasGearUpTriggered)==0x0),"bad off");
		static_assert((offsetof(GearChanger,wasGearDnTriggered)==0x1),"bad off");
		static_assert((offsetof(GearChanger,car)==0x8),"bad off");
		static_assert((offsetof(GearChanger,lastGearUp)==0x10),"bad off");
		static_assert((offsetof(GearChanger,lastGearDn)==0x11),"bad off");
	};
};

//UDT: struct AutoShifter @len=40
	//_Func: public void ~AutoShifter(); @loc=static @len=3 @rva=96368
	//_Data: this+0x0, Member, Type: bool, isActive
	//_Data: this+0x4, Member, Type: int, changeUpRpm
	//_Data: this+0x8, Member, Type: int, changeDnRpm
	//_Data: this+0xC, Member, Type: float, slipThreshold
	//_Func: public void init(Car * car); @loc=static @len=44 @rva=2859040
	//_Func: public void step(float dt); @loc=static @len=843 @rva=2861040
	//_Data: this+0x10, Member, Type: class Car *, car
	//_Data: this+0x18, Member, Type: bool, butGearUp
	//_Data: this+0x19, Member, Type: bool, butGearDn
	//_Data: this+0x1C, Member, Type: float, gasCutoff
	//_Data: this+0x20, Member, Type: float, gasCutoffTime
	//_Func: private void loadINI(); @loc=static @len=1946 @rva=2859088
	//_Func: public void AutoShifter(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct AutoShifter {
public:
	bool isActive;
	int changeUpRpm;
	int changeDnRpm;
	float slipThreshold;
	Car * car;
	bool butGearUp;
	bool butGearDn;
	float gasCutoff;
	float gasCutoffTime;
	inline AutoShifter() { }
	inline AutoShifter(const AutoShifter& other) = default;
	inline AutoShifter& operator=(const AutoShifter& other) = default;
	inline void dtor() { typedef void (AutoShifter::*_fpt)(); auto _f=xcast<_fpt>(_drva(96368)); (this->*_f)(); }
	inline void init(Car * car) { typedef void (AutoShifter::*_fpt)(Car *); auto _f=xcast<_fpt>(_drva(2859040)); return (this->*_f)(car); }
	inline void step(float dt) { typedef void (AutoShifter::*_fpt)(float); auto _f=xcast<_fpt>(_drva(2861040)); return (this->*_f)(dt); }
	inline void loadINI() { typedef void (AutoShifter::*_fpt)(); auto _f=xcast<_fpt>(_drva(2859088)); return (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(AutoShifter)==40),"bad size");
		static_assert((offsetof(AutoShifter,isActive)==0x0),"bad off");
		static_assert((offsetof(AutoShifter,changeUpRpm)==0x4),"bad off");
		static_assert((offsetof(AutoShifter,changeDnRpm)==0x8),"bad off");
		static_assert((offsetof(AutoShifter,slipThreshold)==0xC),"bad off");
		static_assert((offsetof(AutoShifter,car)==0x10),"bad off");
		static_assert((offsetof(AutoShifter,butGearUp)==0x18),"bad off");
		static_assert((offsetof(AutoShifter,butGearDn)==0x19),"bad off");
		static_assert((offsetof(AutoShifter,gasCutoff)==0x1C),"bad off");
		static_assert((offsetof(AutoShifter,gasCutoffTime)==0x20),"bad off");
	};
};

//UDT: struct EDL @len=56
	//_Func: public void ~EDL(); @loc=static @len=3 @rva=96368
	//_Data: this+0x0, Member, Type: bool, isPresent
	//_Data: this+0x1, Member, Type: bool, isActive
	//_Data: this+0x4, Member, Type: float, wheelSpeedGainPower
	//_Data: this+0x8, Member, Type: float, wheelSpeedGainCoast
	//_Data: this+0xC, Member, Type: float, deadZonePower
	//_Data: this+0x10, Member, Type: float, deadZoneCoast
	//_Data: this+0x14, Member, Type: float, brakeTorquePower
	//_Data: this+0x18, Member, Type: float, brakeTorqueCoast
	//_Data: this+0x1C, Member, Type: float, outLevel
	//_Data: this+0x20, Member, Type: float, outBrakeTorque
	//_Data: this+0x24, Member, Type: float, speedDiff
	//_Func: public void step(float td); @loc=static @len=414 @rva=2864224
	//_Func: public void init(Car * a_car); @loc=static @len=2145 @rva=2862064
	//_Data: this+0x28, Member, Type: class Car *, car
	//_Data: this+0x30, Member, Type: int, leftTyreIndex
	//_Data: this+0x34, Member, Type: int, rightTyreIndex
	//_Func: public void EDL(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct EDL {
public:
	bool isPresent;
	bool isActive;
	float wheelSpeedGainPower;
	float wheelSpeedGainCoast;
	float deadZonePower;
	float deadZoneCoast;
	float brakeTorquePower;
	float brakeTorqueCoast;
	float outLevel;
	float outBrakeTorque;
	float speedDiff;
	Car * car;
	int leftTyreIndex;
	int rightTyreIndex;
	inline EDL() { }
	inline EDL(const EDL& other) = default;
	inline EDL& operator=(const EDL& other) = default;
	inline void dtor() { typedef void (EDL::*_fpt)(); auto _f=xcast<_fpt>(_drva(96368)); (this->*_f)(); }
	inline void step(float td) { typedef void (EDL::*_fpt)(float); auto _f=xcast<_fpt>(_drva(2864224)); return (this->*_f)(td); }
	inline void init(Car * a_car) { typedef void (EDL::*_fpt)(Car *); auto _f=xcast<_fpt>(_drva(2862064)); return (this->*_f)(a_car); }
	inline void _guard_obj() {
		static_assert((sizeof(EDL)==56),"bad size");
		static_assert((offsetof(EDL,isPresent)==0x0),"bad off");
		static_assert((offsetof(EDL,isActive)==0x1),"bad off");
		static_assert((offsetof(EDL,wheelSpeedGainPower)==0x4),"bad off");
		static_assert((offsetof(EDL,wheelSpeedGainCoast)==0x8),"bad off");
		static_assert((offsetof(EDL,deadZonePower)==0xC),"bad off");
		static_assert((offsetof(EDL,deadZoneCoast)==0x10),"bad off");
		static_assert((offsetof(EDL,brakeTorquePower)==0x14),"bad off");
		static_assert((offsetof(EDL,brakeTorqueCoast)==0x18),"bad off");
		static_assert((offsetof(EDL,outLevel)==0x1C),"bad off");
		static_assert((offsetof(EDL,outBrakeTorque)==0x20),"bad off");
		static_assert((offsetof(EDL,speedDiff)==0x24),"bad off");
		static_assert((offsetof(EDL,car)==0x28),"bad off");
		static_assert((offsetof(EDL,leftTyreIndex)==0x30),"bad off");
		static_assert((offsetof(EDL,rightTyreIndex)==0x34),"bad off");
	};
};

//UDT: struct ksgui::OnScrollBarValueChanged @len=16
	//_Data: this+0x0, Member, Type: class ksgui::ScrollBar *, scrollBar
	//_Data: this+0x8, Member, Type: int, value
//UDT;

struct ksgui_OnScrollBarValueChanged {
public:
	ksgui_ScrollBar * scrollBar;
	int value;
	inline ksgui_OnScrollBarValueChanged() { }
	inline ksgui_OnScrollBarValueChanged(const ksgui_OnScrollBarValueChanged& other) = default;
	inline ksgui_OnScrollBarValueChanged& operator=(const ksgui_OnScrollBarValueChanged& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_OnScrollBarValueChanged)==16),"bad size");
		static_assert((offsetof(ksgui_OnScrollBarValueChanged,scrollBar)==0x0),"bad off");
		static_assert((offsetof(ksgui_OnScrollBarValueChanged,value)==0x8),"bad off");
	};
};

//UDT: struct ServerInfo @len=72
	//_Func: public void ServerInfo(const ServerInfo &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ServerInfo(); @loc=static @len=127 @rva=243344
	//_Data: this+0x0, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Data: this+0x20, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, ip
	//_Data: this+0x40, Member, Type: unsigned short, httpPort
	//_Data: this+0x42, Member, Type: unsigned short, udpPort
	//_Data: this+0x44, Member, Type: unsigned short, tcpPort
	//_Func: public void ~ServerInfo(); @loc=static @len=88 @rva=776352
	//_Func: public ServerInfo & operator=(const ServerInfo &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct ServerInfo {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > ip;
	unsigned short httpPort;
	unsigned short udpPort;
	unsigned short tcpPort;
	inline ServerInfo() { }
	inline ServerInfo(const ServerInfo& other) = default;
	inline ServerInfo& operator=(const ServerInfo& other) = default;
	inline void ctor() { typedef void (ServerInfo::*_fpt)(); auto _f=xcast<_fpt>(_drva(243344)); (this->*_f)(); }
	inline void dtor() { typedef void (ServerInfo::*_fpt)(); auto _f=xcast<_fpt>(_drva(776352)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(ServerInfo)==72),"bad size");
		static_assert((offsetof(ServerInfo,name)==0x0),"bad off");
		static_assert((offsetof(ServerInfo,ip)==0x20),"bad off");
		static_assert((offsetof(ServerInfo,httpPort)==0x40),"bad off");
		static_assert((offsetof(ServerInfo,udpPort)==0x42),"bad off");
		static_assert((offsetof(ServerInfo,tcpPort)==0x44),"bad off");
	};
};

//UDT: struct ksgui::OnControlClicked @len=16
	//_Data: this+0x0, Member, Type: class ksgui::Control *, control
	//_Data: this+0x8, Member, Type: int, localx
	//_Data: this+0xC, Member, Type: int, localy
//UDT;

struct ksgui_OnControlClicked {
public:
	ksgui_Control * control;
	int localx;
	int localy;
	inline ksgui_OnControlClicked() { }
	inline ksgui_OnControlClicked(const ksgui_OnControlClicked& other) = default;
	inline ksgui_OnControlClicked& operator=(const ksgui_OnControlClicked& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_OnControlClicked)==16),"bad size");
		static_assert((offsetof(ksgui_OnControlClicked,control)==0x0),"bad off");
		static_assert((offsetof(ksgui_OnControlClicked,localx)==0x8),"bad off");
		static_assert((offsetof(ksgui_OnControlClicked,localy)==0xC),"bad off");
	};
};

//UDT: struct DriftModeComponent @len=80
	//_Func: public void ~DriftModeComponent(); @loc=static @len=3 @rva=96368
	//_Func: public double getPoints(); @loc=optimized @len=0 @rva=0
	//_Func: public double getInstantPoints(); @loc=optimized @len=0 @rva=0
	//_Func: public bool isExtremeDrifting(); @loc=optimized @len=0 @rva=0
	//_Func: public bool isValid(); @loc=optimized @len=0 @rva=0
	//_Func: public double getCurrentSpeedMult(); @loc=optimized @len=0 @rva=0
	//_Func: public double getCurrentDriftAngle(); @loc=optimized @len=0 @rva=0
	//_Func: public int getComboCounter(); @loc=optimized @len=0 @rva=0
	//_Func: public void init(Car * car); @loc=static @len=380 @rva=2882976
	//_Func: public void step(float dt); @loc=static @len=846 @rva=2883360
	//_Data: this+0x0, Member, Type: class Car *, car
	//_Data: this+0x8, Member, Type: float, driftStraightTimer
	//_Data: this+0x10, Member, Type: double, points
	//_Data: this+0x18, Member, Type: double, instantDrift
	//_Data: this+0x20, Member, Type: double, currentSpeedMultiplier
	//_Data: this+0x28, Member, Type: double, currentDriftAngle
	//_Data: this+0x30, Member, Type: int, comboCounter
	//_Data: this+0x34, Member, Type: int, lastDriftDirection
	//_Data: this+0x38, Member, Type: bool, extremeDrifting
	//_Data: this+0x39, Member, Type: bool, drifting
	//_Data: this+0x3A, Member, Type: bool, invalid
	//_Data: this+0x3C, Member, Type: float[0x5], oldDamageZones
	//_Func: private bool checkExtremeDrifting(); @loc=static @len=321 @rva=2882640
	//_Func: private bool hasCarBeenDamaged(); @loc=optimized @len=0 @rva=0
	//_Func: private void validateDrift(); @loc=static @len=347 @rva=2884208
	//_Func: public void DriftModeComponent(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct DriftModeComponent {
public:
	Car * car;
	float driftStraightTimer;
	double points;
	double instantDrift;
	double currentSpeedMultiplier;
	double currentDriftAngle;
	int comboCounter;
	int lastDriftDirection;
	bool extremeDrifting;
	bool drifting;
	bool invalid;
	float oldDamageZones[5];
	inline DriftModeComponent() { }
	inline DriftModeComponent(const DriftModeComponent& other) = default;
	inline DriftModeComponent& operator=(const DriftModeComponent& other) = default;
	inline void dtor() { typedef void (DriftModeComponent::*_fpt)(); auto _f=xcast<_fpt>(_drva(96368)); (this->*_f)(); }
	inline void init(Car * car) { typedef void (DriftModeComponent::*_fpt)(Car *); auto _f=xcast<_fpt>(_drva(2882976)); return (this->*_f)(car); }
	inline void step(float dt) { typedef void (DriftModeComponent::*_fpt)(float); auto _f=xcast<_fpt>(_drva(2883360)); return (this->*_f)(dt); }
	inline bool checkExtremeDrifting() { typedef bool (DriftModeComponent::*_fpt)(); auto _f=xcast<_fpt>(_drva(2882640)); return (this->*_f)(); }
	inline void validateDrift() { typedef void (DriftModeComponent::*_fpt)(); auto _f=xcast<_fpt>(_drva(2884208)); return (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(DriftModeComponent)==80),"bad size");
		static_assert((offsetof(DriftModeComponent,car)==0x0),"bad off");
		static_assert((offsetof(DriftModeComponent,driftStraightTimer)==0x8),"bad off");
		static_assert((offsetof(DriftModeComponent,points)==0x10),"bad off");
		static_assert((offsetof(DriftModeComponent,instantDrift)==0x18),"bad off");
		static_assert((offsetof(DriftModeComponent,currentSpeedMultiplier)==0x20),"bad off");
		static_assert((offsetof(DriftModeComponent,currentDriftAngle)==0x28),"bad off");
		static_assert((offsetof(DriftModeComponent,comboCounter)==0x30),"bad off");
		static_assert((offsetof(DriftModeComponent,lastDriftDirection)==0x34),"bad off");
		static_assert((offsetof(DriftModeComponent,extremeDrifting)==0x38),"bad off");
		static_assert((offsetof(DriftModeComponent,drifting)==0x39),"bad off");
		static_assert((offsetof(DriftModeComponent,invalid)==0x3A),"bad off");
		static_assert((offsetof(DriftModeComponent,oldDamageZones)==0x3C),"bad off");
	};
};

//UDT: struct SpeedLimiter @len=16
	//_Func: public void ~SpeedLimiter(); @loc=static @len=3 @rva=96368
	//_Func: public void init(Car * car); @loc=static @len=5 @rva=2865408
	//_Func: public void step(float dt); @loc=static @len=247 @rva=2865424
	//_Func: public bool isLimitingSpeed(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: bool, shoudLimit
	//_Data: this+0x1, Member, Type: bool, isLimiting
	//_Data: this+0x8, Member, Type: class Car *, car
	//_Func: public void SpeedLimiter(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct SpeedLimiter {
public:
	bool shoudLimit;
	bool isLimiting;
	Car * car;
	inline SpeedLimiter() { }
	inline SpeedLimiter(const SpeedLimiter& other) = default;
	inline SpeedLimiter& operator=(const SpeedLimiter& other) = default;
	inline void dtor() { typedef void (SpeedLimiter::*_fpt)(); auto _f=xcast<_fpt>(_drva(96368)); (this->*_f)(); }
	inline void init(Car * car) { typedef void (SpeedLimiter::*_fpt)(Car *); auto _f=xcast<_fpt>(_drva(2865408)); return (this->*_f)(car); }
	inline void step(float dt) { typedef void (SpeedLimiter::*_fpt)(float); auto _f=xcast<_fpt>(_drva(2865424)); return (this->*_f)(dt); }
	inline void _guard_obj() {
		static_assert((sizeof(SpeedLimiter)==16),"bad size");
		static_assert((offsetof(SpeedLimiter,shoudLimit)==0x0),"bad off");
		static_assert((offsetof(SpeedLimiter,isLimiting)==0x1),"bad off");
		static_assert((offsetof(SpeedLimiter,car)==0x8),"bad off");
	};
};

//UDT: struct DifferentialSetting @len=16
	//_Data: this+0x0, Member, Type: float, power
	//_Data: this+0x4, Member, Type: float, coast
	//_Data: this+0x8, Member, Type: float, preload
	//_Data: this+0xC, Member, Type: enum DifferentialType, type
	//_Func: public void DifferentialSetting(); @loc=optimized @len=0 @rva=0
//UDT;

struct DifferentialSetting {
public:
	float power;
	float coast;
	float preload;
	DifferentialType type;
	inline DifferentialSetting() { }
	inline DifferentialSetting(const DifferentialSetting& other) = default;
	inline DifferentialSetting& operator=(const DifferentialSetting& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(DifferentialSetting)==16),"bad size");
		static_assert((offsetof(DifferentialSetting,power)==0x0),"bad off");
		static_assert((offsetof(DifferentialSetting,coast)==0x4),"bad off");
		static_assert((offsetof(DifferentialSetting,preload)==0x8),"bad off");
		static_assert((offsetof(DifferentialSetting,type)==0xC),"bad off");
	};
};

//UDT: struct GearRequestStatus @len=32
	//_Func: public void GearRequestStatus(); @loc=optimized @len=0 @rva=0
	//_Func: public bool setRequest(GearChangeRequest  _arg0, double  _arg1, int  _arg2); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: enum GearChangeRequest, request
	//_Data: this+0x8, Member, Type: double, timeAccumulator
	//_Data: this+0x10, Member, Type: double, timeout
	//_Data: this+0x18, Member, Type: int, requestedGear
//UDT;

struct GearRequestStatus {
public:
	GearChangeRequest request;
	double timeAccumulator;
	double timeout;
	int requestedGear;
	inline GearRequestStatus() { }
	inline GearRequestStatus(const GearRequestStatus& other) = default;
	inline GearRequestStatus& operator=(const GearRequestStatus& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(GearRequestStatus)==32),"bad size");
		static_assert((offsetof(GearRequestStatus,request)==0x0),"bad off");
		static_assert((offsetof(GearRequestStatus,timeAccumulator)==0x8),"bad off");
		static_assert((offsetof(GearRequestStatus,timeout)==0x10),"bad off");
		static_assert((offsetof(GearRequestStatus,requestedGear)==0x18),"bad off");
	};
};

//UDT: struct ksgui::OnCutExtremesChanged @len=16
	//_Data: this+0x0, Member, Type: class ksgui::Slider *, slider
	//_Data: this+0x8, Member, Type: float, cutIn
	//_Data: this+0xC, Member, Type: float, cutOut
//UDT;

struct ksgui_OnCutExtremesChanged {
public:
	ksgui_Slider * slider;
	float cutIn;
	float cutOut;
	inline ksgui_OnCutExtremesChanged() { }
	inline ksgui_OnCutExtremesChanged(const ksgui_OnCutExtremesChanged& other) = default;
	inline ksgui_OnCutExtremesChanged& operator=(const ksgui_OnCutExtremesChanged& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_OnCutExtremesChanged)==16),"bad size");
		static_assert((offsetof(ksgui_OnCutExtremesChanged,slider)==0x0),"bad off");
		static_assert((offsetof(ksgui_OnCutExtremesChanged,cutIn)==0x8),"bad off");
		static_assert((offsetof(ksgui_OnCutExtremesChanged,cutOut)==0xC),"bad off");
	};
};

//UDT: struct SGearRatio @len=40
	//_Func: public void SGearRatio(const SGearRatio &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void SGearRatio(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * iname, double iratio); @loc=static @len=173 @rva=2514800
	//_Data: this+0x0, Member, Type: double, ratio
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Func: public void ~SGearRatio(); @loc=static @len=49 @rva=2180672
	//_Func: public SGearRatio & operator=(const SGearRatio &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct SGearRatio {
public:
	double ratio;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	inline SGearRatio() { }
	inline SGearRatio(const SGearRatio& other) = default;
	inline SGearRatio& operator=(const SGearRatio& other) = default;
	inline void ctor(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * iname, double iratio) { typedef void (SGearRatio::*_fpt)(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > *, double); auto _f=xcast<_fpt>(_drva(2514800)); (this->*_f)(iname, iratio); }
	inline void dtor() { typedef void (SGearRatio::*_fpt)(); auto _f=xcast<_fpt>(_drva(2180672)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(SGearRatio)==40),"bad size");
		static_assert((offsetof(SGearRatio,ratio)==0x0),"bad off");
		static_assert((offsetof(SGearRatio,name)==0x8),"bad off");
	};
};

//UDT: struct OnReplayStatusChanged @len=12
	//_Func: public void OnReplayStatusChanged(eReplayStatus  _arg0, float  _arg1, float  _arg2); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: enum eReplayStatus, status
	//_Data: this+0x4, Member, Type: float, timeMult
	//_Data: this+0x8, Member, Type: float, slowMotionLevel
//UDT;

struct OnReplayStatusChanged {
public:
	eReplayStatus status;
	float timeMult;
	float slowMotionLevel;
	inline OnReplayStatusChanged() { }
	inline OnReplayStatusChanged(const OnReplayStatusChanged& other) = default;
	inline OnReplayStatusChanged& operator=(const OnReplayStatusChanged& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(OnReplayStatusChanged)==12),"bad size");
		static_assert((offsetof(OnReplayStatusChanged,status)==0x0),"bad off");
		static_assert((offsetof(OnReplayStatusChanged,timeMult)==0x4),"bad off");
		static_assert((offsetof(OnReplayStatusChanged,slowMotionLevel)==0x8),"bad off");
	};
};

//UDT: struct DriverInfo @len=128
	//_Data: this+0x0, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Data: this+0x20, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, team
	//_Data: this+0x40, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, nationality
	//_Data: this+0x60, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, nationCode
	//_Func: public void DriverInfo(const DriverInfo & __that); @loc=static @len=192 @rva=242096
	//_Func: public void DriverInfo(); @loc=static @len=69 @rva=242288
	//_Func: public void ~DriverInfo(); @loc=static @len=152 @rva=246464
	//_Func: public DriverInfo & operator=(const DriverInfo & __that); @loc=static @len=122 @rva=848192
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct DriverInfo {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > team;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > nationality;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > nationCode;
	inline DriverInfo() { }
	inline DriverInfo(const DriverInfo& other) = default;
	inline DriverInfo& operator=(const DriverInfo& other) = default;
	inline void ctor(const DriverInfo & __that) { typedef void (DriverInfo::*_fpt)(const DriverInfo &); auto _f=xcast<_fpt>(_drva(242096)); (this->*_f)(__that); }
	inline void ctor() { typedef void (DriverInfo::*_fpt)(); auto _f=xcast<_fpt>(_drva(242288)); (this->*_f)(); }
	inline void dtor() { typedef void (DriverInfo::*_fpt)(); auto _f=xcast<_fpt>(_drva(246464)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(DriverInfo)==128),"bad size");
		static_assert((offsetof(DriverInfo,name)==0x0),"bad off");
		static_assert((offsetof(DriverInfo,team)==0x20),"bad off");
		static_assert((offsetof(DriverInfo,nationality)==0x40),"bad off");
		static_assert((offsetof(DriverInfo,nationCode)==0x60),"bad off");
	};
};

//UDT: struct ReceivedVoteDef @len=28
	//_Data: this+0x0, Member, Type: enum VoteType, voteType
	//_Data: this+0x4, Member, Type: int, quorum
	//_Data: this+0x8, Member, Type: int, votes
	//_Data: this+0xC, Member, Type: int, timeLeftMS
	//_Data: this+0x10, Member, Type: int, lastVoterSessionID
	//_Data: this+0x14, Member, Type: int, lastVoterVote
	//_Data: this+0x18, Member, Type: unsigned char, targetSessionID
	//_Data: this+0x19, Member, Type: bool, isMe
	//_Func: public void ReceivedVoteDef(); @loc=static @len=25 @rva=242528
//UDT;

struct ReceivedVoteDef {
public:
	VoteType voteType;
	int quorum;
	int votes;
	int timeLeftMS;
	int lastVoterSessionID;
	int lastVoterVote;
	unsigned char targetSessionID;
	bool isMe;
	inline ReceivedVoteDef() { }
	inline ReceivedVoteDef(const ReceivedVoteDef& other) = default;
	inline ReceivedVoteDef& operator=(const ReceivedVoteDef& other) = default;
	inline void ctor() { typedef void (ReceivedVoteDef::*_fpt)(); auto _f=xcast<_fpt>(_drva(242528)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(ReceivedVoteDef)==28),"bad size");
		static_assert((offsetof(ReceivedVoteDef,voteType)==0x0),"bad off");
		static_assert((offsetof(ReceivedVoteDef,quorum)==0x4),"bad off");
		static_assert((offsetof(ReceivedVoteDef,votes)==0x8),"bad off");
		static_assert((offsetof(ReceivedVoteDef,timeLeftMS)==0xC),"bad off");
		static_assert((offsetof(ReceivedVoteDef,lastVoterSessionID)==0x10),"bad off");
		static_assert((offsetof(ReceivedVoteDef,lastVoterVote)==0x14),"bad off");
		static_assert((offsetof(ReceivedVoteDef,targetSessionID)==0x18),"bad off");
		static_assert((offsetof(ReceivedVoteDef,isMe)==0x19),"bad off");
	};
};

//UDT: struct DrivableCameraDef @len=56
	//_Func: public void DrivableCameraDef(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class vec3f, bumperCameraPos
	//_Data: this+0xC, Member, Type: float, bumperCameraPitch
	//_Data: this+0x10, Member, Type: class vec3f, bonnetCameraPos
	//_Data: this+0x1C, Member, Type: float, bonnetCameraPitch
	//_Data: this+0x20, Member, Type: float, chaseCameraPitch
	//_Data: this+0x24, Member, Type: class vec3f, dashCameraPos
	//_Data: this+0x30, Member, Type: float, rotationOffset
	//_Data: this+0x34, Member, Type: bool, bumperExternalSound
	//_Data: this+0x35, Member, Type: bool, bonnetExternalSound
//UDT;

struct DrivableCameraDef {
public:
	vec3f bumperCameraPos;
	float bumperCameraPitch;
	vec3f bonnetCameraPos;
	float bonnetCameraPitch;
	float chaseCameraPitch;
	vec3f dashCameraPos;
	float rotationOffset;
	bool bumperExternalSound;
	bool bonnetExternalSound;
	inline DrivableCameraDef() { }
	inline DrivableCameraDef(const DrivableCameraDef& other) = default;
	inline DrivableCameraDef& operator=(const DrivableCameraDef& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(DrivableCameraDef)==56),"bad size");
		static_assert((offsetof(DrivableCameraDef,bumperCameraPos)==0x0),"bad off");
		static_assert((offsetof(DrivableCameraDef,bumperCameraPitch)==0xC),"bad off");
		static_assert((offsetof(DrivableCameraDef,bonnetCameraPos)==0x10),"bad off");
		static_assert((offsetof(DrivableCameraDef,bonnetCameraPitch)==0x1C),"bad off");
		static_assert((offsetof(DrivableCameraDef,chaseCameraPitch)==0x20),"bad off");
		static_assert((offsetof(DrivableCameraDef,dashCameraPos)==0x24),"bad off");
		static_assert((offsetof(DrivableCameraDef,rotationOffset)==0x30),"bad off");
		static_assert((offsetof(DrivableCameraDef,bumperExternalSound)==0x34),"bad off");
		static_assert((offsetof(DrivableCameraDef,bonnetExternalSound)==0x35),"bad off");
	};
};

//UDT: struct TyreThermalPatch @len=40
	//_Func: public void TyreThermalPatch(const TyreThermalPatch &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void TyreThermalPatch(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class std::vector<TyreThermalPatch *,std::allocator<TyreThermalPatch *> >, connections
	//_Data: this+0x18, Member, Type: float, T
	//_Data: this+0x1C, Member, Type: float, inputT
	//_Data: this+0x20, Member, Type: int, elementIndex
	//_Data: this+0x24, Member, Type: int, stripeIndex
	//_Func: public void ~TyreThermalPatch(); @loc=optimized @len=0 @rva=0
	//_Func: public TyreThermalPatch & operator=(const TyreThermalPatch &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct TyreThermalPatch {
public:
	std::vector<TyreThermalPatch *,std::allocator<TyreThermalPatch *> > connections;
	float T;
	float inputT;
	int elementIndex;
	int stripeIndex;
	inline TyreThermalPatch() { }
	inline TyreThermalPatch(const TyreThermalPatch& other) = default;
	inline TyreThermalPatch& operator=(const TyreThermalPatch& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(TyreThermalPatch)==40),"bad size");
		static_assert((offsetof(TyreThermalPatch,connections)==0x0),"bad off");
		static_assert((offsetof(TyreThermalPatch,T)==0x18),"bad off");
		static_assert((offsetof(TyreThermalPatch,inputT)==0x1C),"bad off");
		static_assert((offsetof(TyreThermalPatch,elementIndex)==0x20),"bad off");
		static_assert((offsetof(TyreThermalPatch,stripeIndex)==0x24),"bad off");
	};
};

//UDT: struct OnLapCompletedEvent @len=56
	//_Func: public void OnLapCompletedEvent(const OnLapCompletedEvent &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void OnLapCompletedEvent(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: unsigned int, carIndex
	//_Data: this+0x4, Member, Type: unsigned int, lapTime
	//_Data: this+0x8, Member, Type: unsigned int, lapCount
	//_Data: this+0x10, Member, Type: class std::vector<unsigned int,std::allocator<unsigned int> >, splits
	//_Data: this+0x28, Member, Type: double, eventTime
	//_Data: this+0x30, Member, Type: bool, isValid
	//_Data: this+0x34, Member, Type: int, cuts
	//_Func: public void ~OnLapCompletedEvent(); @loc=static @len=53 @rva=246720
	//_Func: public OnLapCompletedEvent & operator=(const OnLapCompletedEvent &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct OnLapCompletedEvent {
public:
	unsigned int carIndex;
	unsigned int lapTime;
	unsigned int lapCount;
	std::vector<unsigned int,std::allocator<unsigned int> > splits;
	double eventTime;
	bool isValid;
	int cuts;
	inline OnLapCompletedEvent() { }
	inline OnLapCompletedEvent(const OnLapCompletedEvent& other) = default;
	inline OnLapCompletedEvent& operator=(const OnLapCompletedEvent& other) = default;
	inline void dtor() { typedef void (OnLapCompletedEvent::*_fpt)(); auto _f=xcast<_fpt>(_drva(246720)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(OnLapCompletedEvent)==56),"bad size");
		static_assert((offsetof(OnLapCompletedEvent,carIndex)==0x0),"bad off");
		static_assert((offsetof(OnLapCompletedEvent,lapTime)==0x4),"bad off");
		static_assert((offsetof(OnLapCompletedEvent,lapCount)==0x8),"bad off");
		static_assert((offsetof(OnLapCompletedEvent,splits)==0x10),"bad off");
		static_assert((offsetof(OnLapCompletedEvent,eventTime)==0x28),"bad off");
		static_assert((offsetof(OnLapCompletedEvent,isValid)==0x30),"bad off");
		static_assert((offsetof(OnLapCompletedEvent,cuts)==0x34),"bad off");
	};
};

//UDT: struct ksgui::OnSpinnerValueChanged @len=16
	//_Data: this+0x0, Member, Type: class ksgui::Spinner *, spinner
	//_Data: this+0x8, Member, Type: int, value
//UDT;

struct ksgui_OnSpinnerValueChanged {
public:
	ksgui_Spinner * spinner;
	int value;
	inline ksgui_OnSpinnerValueChanged() { }
	inline ksgui_OnSpinnerValueChanged(const ksgui_OnSpinnerValueChanged& other) = default;
	inline ksgui_OnSpinnerValueChanged& operator=(const ksgui_OnSpinnerValueChanged& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_OnSpinnerValueChanged)==16),"bad size");
		static_assert((offsetof(ksgui_OnSpinnerValueChanged,spinner)==0x0),"bad off");
		static_assert((offsetof(ksgui_OnSpinnerValueChanged,value)==0x8),"bad off");
	};
};

//UDT: class FileChangeObserver @len=48
	//_Func: public void FileChangeObserver(const FileChangeObserver &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void FileChangeObserver(); @loc=optimized @len=0 @rva=0
	//_Func: public void FileChangeObserver(const std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & a_filename); @loc=static @len=55 @rva=2339840
	//_Func: public void ~FileChangeObserver(); @loc=static @len=49 @rva=2180672
	//_Func: public bool hasChanged(); @loc=static @len=47 @rva=2339904
	//_Func: public void reset(); @loc=static @len=162 @rva=2340144
	//_Func: public void observe(const std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & a_filename); @loc=static @len=191 @rva=2339952
	//_Data: this+0x0, Member, Type: struct _FILETIME, lastFileTime
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, filename
	//_Data: this+0x28, Member, Type: unsigned long, lastChanged
	//_Func: private bool getFileTime(_FILETIME &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public FileChangeObserver & operator=(const FileChangeObserver &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class FileChangeObserver {
public:
	_FILETIME lastFileTime;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > filename;
	unsigned long lastChanged;
	inline FileChangeObserver() { }
	inline FileChangeObserver(const FileChangeObserver& other) = default;
	inline FileChangeObserver& operator=(const FileChangeObserver& other) = default;
	inline void ctor(const std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & a_filename) { typedef void (FileChangeObserver::*_fpt)(const std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &); auto _f=xcast<_fpt>(_drva(2339840)); (this->*_f)(a_filename); }
	inline void dtor() { typedef void (FileChangeObserver::*_fpt)(); auto _f=xcast<_fpt>(_drva(2180672)); (this->*_f)(); }
	inline bool hasChanged() { typedef bool (FileChangeObserver::*_fpt)(); auto _f=xcast<_fpt>(_drva(2339904)); return (this->*_f)(); }
	inline void reset() { typedef void (FileChangeObserver::*_fpt)(); auto _f=xcast<_fpt>(_drva(2340144)); return (this->*_f)(); }
	inline void observe(const std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & a_filename) { typedef void (FileChangeObserver::*_fpt)(const std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &); auto _f=xcast<_fpt>(_drva(2339952)); return (this->*_f)(a_filename); }
	inline void _guard_obj() {
		static_assert((sizeof(FileChangeObserver)==48),"bad size");
		static_assert((offsetof(FileChangeObserver,lastFileTime)==0x0),"bad off");
		static_assert((offsetof(FileChangeObserver,filename)==0x8),"bad off");
		static_assert((offsetof(FileChangeObserver,lastChanged)==0x28),"bad off");
	};
};

//UDT: struct TimeLineStatus @len=12
	//_Func: public void TimeLineStatus(); @loc=optimized @len=0 @rva=0
	//_Func: public void reset(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: bool, isValid
	//_Data: this+0x4, Member, Type: enum eTimeLineCheckResponse, lastResponse
	//_Data: this+0x8, Member, Type: unsigned int, lastTime
//UDT;

struct TimeLineStatus {
public:
	bool isValid;
	eTimeLineCheckResponse lastResponse;
	unsigned int lastTime;
	inline TimeLineStatus() { }
	inline TimeLineStatus(const TimeLineStatus& other) = default;
	inline TimeLineStatus& operator=(const TimeLineStatus& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(TimeLineStatus)==12),"bad size");
		static_assert((offsetof(TimeLineStatus,isValid)==0x0),"bad off");
		static_assert((offsetof(TimeLineStatus,lastResponse)==0x4),"bad off");
		static_assert((offsetof(TimeLineStatus,lastTime)==0x8),"bad off");
	};
};

//UDT: struct OnWindowResizeEvent @len=16
	//_Func: public void OnWindowResizeEvent(int  _arg0, int  _arg1, RenderWindow *  _arg2); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: int, width
	//_Data: this+0x4, Member, Type: int, height
	//_Data: this+0x8, Member, Type: class RenderWindow *, renderWindow
//UDT;

struct OnWindowResizeEvent {
public:
	int width;
	int height;
	RenderWindow * renderWindow;
	inline OnWindowResizeEvent() { }
	inline OnWindowResizeEvent(const OnWindowResizeEvent& other) = default;
	inline OnWindowResizeEvent& operator=(const OnWindowResizeEvent& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(OnWindowResizeEvent)==16),"bad size");
		static_assert((offsetof(OnWindowResizeEvent,width)==0x0),"bad off");
		static_assert((offsetof(OnWindowResizeEvent,height)==0x4),"bad off");
		static_assert((offsetof(OnWindowResizeEvent,renderWindow)==0x8),"bad off");
	};
};

//UDT: struct KGLShaderCBuffer @len=40
	//_Data: this+0x0, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, cBufferName
	//_Data: this+0x20, Member, Type: unsigned int, size
	//_Data: this+0x24, Member, Type: unsigned int, slot
	//_Func: public void KGLShaderCBuffer(const KGLShaderCBuffer &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void KGLShaderCBuffer(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~KGLShaderCBuffer(); @loc=static @len=48 @rva=113184
	//_Func: public KGLShaderCBuffer & operator=(const KGLShaderCBuffer &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct KGLShaderCBuffer {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > cBufferName;
	unsigned int size;
	unsigned int slot;
	inline KGLShaderCBuffer() { }
	inline KGLShaderCBuffer(const KGLShaderCBuffer& other) = default;
	inline KGLShaderCBuffer& operator=(const KGLShaderCBuffer& other) = default;
	inline void dtor() { typedef void (KGLShaderCBuffer::*_fpt)(); auto _f=xcast<_fpt>(_drva(113184)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(KGLShaderCBuffer)==40),"bad size");
		static_assert((offsetof(KGLShaderCBuffer,cBufferName)==0x0),"bad off");
		static_assert((offsetof(KGLShaderCBuffer,size)==0x20),"bad off");
		static_assert((offsetof(KGLShaderCBuffer,slot)==0x24),"bad off");
	};
};

//UDT: struct PenaltyRecord @len=12
	//_Func: public void PenaltyRecord(unsigned int  _arg0, unsigned int  _arg1, PenaltyDescription  _arg2); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: unsigned int, lap
	//_Data: this+0x4, Member, Type: unsigned int, seconds
	//_Data: this+0x8, Member, Type: enum PenaltyDescription, descr
//UDT;

struct PenaltyRecord {
public:
	unsigned int lap;
	unsigned int seconds;
	PenaltyDescription descr;
	inline PenaltyRecord() { }
	inline PenaltyRecord(const PenaltyRecord& other) = default;
	inline PenaltyRecord& operator=(const PenaltyRecord& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(PenaltyRecord)==12),"bad size");
		static_assert((offsetof(PenaltyRecord,lap)==0x0),"bad off");
		static_assert((offsetof(PenaltyRecord,seconds)==0x4),"bad off");
		static_assert((offsetof(PenaltyRecord,descr)==0x8),"bad off");
	};
};

//UDT: struct AISplinePayload @len=84
	//_Func: public void AISplinePayload(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, speedMS
	//_Data: this+0x4, Member, Type: float, radius
	//_Data: this+0x8, Member, Type: float[0x2], sides
	//_Data: this+0x10, Member, Type: float, camber
	//_Data: this+0x14, Member, Type: float, direction
	//_Data: this+0x18, Member, Type: class vec3f, normal
	//_Data: this+0x24, Member, Type: class vec3f, forwardVector
	//_Data: this+0x30, Member, Type: float, length
	//_Data: this+0x34, Member, Type: float, gas
	//_Data: this+0x38, Member, Type: float, brake
	//_Data: this+0x3C, Member, Type: float, grade
	//_Data: this+0x40, Member, Type: float, grip
	//_Data: this+0x44, Member, Type: float, distFromCorner
	//_Data: this+0x48, Member, Type: float, distFromNextCorner
	//_Data: this+0x4C, Member, Type: bool, isPitlane
	//_Data: this+0x50, Member, Type: float, compression
//UDT;

struct AISplinePayload {
public:
	float speedMS;
	float radius;
	float sides[2];
	float camber;
	float direction;
	vec3f normal;
	vec3f forwardVector;
	float length;
	float gas;
	float brake;
	float grade;
	float grip;
	float distFromCorner;
	float distFromNextCorner;
	bool isPitlane;
	float compression;
	inline AISplinePayload() { }
	inline AISplinePayload(const AISplinePayload& other) = default;
	inline AISplinePayload& operator=(const AISplinePayload& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(AISplinePayload)==84),"bad size");
		static_assert((offsetof(AISplinePayload,speedMS)==0x0),"bad off");
		static_assert((offsetof(AISplinePayload,radius)==0x4),"bad off");
		static_assert((offsetof(AISplinePayload,sides)==0x8),"bad off");
		static_assert((offsetof(AISplinePayload,camber)==0x10),"bad off");
		static_assert((offsetof(AISplinePayload,direction)==0x14),"bad off");
		static_assert((offsetof(AISplinePayload,normal)==0x18),"bad off");
		static_assert((offsetof(AISplinePayload,forwardVector)==0x24),"bad off");
		static_assert((offsetof(AISplinePayload,length)==0x30),"bad off");
		static_assert((offsetof(AISplinePayload,gas)==0x34),"bad off");
		static_assert((offsetof(AISplinePayload,brake)==0x38),"bad off");
		static_assert((offsetof(AISplinePayload,grade)==0x3C),"bad off");
		static_assert((offsetof(AISplinePayload,grip)==0x40),"bad off");
		static_assert((offsetof(AISplinePayload,distFromCorner)==0x44),"bad off");
		static_assert((offsetof(AISplinePayload,distFromNextCorner)==0x48),"bad off");
		static_assert((offsetof(AISplinePayload,isPitlane)==0x4C),"bad off");
		static_assert((offsetof(AISplinePayload,compression)==0x50),"bad off");
	};
};

//UDT: struct GridElement @len=24
	//_Func: public void GridElement(const GridElement &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void GridElement(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class std::vector<unsigned int,std::allocator<unsigned int> >, closestIndices
	//_Func: public void ~GridElement(); @loc=static @len=41 @rva=2731104
	//_Func: public GridElement & operator=(const GridElement &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct GridElement {
public:
	std::vector<unsigned int,std::allocator<unsigned int> > closestIndices;
	inline GridElement() { }
	inline GridElement(const GridElement& other) = default;
	inline GridElement& operator=(const GridElement& other) = default;
	inline void dtor() { typedef void (GridElement::*_fpt)(); auto _f=xcast<_fpt>(_drva(2731104)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(GridElement)==24),"bad size");
		static_assert((offsetof(GridElement,closestIndices)==0x0),"bad off");
	};
};

//UDT: struct CarCollisionBounds @len=40
	//_Data: this+0x0, Member, Type: class vec3f, min
	//_Data: this+0xC, Member, Type: class vec3f, max
	//_Data: this+0x18, Member, Type: float, length
	//_Data: this+0x1C, Member, Type: float, width
	//_Data: this+0x20, Member, Type: float, lengthFront
	//_Data: this+0x24, Member, Type: float, lengthRear
	//_Func: public void CarCollisionBounds(); @loc=optimized @len=0 @rva=0
//UDT;

struct CarCollisionBounds {
public:
	vec3f min;
	vec3f max;
	float length;
	float width;
	float lengthFront;
	float lengthRear;
	inline CarCollisionBounds() { }
	inline CarCollisionBounds(const CarCollisionBounds& other) = default;
	inline CarCollisionBounds& operator=(const CarCollisionBounds& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(CarCollisionBounds)==40),"bad size");
		static_assert((offsetof(CarCollisionBounds,min)==0x0),"bad off");
		static_assert((offsetof(CarCollisionBounds,max)==0xC),"bad off");
		static_assert((offsetof(CarCollisionBounds,length)==0x18),"bad off");
		static_assert((offsetof(CarCollisionBounds,width)==0x1C),"bad off");
		static_assert((offsetof(CarCollisionBounds,lengthFront)==0x20),"bad off");
		static_assert((offsetof(CarCollisionBounds,lengthRear)==0x24),"bad off");
	};
};

//UDT: struct FuelLapEvaluator @len=72
	//_Func: public void ~FuelLapEvaluator(); @loc=static @len=3 @rva=96368
	//_Func: public float getFuelLaps(); @loc=static @len=43 @rva=2675296
	//_Func: public void setIgnoreLap(bool value); @loc=static @len=4 @rva=2675536
	//_Func: public void init(Car * icar); @loc=static @len=145 @rva=2675376
	//_Func: public float getFuelPerLap(); @loc=static @len=26 @rva=2675344
	//_Func: public float getKmPerLiter(); @loc=optimized @len=0 @rva=0
	//_Func: public float getTotalKM(); @loc=optimized @len=0 @rva=0
	//_Func: public void step(float dt); @loc=static @len=152 @rva=2675552
	//_Data: this+0x0, Member, Type: class Car *, car
	//_Data: this+0x8, Member, Type: int, lapCount
	//_Data: this+0x10, Member, Type: double, lapStartFuel
	//_Data: this+0x18, Member, Type: double, fuelPerLap
	//_Data: this+0x20, Member, Type: double, totalM
	//_Data: this+0x28, Member, Type: double, totalLiters
	//_Data: this+0x30, Member, Type: double, startFuel
	//_Data: this+0x38, Member, Type: double, oldFuelPerLap
	//_Data: this+0x40, Member, Type: bool, ignoreLap
	//_Func: public void FuelLapEvaluator(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct FuelLapEvaluator {
public:
	Car * car;
	int lapCount;
	double lapStartFuel;
	double fuelPerLap;
	double totalM;
	double totalLiters;
	double startFuel;
	double oldFuelPerLap;
	bool ignoreLap;
	inline FuelLapEvaluator() { }
	inline FuelLapEvaluator(const FuelLapEvaluator& other) = default;
	inline FuelLapEvaluator& operator=(const FuelLapEvaluator& other) = default;
	inline void dtor() { typedef void (FuelLapEvaluator::*_fpt)(); auto _f=xcast<_fpt>(_drva(96368)); (this->*_f)(); }
	inline float getFuelLaps() { typedef float (FuelLapEvaluator::*_fpt)(); auto _f=xcast<_fpt>(_drva(2675296)); return (this->*_f)(); }
	inline void setIgnoreLap(bool value) { typedef void (FuelLapEvaluator::*_fpt)(bool); auto _f=xcast<_fpt>(_drva(2675536)); return (this->*_f)(value); }
	inline void init(Car * icar) { typedef void (FuelLapEvaluator::*_fpt)(Car *); auto _f=xcast<_fpt>(_drva(2675376)); return (this->*_f)(icar); }
	inline float getFuelPerLap() { typedef float (FuelLapEvaluator::*_fpt)(); auto _f=xcast<_fpt>(_drva(2675344)); return (this->*_f)(); }
	inline void step(float dt) { typedef void (FuelLapEvaluator::*_fpt)(float); auto _f=xcast<_fpt>(_drva(2675552)); return (this->*_f)(dt); }
	inline void _guard_obj() {
		static_assert((sizeof(FuelLapEvaluator)==72),"bad size");
		static_assert((offsetof(FuelLapEvaluator,car)==0x0),"bad off");
		static_assert((offsetof(FuelLapEvaluator,lapCount)==0x8),"bad off");
		static_assert((offsetof(FuelLapEvaluator,lapStartFuel)==0x10),"bad off");
		static_assert((offsetof(FuelLapEvaluator,fuelPerLap)==0x18),"bad off");
		static_assert((offsetof(FuelLapEvaluator,totalM)==0x20),"bad off");
		static_assert((offsetof(FuelLapEvaluator,totalLiters)==0x28),"bad off");
		static_assert((offsetof(FuelLapEvaluator,startFuel)==0x30),"bad off");
		static_assert((offsetof(FuelLapEvaluator,oldFuelPerLap)==0x38),"bad off");
		static_assert((offsetof(FuelLapEvaluator,ignoreLap)==0x40),"bad off");
	};
};

//UDT: struct TrackAvatar::SectorDescription @len=40
	//_Data: this+0x0, Member, Type: float, in
	//_Data: this+0x4, Member, Type: float, out
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, text
	//_Func: public void SectorDescription(const TrackAvatar_SectorDescription &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void SectorDescription(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~SectorDescription(); @loc=static @len=49 @rva=2180672
	//_Func: public TrackAvatar_SectorDescription & operator=(const TrackAvatar_SectorDescription &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct TrackAvatar_SectorDescription {
public:
	float in;
	float out;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > text;
	inline TrackAvatar_SectorDescription() { }
	inline TrackAvatar_SectorDescription(const TrackAvatar_SectorDescription& other) = default;
	inline TrackAvatar_SectorDescription& operator=(const TrackAvatar_SectorDescription& other) = default;
	inline void dtor() { typedef void (TrackAvatar_SectorDescription::*_fpt)(); auto _f=xcast<_fpt>(_drva(2180672)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(TrackAvatar_SectorDescription)==40),"bad size");
		static_assert((offsetof(TrackAvatar_SectorDescription,in)==0x0),"bad off");
		static_assert((offsetof(TrackAvatar_SectorDescription,out)==0x4),"bad off");
		static_assert((offsetof(TrackAvatar_SectorDescription,text)==0x8),"bad off");
	};
};

//UDT: struct AIState @len=60
	//_Func: public void AIState(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, currentSteerSignal
	//_Data: this+0x4, Member, Type: class vec3f, steerTarget
	//_Data: this+0x10, Member, Type: float, gasBrakeTarget
	//_Data: this+0x14, Member, Type: bool, isActive
	//_Data: this+0x18, Member, Type: float, targetSpeed
	//_Data: this+0x1C, Member, Type: float, targetLateralOffset
	//_Data: this+0x20, Member, Type: float, brakeTargetSpeed
	//_Data: this+0x24, Member, Type: float, brakeTargetDist
	//_Data: this+0x28, Member, Type: float, currentNormalizedSplinePosition
	//_Data: this+0x2C, Member, Type: float, outsideOffset
	//_Data: this+0x30, Member, Type: float, projDNRPM
	//_Data: this+0x34, Member, Type: float, understeerFactor
	//_Data: this+0x38, Member, Type: float, currentPush
//UDT;

struct AIState {
public:
	float currentSteerSignal;
	vec3f steerTarget;
	float gasBrakeTarget;
	bool isActive;
	float targetSpeed;
	float targetLateralOffset;
	float brakeTargetSpeed;
	float brakeTargetDist;
	float currentNormalizedSplinePosition;
	float outsideOffset;
	float projDNRPM;
	float understeerFactor;
	float currentPush;
	inline AIState() { }
	inline AIState(const AIState& other) = default;
	inline AIState& operator=(const AIState& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(AIState)==60),"bad size");
		static_assert((offsetof(AIState,currentSteerSignal)==0x0),"bad off");
		static_assert((offsetof(AIState,steerTarget)==0x4),"bad off");
		static_assert((offsetof(AIState,gasBrakeTarget)==0x10),"bad off");
		static_assert((offsetof(AIState,isActive)==0x14),"bad off");
		static_assert((offsetof(AIState,targetSpeed)==0x18),"bad off");
		static_assert((offsetof(AIState,targetLateralOffset)==0x1C),"bad off");
		static_assert((offsetof(AIState,brakeTargetSpeed)==0x20),"bad off");
		static_assert((offsetof(AIState,brakeTargetDist)==0x24),"bad off");
		static_assert((offsetof(AIState,currentNormalizedSplinePosition)==0x28),"bad off");
		static_assert((offsetof(AIState,outsideOffset)==0x2C),"bad off");
		static_assert((offsetof(AIState,projDNRPM)==0x30),"bad off");
		static_assert((offsetof(AIState,understeerFactor)==0x34),"bad off");
		static_assert((offsetof(AIState,currentPush)==0x38),"bad off");
	};
};

//UDT: struct OnTyreCompoundChanged @len=72
	//_Data: this+0x0, Member, Type: int, tyreIndex
	//_Data: this+0x4, Member, Type: int, compoundIndex
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, compoundName
	//_Data: this+0x28, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, shortName
	//_Func: public void OnTyreCompoundChanged(const OnTyreCompoundChanged &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void OnTyreCompoundChanged(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~OnTyreCompoundChanged(); @loc=static @len=90 @rva=847584
	//_Func: public OnTyreCompoundChanged & operator=(const OnTyreCompoundChanged &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct OnTyreCompoundChanged {
public:
	int tyreIndex;
	int compoundIndex;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > compoundName;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > shortName;
	inline OnTyreCompoundChanged() { }
	inline OnTyreCompoundChanged(const OnTyreCompoundChanged& other) = default;
	inline OnTyreCompoundChanged& operator=(const OnTyreCompoundChanged& other) = default;
	inline void dtor() { typedef void (OnTyreCompoundChanged::*_fpt)(); auto _f=xcast<_fpt>(_drva(847584)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(OnTyreCompoundChanged)==72),"bad size");
		static_assert((offsetof(OnTyreCompoundChanged,tyreIndex)==0x0),"bad off");
		static_assert((offsetof(OnTyreCompoundChanged,compoundIndex)==0x4),"bad off");
		static_assert((offsetof(OnTyreCompoundChanged,compoundName)==0x8),"bad off");
		static_assert((offsetof(OnTyreCompoundChanged,shortName)==0x28),"bad off");
	};
};

//UDT: class ShaderResource @len=48 @vfcount=1
	//_VTable: 
	//_Func: public void ShaderResource(const ShaderResource &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ShaderResource(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * iname, int islot); @loc=static @len=166 @rva=2282272
	//_Func: public void ~ShaderResource(); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Data: this+0x28, Member, Type: int, slot
	//_Func: public ShaderResource & operator=(const ShaderResource &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class ShaderResource {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	int slot;
	inline ShaderResource() { }
	inline ShaderResource(const ShaderResource& other) = default;
	inline ShaderResource& operator=(const ShaderResource& other) = default;
	inline void ctor(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * iname, int islot) { typedef void (ShaderResource::*_fpt)(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > *, int); auto _f=xcast<_fpt>(_drva(2282272)); (this->*_f)(iname, islot); }
	virtual ~ShaderResource();
	inline void _guard_obj() {
		static_assert((sizeof(ShaderResource)==48),"bad size");
		static_assert((offsetof(ShaderResource,name)==0x8),"bad off");
		static_assert((offsetof(ShaderResource,slot)==0x28),"bad off");
	};
};

//UDT: struct SDWSuspensionData @len=124
	//_Data: this+0x0, Member, Type: class vec3f, carTopWB_F
	//_Data: this+0xC, Member, Type: class vec3f, carTopWB_R
	//_Data: this+0x18, Member, Type: class vec3f, carBottomWB_F
	//_Data: this+0x24, Member, Type: class vec3f, carBottomWB_R
	//_Data: this+0x30, Member, Type: class vec3f, tyreTopWB
	//_Data: this+0x3C, Member, Type: class vec3f, tyreBottomWB
	//_Data: this+0x48, Member, Type: class vec3f, carSteer
	//_Data: this+0x54, Member, Type: class vec3f, tyreSteer
	//_Data: this+0x60, Member, Type: class vec3f, refPoint
	//_Data: this+0x6C, Member, Type: float, hubMass
	//_Data: this+0x70, Member, Type: class vec3f, hubInertiaBox
	//_Func: public void SDWSuspensionData(); @loc=optimized @len=0 @rva=0
//UDT;

struct SDWSuspensionData {
public:
	vec3f carTopWB_F;
	vec3f carTopWB_R;
	vec3f carBottomWB_F;
	vec3f carBottomWB_R;
	vec3f tyreTopWB;
	vec3f tyreBottomWB;
	vec3f carSteer;
	vec3f tyreSteer;
	vec3f refPoint;
	float hubMass;
	vec3f hubInertiaBox;
	inline SDWSuspensionData() { }
	inline SDWSuspensionData(const SDWSuspensionData& other) = default;
	inline SDWSuspensionData& operator=(const SDWSuspensionData& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(SDWSuspensionData)==124),"bad size");
		static_assert((offsetof(SDWSuspensionData,carTopWB_F)==0x0),"bad off");
		static_assert((offsetof(SDWSuspensionData,carTopWB_R)==0xC),"bad off");
		static_assert((offsetof(SDWSuspensionData,carBottomWB_F)==0x18),"bad off");
		static_assert((offsetof(SDWSuspensionData,carBottomWB_R)==0x24),"bad off");
		static_assert((offsetof(SDWSuspensionData,tyreTopWB)==0x30),"bad off");
		static_assert((offsetof(SDWSuspensionData,tyreBottomWB)==0x3C),"bad off");
		static_assert((offsetof(SDWSuspensionData,carSteer)==0x48),"bad off");
		static_assert((offsetof(SDWSuspensionData,tyreSteer)==0x54),"bad off");
		static_assert((offsetof(SDWSuspensionData,refPoint)==0x60),"bad off");
		static_assert((offsetof(SDWSuspensionData,hubMass)==0x6C),"bad off");
		static_assert((offsetof(SDWSuspensionData,hubInertiaBox)==0x70),"bad off");
	};
};

//UDT: struct MLBall @len=24
	//_Data: this+0x0, Member, Type: class vec3f, relToTyre
	//_Data: this+0xC, Member, Type: class vec3f, relToCar
	//_Func: public void MLBall(); @loc=optimized @len=0 @rva=0
//UDT;

struct MLBall {
public:
	vec3f relToTyre;
	vec3f relToCar;
	inline MLBall() { }
	inline MLBall(const MLBall& other) = default;
	inline MLBall& operator=(const MLBall& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(MLBall)==24),"bad size");
		static_assert((offsetof(MLBall,relToTyre)==0x0),"bad off");
		static_assert((offsetof(MLBall,relToCar)==0xC),"bad off");
	};
};

//UDT: struct NetCarState @len=136
	//_Func: public void NetCarState(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class vec3f, pos
	//_Data: this+0xC, Member, Type: class vec3f, rotation
	//_Data: this+0x18, Member, Type: class vec3f, velocity
	//_Data: this+0x24, Member, Type: class vec3f, acceleration
	//_Data: this+0x30, Member, Type: double, timeStamp
	//_Data: this+0x38, Member, Type: double, rcvTime
	//_Data: this+0x40, Member, Type: unsigned char, pakSequenceId
	//_Data: this+0x44, Member, Type: float, targetHeight
	//_Data: this+0x48, Member, Type: float[0x4], tyreAngularSpeed
	//_Data: this+0x58, Member, Type: unsigned short, engineRPM
	//_Data: this+0x5C, Member, Type: float, steerAngle
	//_Data: this+0x60, Member, Type: float, wheelAngle
	//_Data: this+0x64, Member, Type: int, gearIndex
	//_Data: this+0x68, Member, Type: unsigned int, statusBytes
	//_Data: this+0x6C, Member, Type: float, aoa
	//_Data: this+0x70, Member, Type: class vec3f, aoaAxis
	//_Data: this+0x7C, Member, Type: int, ping
	//_Data: this+0x80, Member, Type: float, performanceDelta
	//_Data: this+0x84, Member, Type: float, gas
//UDT;

struct NetCarState {
public:
	vec3f pos;
	vec3f rotation;
	vec3f velocity;
	vec3f acceleration;
	double timeStamp;
	double rcvTime;
	unsigned char pakSequenceId;
	float targetHeight;
	float tyreAngularSpeed[4];
	unsigned short engineRPM;
	float steerAngle;
	float wheelAngle;
	int gearIndex;
	unsigned int statusBytes;
	float aoa;
	vec3f aoaAxis;
	int ping;
	float performanceDelta;
	float gas;
	inline NetCarState() { }
	inline NetCarState(const NetCarState& other) = default;
	inline NetCarState& operator=(const NetCarState& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(NetCarState)==136),"bad size");
		static_assert((offsetof(NetCarState,pos)==0x0),"bad off");
		static_assert((offsetof(NetCarState,rotation)==0xC),"bad off");
		static_assert((offsetof(NetCarState,velocity)==0x18),"bad off");
		static_assert((offsetof(NetCarState,acceleration)==0x24),"bad off");
		static_assert((offsetof(NetCarState,timeStamp)==0x30),"bad off");
		static_assert((offsetof(NetCarState,rcvTime)==0x38),"bad off");
		static_assert((offsetof(NetCarState,pakSequenceId)==0x40),"bad off");
		static_assert((offsetof(NetCarState,targetHeight)==0x44),"bad off");
		static_assert((offsetof(NetCarState,tyreAngularSpeed)==0x48),"bad off");
		static_assert((offsetof(NetCarState,engineRPM)==0x58),"bad off");
		static_assert((offsetof(NetCarState,steerAngle)==0x5C),"bad off");
		static_assert((offsetof(NetCarState,wheelAngle)==0x60),"bad off");
		static_assert((offsetof(NetCarState,gearIndex)==0x64),"bad off");
		static_assert((offsetof(NetCarState,statusBytes)==0x68),"bad off");
		static_assert((offsetof(NetCarState,aoa)==0x6C),"bad off");
		static_assert((offsetof(NetCarState,aoaAxis)==0x70),"bad off");
		static_assert((offsetof(NetCarState,ping)==0x7C),"bad off");
		static_assert((offsetof(NetCarState,performanceDelta)==0x80),"bad off");
		static_assert((offsetof(NetCarState,gas)==0x84),"bad off");
	};
};

//UDT: struct LightingSettings @len=180
	//_Func: public void LightingSettings(); @loc=static @len=323 @rva=2104736
	//_Data: this+0x0, Member, Type: class vec3f, lightDirection
	//_Data: this+0xC, Member, Type: class vec3f, lightColor
	//_Data: this+0x18, Member, Type: class vec3f, horizonLow
	//_Data: this+0x24, Member, Type: class vec3f, horizonHigh
	//_Data: this+0x30, Member, Type: class vec3f, skyLow
	//_Data: this+0x3C, Member, Type: class vec3f, skyHigh
	//_Data: this+0x48, Member, Type: class vec3f, sunLow
	//_Data: this+0x54, Member, Type: class vec3f, sunHigh
	//_Data: this+0x60, Member, Type: float, angle
	//_Data: this+0x64, Member, Type: float, headingAngle
	//_Data: this+0x68, Member, Type: float, pitchAngle
	//_Data: this+0x6C, Member, Type: class vec3f, ambientLow
	//_Data: this+0x78, Member, Type: class vec3f, ambientHigh
	//_Data: this+0x84, Member, Type: class vec3f, fogColor
	//_Data: this+0x90, Member, Type: float, fogLinear
	//_Data: this+0x94, Member, Type: float, fogBlend
	//_Data: this+0x98, Member, Type: float, cloudCover
	//_Data: this+0x9C, Member, Type: float, cloudCutoff
	//_Data: this+0xA0, Member, Type: float, cloudColor
	//_Data: this+0xA4, Member, Type: float, cloudOffset
	//_Data: this+0xA8, Member, Type: float, saturation
	//_Data: this+0xAC, Member, Type: float, gameTime
	//_Data: this+0xB0, Member, Type: float, sunAngleGamma
//UDT;

struct LightingSettings {
public:
	vec3f lightDirection;
	vec3f lightColor;
	vec3f horizonLow;
	vec3f horizonHigh;
	vec3f skyLow;
	vec3f skyHigh;
	vec3f sunLow;
	vec3f sunHigh;
	float angle;
	float headingAngle;
	float pitchAngle;
	vec3f ambientLow;
	vec3f ambientHigh;
	vec3f fogColor;
	float fogLinear;
	float fogBlend;
	float cloudCover;
	float cloudCutoff;
	float cloudColor;
	float cloudOffset;
	float saturation;
	float gameTime;
	float sunAngleGamma;
	inline LightingSettings() { }
	inline LightingSettings(const LightingSettings& other) = default;
	inline LightingSettings& operator=(const LightingSettings& other) = default;
	inline void ctor() { typedef void (LightingSettings::*_fpt)(); auto _f=xcast<_fpt>(_drva(2104736)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(LightingSettings)==180),"bad size");
		static_assert((offsetof(LightingSettings,lightDirection)==0x0),"bad off");
		static_assert((offsetof(LightingSettings,lightColor)==0xC),"bad off");
		static_assert((offsetof(LightingSettings,horizonLow)==0x18),"bad off");
		static_assert((offsetof(LightingSettings,horizonHigh)==0x24),"bad off");
		static_assert((offsetof(LightingSettings,skyLow)==0x30),"bad off");
		static_assert((offsetof(LightingSettings,skyHigh)==0x3C),"bad off");
		static_assert((offsetof(LightingSettings,sunLow)==0x48),"bad off");
		static_assert((offsetof(LightingSettings,sunHigh)==0x54),"bad off");
		static_assert((offsetof(LightingSettings,angle)==0x60),"bad off");
		static_assert((offsetof(LightingSettings,headingAngle)==0x64),"bad off");
		static_assert((offsetof(LightingSettings,pitchAngle)==0x68),"bad off");
		static_assert((offsetof(LightingSettings,ambientLow)==0x6C),"bad off");
		static_assert((offsetof(LightingSettings,ambientHigh)==0x78),"bad off");
		static_assert((offsetof(LightingSettings,fogColor)==0x84),"bad off");
		static_assert((offsetof(LightingSettings,fogLinear)==0x90),"bad off");
		static_assert((offsetof(LightingSettings,fogBlend)==0x94),"bad off");
		static_assert((offsetof(LightingSettings,cloudCover)==0x98),"bad off");
		static_assert((offsetof(LightingSettings,cloudCutoff)==0x9C),"bad off");
		static_assert((offsetof(LightingSettings,cloudColor)==0xA0),"bad off");
		static_assert((offsetof(LightingSettings,cloudOffset)==0xA4),"bad off");
		static_assert((offsetof(LightingSettings,saturation)==0xA8),"bad off");
		static_assert((offsetof(LightingSettings,gameTime)==0xAC),"bad off");
		static_assert((offsetof(LightingSettings,sunAngleGamma)==0xB0),"bad off");
	};
};

//UDT: struct OnGearRequestEvent @len=8
	//_Func: public void OnGearRequestEvent(GearChangeRequest  _arg0, int  _arg1); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: enum GearChangeRequest, request
	//_Data: this+0x4, Member, Type: int, nextGear
//UDT;

struct OnGearRequestEvent {
public:
	GearChangeRequest request;
	int nextGear;
	inline OnGearRequestEvent() { }
	inline OnGearRequestEvent(const OnGearRequestEvent& other) = default;
	inline OnGearRequestEvent& operator=(const OnGearRequestEvent& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(OnGearRequestEvent)==8),"bad size");
		static_assert((offsetof(OnGearRequestEvent,request)==0x0),"bad off");
		static_assert((offsetof(OnGearRequestEvent,nextGear)==0x4),"bad off");
	};
};

//UDT: class IndexBuffer @len=16 @vfcount=1
	//_VTable: 
	//_Func: public void IndexBuffer(const IndexBuffer &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void IndexBuffer(std::vector<unsigned short,std::allocator<unsigned short> > & indices); @loc=static @len=64 @rva=2258768
	//_Func: public void ~IndexBuffer(); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
	//_Data: this+0x8, Member, Type: void *, kid
	//_Func: public IndexBuffer & operator=(const IndexBuffer &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class IndexBuffer {
public:
	void * kid;
	inline IndexBuffer() { }
	inline IndexBuffer(const IndexBuffer& other) = default;
	inline IndexBuffer& operator=(const IndexBuffer& other) = default;
	inline void ctor(std::vector<unsigned short,std::allocator<unsigned short> > & indices) { typedef void (IndexBuffer::*_fpt)(std::vector<unsigned short,std::allocator<unsigned short> > &); auto _f=xcast<_fpt>(_drva(2258768)); (this->*_f)(indices); }
	virtual ~IndexBuffer();
	inline void _guard_obj() {
		static_assert((sizeof(IndexBuffer)==16),"bad size");
		static_assert((offsetof(IndexBuffer,kid)==0x8),"bad off");
	};
};

//UDT: struct KGLShaderVar @len=80
	//_Data: this+0x0, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Data: this+0x20, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, cBufferName
	//_Data: this+0x40, Member, Type: unsigned int, cBufferSlot
	//_Data: this+0x44, Member, Type: unsigned int, size
	//_Data: this+0x48, Member, Type: unsigned int, offset
	//_Func: public void KGLShaderVar(const KGLShaderVar &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void KGLShaderVar(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~KGLShaderVar(); @loc=static @len=90 @rva=130576
	//_Func: public KGLShaderVar & operator=(const KGLShaderVar &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct KGLShaderVar {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > cBufferName;
	unsigned int cBufferSlot;
	unsigned int size;
	unsigned int offset;
	inline KGLShaderVar() { }
	inline KGLShaderVar(const KGLShaderVar& other) = default;
	inline KGLShaderVar& operator=(const KGLShaderVar& other) = default;
	inline void dtor() { typedef void (KGLShaderVar::*_fpt)(); auto _f=xcast<_fpt>(_drva(130576)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(KGLShaderVar)==80),"bad size");
		static_assert((offsetof(KGLShaderVar,name)==0x0),"bad off");
		static_assert((offsetof(KGLShaderVar,cBufferName)==0x20),"bad off");
		static_assert((offsetof(KGLShaderVar,cBufferSlot)==0x40),"bad off");
		static_assert((offsetof(KGLShaderVar,size)==0x44),"bad off");
		static_assert((offsetof(KGLShaderVar,offset)==0x48),"bad off");
	};
};

//UDT: struct KGLShaderTexture @len=40
	//_Data: this+0x0, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Data: this+0x20, Member, Type: int, slot
	//_Func: public void KGLShaderTexture(const KGLShaderTexture &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void KGLShaderTexture(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~KGLShaderTexture(); @loc=static @len=48 @rva=113184
	//_Func: public KGLShaderTexture & operator=(const KGLShaderTexture &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct KGLShaderTexture {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	int slot;
	inline KGLShaderTexture() { }
	inline KGLShaderTexture(const KGLShaderTexture& other) = default;
	inline KGLShaderTexture& operator=(const KGLShaderTexture& other) = default;
	inline void dtor() { typedef void (KGLShaderTexture::*_fpt)(); auto _f=xcast<_fpt>(_drva(113184)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(KGLShaderTexture)==40),"bad size");
		static_assert((offsetof(KGLShaderTexture,name)==0x0),"bad off");
		static_assert((offsetof(KGLShaderTexture,slot)==0x20),"bad off");
	};
};

//UDT: struct ksgui::OnCheckBoxChanged @len=16
	//_Data: this+0x0, Member, Type: class ksgui::CheckBox *, checkBox
	//_Data: this+0x8, Member, Type: bool, value
//UDT;

struct ksgui_OnCheckBoxChanged {
public:
	ksgui_CheckBox * checkBox;
	bool value;
	inline ksgui_OnCheckBoxChanged() { }
	inline ksgui_OnCheckBoxChanged(const ksgui_OnCheckBoxChanged& other) = default;
	inline ksgui_OnCheckBoxChanged& operator=(const ksgui_OnCheckBoxChanged& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_OnCheckBoxChanged)==16),"bad size");
		static_assert((offsetof(ksgui_OnCheckBoxChanged,checkBox)==0x0),"bad off");
		static_assert((offsetof(ksgui_OnCheckBoxChanged,value)==0x8),"bad off");
	};
};

//UDT: struct ksgui::OnSliderInteraction @len=16
	//_Data: this+0x0, Member, Type: class ksgui::Slider *, slider
	//_Data: this+0x8, Member, Type: float, value
//UDT;

struct ksgui_OnSliderInteraction {
public:
	ksgui_Slider * slider;
	float value;
	inline ksgui_OnSliderInteraction() { }
	inline ksgui_OnSliderInteraction(const ksgui_OnSliderInteraction& other) = default;
	inline ksgui_OnSliderInteraction& operator=(const ksgui_OnSliderInteraction& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_OnSliderInteraction)==16),"bad size");
		static_assert((offsetof(ksgui_OnSliderInteraction,slider)==0x0),"bad off");
		static_assert((offsetof(ksgui_OnSliderInteraction,value)==0x8),"bad off");
	};
};

//UDT: class SetupItem @len=136 @vfcount=1
	//_VTable: 
	//_Func: public void SetupItem(const SetupItem & __that); @loc=static @len=224 @rva=2657424
	//_Func: public void SetupItem(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * aname, float & aconnectedFloat, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * units, bool isAttached, float multiplier, float labelMult); @loc=static @len=303 @rva=2929008
	//_Func: public void ~SetupItem(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=164 @rva=2929312
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Data: this+0x28, Member, Type: float &, connectedFloat
	//_Data: this+0x30, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, units
	//_Data: this+0x50, Member, Type: float, multiplier
	//_Data: this+0x54, Member, Type: float, newValue
	//_Data: this+0x58, Member, Type: bool, attached
	//_Data: this+0x60, Member, Type: class std::function<void __cdecl(SetupItem *)>, onValueChanged
	//_Data: this+0x80, Member, Type: float, labelMultiplier
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class SetupItem {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	float & connectedFloat;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > units;
	float multiplier;
	float newValue;
	bool attached;
	std::function<void __cdecl(SetupItem *)> onValueChanged;
	float labelMultiplier;
	inline SetupItem() : connectedFloat(*((float*)NULL)) { }
	inline SetupItem(const SetupItem& other) = default;
	inline SetupItem& operator=(const SetupItem& other) = default;
	inline void ctor(const SetupItem & __that) { typedef void (SetupItem::*_fpt)(const SetupItem &); auto _f=xcast<_fpt>(_drva(2657424)); (this->*_f)(__that); }
	inline void ctor(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * aname, float & aconnectedFloat, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * units, bool isAttached, float multiplier, float labelMult) { typedef void (SetupItem::*_fpt)(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > *, float &, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > *, bool, float, float); auto _f=xcast<_fpt>(_drva(2929008)); (this->*_f)(aname, aconnectedFloat, units, isAttached, multiplier, labelMult); }
	virtual ~SetupItem();
	inline void dtor() { typedef void (SetupItem::*_fpt)(); auto _f=xcast<_fpt>(_drva(2929312)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(SetupItem)==136),"bad size");
		static_assert((offsetof(SetupItem,name)==0x8),"bad off");
		static_assert((offsetof(SetupItem,units)==0x30),"bad off");
		static_assert((offsetof(SetupItem,multiplier)==0x50),"bad off");
		static_assert((offsetof(SetupItem,newValue)==0x54),"bad off");
		static_assert((offsetof(SetupItem,attached)==0x58),"bad off");
		static_assert((offsetof(SetupItem,onValueChanged)==0x60),"bad off");
		static_assert((offsetof(SetupItem,labelMultiplier)==0x80),"bad off");
	};
};

//UDT: class IACPPluginHost @len=8 @vfcount=9
	//_VTable: 
	//_Func: public HWND__ * getHwnd(); @intro @pure @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
	//_Func: public HINSTANCE__ * getHInstance(); @intro @pure @virtual vtpo=0 vfid=1 @loc=optimized @len=0 @rva=0
	//_Func: public void setABS(float  _arg0); @intro @pure @virtual vtpo=0 vfid=2 @loc=optimized @len=0 @rva=0
	//_Func: public void setTC(float  _arg0); @intro @pure @virtual vtpo=0 vfid=3 @loc=optimized @len=0 @rva=0
	//_Func: public void setStabilityControl(float  _arg0); @intro @pure @virtual vtpo=0 vfid=4 @loc=optimized @len=0 @rva=0
	//_Func: public void setIdealLine(bool  _arg0, bool  _arg1); @intro @pure @virtual vtpo=0 vfid=5 @loc=optimized @len=0 @rva=0
	//_Func: public void setAutoShift(bool  _arg0); @intro @pure @virtual vtpo=0 vfid=6 @loc=optimized @len=0 @rva=0
	//_Func: public void setBrakeBias(float  _arg0); @intro @pure @virtual vtpo=0 vfid=7 @loc=optimized @len=0 @rva=0
	//_Func: public void setSystemMessage(const wchar_t *  _arg0, const wchar_t *  _arg1, bool  _arg2); @intro @pure @virtual vtpo=0 vfid=8 @loc=optimized @len=0 @rva=0
	//_Func: public void IACPPluginHost(const IACPPluginHost &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void IACPPluginHost(); @loc=optimized @len=0 @rva=0
	//_Func: public IACPPluginHost & operator=(const IACPPluginHost &  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class IACPPluginHost {
public:
	inline IACPPluginHost() { }
	inline IACPPluginHost(const IACPPluginHost& other) = default;
	inline IACPPluginHost& operator=(const IACPPluginHost& other) = default;
	virtual HWND__ * getHwnd_vf0() = 0;
	inline HWND__ * getHwnd() { typedef HWND__ * (IACPPluginHost::*_fpt)(); auto _f=xcast<_fpt>(get_vfp(this, 0)); return (this->*_f)(); }
	virtual HINSTANCE__ * getHInstance_vf1() = 0;
	inline HINSTANCE__ * getHInstance() { typedef HINSTANCE__ * (IACPPluginHost::*_fpt)(); auto _f=xcast<_fpt>(get_vfp(this, 1)); return (this->*_f)(); }
	virtual void setABS_vf2(float  _arg0) = 0;
	inline void setABS(float  _arg0) { typedef void (IACPPluginHost::*_fpt)(float); auto _f=xcast<_fpt>(get_vfp(this, 2)); return (this->*_f)( _arg0); }
	virtual void setTC_vf3(float  _arg0) = 0;
	inline void setTC(float  _arg0) { typedef void (IACPPluginHost::*_fpt)(float); auto _f=xcast<_fpt>(get_vfp(this, 3)); return (this->*_f)( _arg0); }
	virtual void setStabilityControl_vf4(float  _arg0) = 0;
	inline void setStabilityControl(float  _arg0) { typedef void (IACPPluginHost::*_fpt)(float); auto _f=xcast<_fpt>(get_vfp(this, 4)); return (this->*_f)( _arg0); }
	virtual void setIdealLine_vf5(bool  _arg0, bool  _arg1) = 0;
	inline void setIdealLine(bool  _arg0, bool  _arg1) { typedef void (IACPPluginHost::*_fpt)(bool, bool); auto _f=xcast<_fpt>(get_vfp(this, 5)); return (this->*_f)( _arg0,  _arg1); }
	virtual void setAutoShift_vf6(bool  _arg0) = 0;
	inline void setAutoShift(bool  _arg0) { typedef void (IACPPluginHost::*_fpt)(bool); auto _f=xcast<_fpt>(get_vfp(this, 6)); return (this->*_f)( _arg0); }
	virtual void setBrakeBias_vf7(float  _arg0) = 0;
	inline void setBrakeBias(float  _arg0) { typedef void (IACPPluginHost::*_fpt)(float); auto _f=xcast<_fpt>(get_vfp(this, 7)); return (this->*_f)( _arg0); }
	virtual void setSystemMessage_vf8(const wchar_t *  _arg0, const wchar_t *  _arg1, bool  _arg2) = 0;
	inline void setSystemMessage(const wchar_t *  _arg0, const wchar_t *  _arg1, bool  _arg2) { typedef void (IACPPluginHost::*_fpt)(const wchar_t *, const wchar_t *, bool); auto _f=xcast<_fpt>(get_vfp(this, 8)); return (this->*_f)( _arg0,  _arg1,  _arg2); }
	inline void _guard_obj() {
		static_assert((sizeof(IACPPluginHost)==8),"bad size");
	};
};

//UDT: struct AxleBall @len=32
	//_Data: this+0x0, Member, Type: class vec3f, relToAxle
	//_Data: this+0xC, Member, Type: class vec3f, relToCar
	//_Data: this+0x18, Member, Type: class IJoint *, joint
	//_Func: public void AxleBall(); @loc=optimized @len=0 @rva=0
//UDT;

struct AxleBall {
public:
	vec3f relToAxle;
	vec3f relToCar;
	IJoint * joint;
	inline AxleBall() { }
	inline AxleBall(const AxleBall& other) = default;
	inline AxleBall& operator=(const AxleBall& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(AxleBall)==32),"bad size");
		static_assert((offsetof(AxleBall,relToAxle)==0x0),"bad off");
		static_assert((offsetof(AxleBall,relToCar)==0xC),"bad off");
		static_assert((offsetof(AxleBall,joint)==0x18),"bad off");
	};
};

//UDT: struct RayCastHit @len=40
	//_Func: public void RayCastHit(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class vec3f, pos
	//_Data: this+0xC, Member, Type: class vec3f, normal
	//_Data: this+0x18, Member, Type: class ICollisionObject *, collisionObject
	//_Data: this+0x20, Member, Type: bool, hasContact
//UDT;

struct RayCastHit {
public:
	vec3f pos;
	vec3f normal;
	ICollisionObject * collisionObject;
	bool hasContact;
	inline RayCastHit() { }
	inline RayCastHit(const RayCastHit& other) = default;
	inline RayCastHit& operator=(const RayCastHit& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(RayCastHit)==40),"bad size");
		static_assert((offsetof(RayCastHit,pos)==0x0),"bad off");
		static_assert((offsetof(RayCastHit,normal)==0xC),"bad off");
		static_assert((offsetof(RayCastHit,collisionObject)==0x18),"bad off");
		static_assert((offsetof(RayCastHit,hasContact)==0x20),"bad off");
	};
};

//UDT: struct OnCollisionEvent @len=40
	//_Data: this+0x0, Member, Type: class IRigidBody *, body
	//_Data: this+0x8, Member, Type: float, relativeSpeed
	//_Data: this+0xC, Member, Type: class vec3f, worldPos
	//_Data: this+0x18, Member, Type: class vec3f, relPos
	//_Data: this+0x24, Member, Type: unsigned long, colliderGroup
	//_Func: public void OnCollisionEvent(); @loc=optimized @len=0 @rva=0
//UDT;

struct OnCollisionEvent {
public:
	IRigidBody * body;
	float relativeSpeed;
	vec3f worldPos;
	vec3f relPos;
	unsigned long colliderGroup;
	inline OnCollisionEvent() { }
	inline OnCollisionEvent(const OnCollisionEvent& other) = default;
	inline OnCollisionEvent& operator=(const OnCollisionEvent& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(OnCollisionEvent)==40),"bad size");
		static_assert((offsetof(OnCollisionEvent,body)==0x0),"bad off");
		static_assert((offsetof(OnCollisionEvent,relativeSpeed)==0x8),"bad off");
		static_assert((offsetof(OnCollisionEvent,worldPos)==0xC),"bad off");
		static_assert((offsetof(OnCollisionEvent,relPos)==0x18),"bad off");
		static_assert((offsetof(OnCollisionEvent,colliderGroup)==0x24),"bad off");
	};
};

//UDT: struct MeshVertex @len=44
	//_Func: public void MeshVertex(const MeshVertex &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void MeshVertex(const vec3f &  _arg0, const vec3f &  _arg1, const vec2f &  _arg2); @loc=optimized @len=0 @rva=0
	//_Func: public void MeshVertex(const vec3f &  _arg0, const vec3f &  _arg1); @loc=optimized @len=0 @rva=0
	//_Func: public void MeshVertex(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class vec3f, pos
	//_Data: this+0xC, Member, Type: class vec3f, normal
	//_Data: this+0x18, Member, Type: class vec2f, texCoord
	//_Data: this+0x20, Member, Type: class vec3f, tangent
//UDT;

struct MeshVertex {
public:
	vec3f pos;
	vec3f normal;
	vec2f texCoord;
	vec3f tangent;
	inline MeshVertex() { }
	inline MeshVertex(const MeshVertex& other) = default;
	inline MeshVertex& operator=(const MeshVertex& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(MeshVertex)==44),"bad size");
		static_assert((offsetof(MeshVertex,pos)==0x0),"bad off");
		static_assert((offsetof(MeshVertex,normal)==0xC),"bad off");
		static_assert((offsetof(MeshVertex,texCoord)==0x18),"bad off");
		static_assert((offsetof(MeshVertex,tangent)==0x20),"bad off");
	};
};

//UDT: class CameraMouseControlBase @len=64 @vfcount=1
	//_VTable: 
	//_Func: public void CameraMouseControlBase(const CameraMouseControlBase &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void CameraMouseControlBase(Camera * camera); @loc=static @len=80 @rva=2161696
	//_Func: public void ~CameraMouseControlBase(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=11 @rva=2161776
	//_Data: this+0x8, Member, Type: const float, MOVE_SPEED
	//_Data: this+0xC, Member, Type: const float, MOVE_SPEED_SHIFT
	//_Data: this+0x10, Member, Type: const float, MOVE_SPEED_CTRL
	//_Data: this+0x14, Member, Type: float, mouseRotationSpeed
	//_Data: this+0x18, Member, Type: float, moveSpeed
	//_Data: this+0x1C, Member, Type: bool, isVertialStrafeActive
	//_Data: this+0x1D, Member, Type: bool, useRightButtonForMouseLook
	//_Data: this+0x20, Member, Type: float, moveSpeedShift
	//_Data: this+0x24, Member, Type: float, moveSpeedCtrl
	//_Func: public void update(float deltaT); @loc=static @len=51 @rva=2162480
	//_Func: public void resetMouseButtonState(); @loc=optimized @len=0 @rva=0
	//_Func: public void setSpeedSteps(float  _arg0, float  _arg1, float  _arg2); @loc=optimized @len=0 @rva=0
	//_Func: public Camera * getCamera(); @loc=static @len=5 @rva=2161840
	//_Data: this+0x28, Member, Type: class Camera *, target
	//_Data: this+0x30, Member, Type: struct std::pair<long,long>, lastMousePoint
	//_Data: this+0x38, Member, Type: bool, lastMouseDown
	//_Func: protected void stepKeyboard(float dt, float msp); @loc=static @len=302 @rva=2162176
	//_Func: protected void mouseLook(float dt, float speed); @loc=static @len=317 @rva=2161856
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class CameraMouseControlBase {
public:
	float MOVE_SPEED;
	float MOVE_SPEED_SHIFT;
	float MOVE_SPEED_CTRL;
	float mouseRotationSpeed;
	float moveSpeed;
	bool isVertialStrafeActive;
	bool useRightButtonForMouseLook;
	float moveSpeedShift;
	float moveSpeedCtrl;
	Camera * target;
	std::pair<long,long> lastMousePoint;
	bool lastMouseDown;
	inline CameraMouseControlBase() { }
	inline CameraMouseControlBase(const CameraMouseControlBase& other) = default;
	inline CameraMouseControlBase& operator=(const CameraMouseControlBase& other) = default;
	inline void ctor(Camera * camera) { typedef void (CameraMouseControlBase::*_fpt)(Camera *); auto _f=xcast<_fpt>(_drva(2161696)); (this->*_f)(camera); }
	virtual ~CameraMouseControlBase();
	inline void dtor() { typedef void (CameraMouseControlBase::*_fpt)(); auto _f=xcast<_fpt>(_drva(2161776)); (this->*_f)(); }
	inline void update(float deltaT) { typedef void (CameraMouseControlBase::*_fpt)(float); auto _f=xcast<_fpt>(_drva(2162480)); return (this->*_f)(deltaT); }
	inline Camera * getCamera() { typedef Camera * (CameraMouseControlBase::*_fpt)(); auto _f=xcast<_fpt>(_drva(2161840)); return (this->*_f)(); }
	inline void stepKeyboard(float dt, float msp) { typedef void (CameraMouseControlBase::*_fpt)(float, float); auto _f=xcast<_fpt>(_drva(2162176)); return (this->*_f)(dt, msp); }
	inline void mouseLook(float dt, float speed) { typedef void (CameraMouseControlBase::*_fpt)(float, float); auto _f=xcast<_fpt>(_drva(2161856)); return (this->*_f)(dt, speed); }
	inline void _guard_obj() {
		static_assert((sizeof(CameraMouseControlBase)==64),"bad size");
		static_assert((offsetof(CameraMouseControlBase,MOVE_SPEED)==0x8),"bad off");
		static_assert((offsetof(CameraMouseControlBase,MOVE_SPEED_SHIFT)==0xC),"bad off");
		static_assert((offsetof(CameraMouseControlBase,MOVE_SPEED_CTRL)==0x10),"bad off");
		static_assert((offsetof(CameraMouseControlBase,mouseRotationSpeed)==0x14),"bad off");
		static_assert((offsetof(CameraMouseControlBase,moveSpeed)==0x18),"bad off");
		static_assert((offsetof(CameraMouseControlBase,isVertialStrafeActive)==0x1C),"bad off");
		static_assert((offsetof(CameraMouseControlBase,useRightButtonForMouseLook)==0x1D),"bad off");
		static_assert((offsetof(CameraMouseControlBase,moveSpeedShift)==0x20),"bad off");
		static_assert((offsetof(CameraMouseControlBase,moveSpeedCtrl)==0x24),"bad off");
		static_assert((offsetof(CameraMouseControlBase,target)==0x28),"bad off");
		static_assert((offsetof(CameraMouseControlBase,lastMousePoint)==0x30),"bad off");
		static_assert((offsetof(CameraMouseControlBase,lastMouseDown)==0x38),"bad off");
	};
};

//UDT: struct DynamicTrackObject @len=56
	//_Data: this+0x0, Member, Type: class Node *, node
	//_Data: this+0x8, Member, Type: class vec3f, pos
	//_Data: this+0x14, Member, Type: class vec3f, pos_range
	//_Data: this+0x20, Member, Type: class vec3f, vel
	//_Data: this+0x2C, Member, Type: class vec3f, org_pos
	//_Func: public void DynamicTrackObject(); @loc=optimized @len=0 @rva=0
//UDT;

struct DynamicTrackObject {
public:
	Node * node;
	vec3f pos;
	vec3f pos_range;
	vec3f vel;
	vec3f org_pos;
	inline DynamicTrackObject() { }
	inline DynamicTrackObject(const DynamicTrackObject& other) = default;
	inline DynamicTrackObject& operator=(const DynamicTrackObject& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(DynamicTrackObject)==56),"bad size");
		static_assert((offsetof(DynamicTrackObject,node)==0x0),"bad off");
		static_assert((offsetof(DynamicTrackObject,pos)==0x8),"bad off");
		static_assert((offsetof(DynamicTrackObject,pos_range)==0x14),"bad off");
		static_assert((offsetof(DynamicTrackObject,vel)==0x20),"bad off");
		static_assert((offsetof(DynamicTrackObject,org_pos)==0x2C),"bad off");
	};
};

//UDT: struct TrackPhysicsStats @len=24
	//_Data: this+0x0, Member, Type: unsigned int, objects
	//_Data: this+0x4, Member, Type: unsigned int, tris
	//_Data: this+0x8, Member, Type: class std::map<int,int,std::less<int>,std::allocator<std::pair<int const ,int> > >, groups
	//_Func: public void TrackPhysicsStats(const TrackPhysicsStats &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void TrackPhysicsStats(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~TrackPhysicsStats(); @loc=static @len=46 @rva=1862144
	//_Func: public TrackPhysicsStats & operator=(const TrackPhysicsStats &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct TrackPhysicsStats {
public:
	unsigned int objects;
	unsigned int tris;
	std::map<int,int,std::less<int>,std::allocator<std::pair<int const ,int> > > groups;
	inline TrackPhysicsStats() { }
	inline TrackPhysicsStats(const TrackPhysicsStats& other) = default;
	inline TrackPhysicsStats& operator=(const TrackPhysicsStats& other) = default;
	inline void dtor() { typedef void (TrackPhysicsStats::*_fpt)(); auto _f=xcast<_fpt>(_drva(1862144)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(TrackPhysicsStats)==24),"bad size");
		static_assert((offsetof(TrackPhysicsStats,objects)==0x0),"bad off");
		static_assert((offsetof(TrackPhysicsStats,tris)==0x4),"bad off");
		static_assert((offsetof(TrackPhysicsStats,groups)==0x8),"bad off");
	};
};

//UDT: struct MaterialOption @len=48
	//_Func: public void MaterialOption(const MaterialOption &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void MaterialOption(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >  _arg0, IMaterialOptionChangeListener *  _arg1); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Func: public void setValue(bool  _arg0, bool  _arg1); @loc=optimized @len=0 @rva=0
	//_Func: public bool getValue(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x20, Member, Type: class IMaterialOptionChangeListener *, material
	//_Data: this+0x28, Member, Type: bool, value
	//_Func: public void ~MaterialOption(); @loc=optimized @len=0 @rva=0
	//_Func: public MaterialOption & operator=(const MaterialOption &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct MaterialOption {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	IMaterialOptionChangeListener * material;
	bool value;
	inline MaterialOption() { }
	inline MaterialOption(const MaterialOption& other) = default;
	inline MaterialOption& operator=(const MaterialOption& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(MaterialOption)==48),"bad size");
		static_assert((offsetof(MaterialOption,name)==0x0),"bad off");
		static_assert((offsetof(MaterialOption,material)==0x20),"bad off");
		static_assert((offsetof(MaterialOption,value)==0x28),"bad off");
	};
};

//UDT: struct ACPhysicsEvent @len=72
	//_Data: this+0x0, Member, Type: enum eACEventType, type
	//_Data: this+0x4, Member, Type: float, param1
	//_Data: this+0x8, Member, Type: float, param2
	//_Data: this+0xC, Member, Type: float, param3
	//_Data: this+0x10, Member, Type: float, param4
	//_Data: this+0x14, Member, Type: class vec3f, vParam1
	//_Data: this+0x20, Member, Type: class vec3f, vParam2
	//_Data: this+0x30, Member, Type: void *, voidParam0
	//_Data: this+0x38, Member, Type: void *, voidParam1
	//_Data: this+0x40, Member, Type: unsigned long, ulParam0
	//_Func: public void ACPhysicsEvent(); @loc=optimized @len=0 @rva=0
//UDT;

struct ACPhysicsEvent {
public:
	eACEventType type;
	float param1;
	float param2;
	float param3;
	float param4;
	vec3f vParam1;
	vec3f vParam2;
	void * voidParam0;
	void * voidParam1;
	unsigned long ulParam0;
	inline ACPhysicsEvent() { }
	inline ACPhysicsEvent(const ACPhysicsEvent& other) = default;
	inline ACPhysicsEvent& operator=(const ACPhysicsEvent& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ACPhysicsEvent)==72),"bad size");
		static_assert((offsetof(ACPhysicsEvent,type)==0x0),"bad off");
		static_assert((offsetof(ACPhysicsEvent,param1)==0x4),"bad off");
		static_assert((offsetof(ACPhysicsEvent,param2)==0x8),"bad off");
		static_assert((offsetof(ACPhysicsEvent,param3)==0xC),"bad off");
		static_assert((offsetof(ACPhysicsEvent,param4)==0x10),"bad off");
		static_assert((offsetof(ACPhysicsEvent,vParam1)==0x14),"bad off");
		static_assert((offsetof(ACPhysicsEvent,vParam2)==0x20),"bad off");
		static_assert((offsetof(ACPhysicsEvent,voidParam0)==0x30),"bad off");
		static_assert((offsetof(ACPhysicsEvent,voidParam1)==0x38),"bad off");
		static_assert((offsetof(ACPhysicsEvent,ulParam0)==0x40),"bad off");
	};
};

//UDT: struct Lap @len=72
	//_Func: public void Lap(const Lap & __that); @loc=static @len=113 @rva=242400
	//_Func: public void Lap(int  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void Lap(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: unsigned int, time
	//_Data: this+0x8, Member, Type: class std::vector<unsigned int,std::allocator<unsigned int> >, splits
	//_Data: this+0x20, Member, Type: unsigned int, cuts
	//_Data: this+0x24, Member, Type: bool, isValid
	//_Data: this+0x28, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, compound
	//_Func: public void ~Lap(); @loc=static @len=95 @rva=246624
	//_Func: public Lap & operator=(const Lap &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct Lap {
public:
	unsigned int time;
	std::vector<unsigned int,std::allocator<unsigned int> > splits;
	unsigned int cuts;
	bool isValid;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > compound;
	inline Lap() { }
	inline Lap(const Lap& other) = default;
	inline Lap& operator=(const Lap& other) = default;
	inline void ctor(const Lap & __that) { typedef void (Lap::*_fpt)(const Lap &); auto _f=xcast<_fpt>(_drva(242400)); (this->*_f)(__that); }
	inline void dtor() { typedef void (Lap::*_fpt)(); auto _f=xcast<_fpt>(_drva(246624)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(Lap)==72),"bad size");
		static_assert((offsetof(Lap,time)==0x0),"bad off");
		static_assert((offsetof(Lap,splits)==0x8),"bad off");
		static_assert((offsetof(Lap,cuts)==0x20),"bad off");
		static_assert((offsetof(Lap,isValid)==0x24),"bad off");
		static_assert((offsetof(Lap,compound)==0x28),"bad off");
	};
};

//UDT: struct ksgui::OnListBoxItemClickedEvent @len=24
	//_Data: this+0x0, Member, Type: class ksgui::ListBox *, listBox
	//_Data: this+0x8, Member, Type: struct ksgui::ListBoxRowData *, row
	//_Data: this+0x10, Member, Type: unsigned int, itemIndex
//UDT;

struct ksgui_OnListBoxItemClickedEvent {
public:
	ksgui_ListBox * listBox;
	ksgui_ListBoxRowData * row;
	unsigned int itemIndex;
	inline ksgui_OnListBoxItemClickedEvent() { }
	inline ksgui_OnListBoxItemClickedEvent(const ksgui_OnListBoxItemClickedEvent& other) = default;
	inline ksgui_OnListBoxItemClickedEvent& operator=(const ksgui_OnListBoxItemClickedEvent& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_OnListBoxItemClickedEvent)==24),"bad size");
		static_assert((offsetof(ksgui_OnListBoxItemClickedEvent,listBox)==0x0),"bad off");
		static_assert((offsetof(ksgui_OnListBoxItemClickedEvent,row)==0x8),"bad off");
		static_assert((offsetof(ksgui_OnListBoxItemClickedEvent,itemIndex)==0x10),"bad off");
	};
};

//UDT: struct INISection @len=16
	//_Data: this+0x0, Member, Type: class std::map<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,std::less<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > >,std::allocator<std::pair<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > const ,std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > > > >, keys
	//_Func: public bool hasKey(const std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & k); @loc=static @len=105 @rva=2322496
	//_Func: public void INISection(const INISection &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void INISection(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~INISection(); @loc=static @len=41 @rva=4512704
	//_Func: public INISection & operator=(const INISection &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct INISection {
public:
	std::map<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,std::less<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > >,std::allocator<std::pair<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > const ,std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > > > > keys;
	inline INISection() { }
	inline INISection(const INISection& other) = default;
	inline INISection& operator=(const INISection& other) = default;
	inline bool hasKey(const std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & k) { typedef bool (INISection::*_fpt)(const std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &); auto _f=xcast<_fpt>(_drva(2322496)); return (this->*_f)(k); }
	inline void dtor() { typedef void (INISection::*_fpt)(); auto _f=xcast<_fpt>(_drva(4512704)); (this->*_f)(); }
	inline void _guard_obj() {
		static_assert((sizeof(INISection)==16),"bad size");
		static_assert((offsetof(INISection,keys)==0x0),"bad off");
	};
};

//UDT: struct PersistanceCameraModeDef @len=8
	//_Func: public void PersistanceCameraModeDef(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: enum CameraMode, lastCameraMode
	//_Data: this+0x4, Member, Type: enum DrivableCamera, lastDrivableCameraMode
//UDT;

struct PersistanceCameraModeDef {
public:
	CameraMode lastCameraMode;
	DrivableCamera lastDrivableCameraMode;
	inline PersistanceCameraModeDef() { }
	inline PersistanceCameraModeDef(const PersistanceCameraModeDef& other) = default;
	inline PersistanceCameraModeDef& operator=(const PersistanceCameraModeDef& other) = default;
	inline void _guard_obj() {
		static_assert((sizeof(PersistanceCameraModeDef)==8),"bad size");
		static_assert((offsetof(PersistanceCameraModeDef,lastCameraMode)==0x0),"bad off");
		static_assert((offsetof(PersistanceCameraModeDef,lastDrivableCameraMode)==0x4),"bad off");
	};
};

//UDT: class IPAddress @len=16
	//_Func: public void IPAddress(); @loc=static @len=13 @rva=508768
	//_Func: public void IPAddress(const IPAddress &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void IPAddress(const sockaddr_in & addr); @loc=static @len=10 @rva=2479584
