// ### AUTO-GENERATED ###

enum class eReplayStatus {
	eReplayPlay = 0x0,
	eReplayPause = 0x1,
	eReplayStop = 0x2,
	eReplayRewind = 0x3,
	eReplayFastForward = 0x4,
	eReplaySlowMotion = 0x5,
	eReplayModeEnter = 0x6,
	eReplayModeExit = 0x7,
	eReplayChangeCar = 0x8,
	eReplayClearing = 0x9,
	eReplaySliderInteraction = 0xA,
	ePhotoMode = 0xB,
	eSingleFrame = 0xC,
};

enum class DriverActions {
	eLookingLeft = 0x0,
	eLookingRight = 0x1,
	eDeprecated_2 = 0x2,
	eDeprecated_1 = 0x3,
	eHeadlightsSwitch = 0x4,
	eChangingCamera = 0x5,
	eHorn = 0x6,
	eShiftingUp = 0x7,
	eShiftingDown = 0x8,
	eLookingBack = 0x9,
	eHeadlightsFlash = 0xA,
	eTcUp = 0xB,
	eTcDown = 0xC,
	eAbsUp = 0xD,
	eAbsDown = 0xE,
	eTurboUp = 0xF,
	eTurboDown = 0x10,
	eBrakeBiasUp = 0x11,
	eBrakeBiasDown = 0x12,
	eDRS = 0x13,
	eKERS = 0x14,
	eEngineBrakeUp = 0x15,
	eEngineBrakeDown = 0x16,
	eMGUKDeliveryUp = 0x17,
	eMGUKDeliveryDown = 0x18,
	eMGUKRecoveryUp = 0x19,
	eMGUKRecoveryDown = 0x1A,
	eMGUHMode = 0x1B,
};

enum class eTimeLineCheckResponse {
	eOutOfRange = 0x0,
	eNegativeSide = 0x1,
	ePositiveSide = 0x2,
};

enum class SessionType {
	Undefined = 0x0,
	Pratice = 0x1,
	Qualify = 0x2,
	Race = 0x3,
	Hotlap = 0x4,
	TimeAttack = 0x5,
	Drift = 0x6,
	Drag = 0x7,
};

enum class DifferentialType {
	LSD = 0x0,
	Spool = 0x1,
};

enum class VoteType {
	eVoteNextSession = 0x0,
	eVoteRestartSession = 0x1,
	eVoteKickUser = 0x2,
	eVoteUnkonw = 0x3,
};

enum class PenaltyDescription {
	eNothing = 0x0,
	eJumpStart = 0x1,
	eCantPitPenalty = 0x2,
	eMandatoryPit = 0x3,
	eCut = 0x4,
};

enum class GearChangeRequest {
	eNoGearRequest = 0x0,
	eChangeUp = 0x1,
	eChangeDown = 0x2,
	eChangeToGear = 0x3,
};

enum class JumpStartPenaltyMode {
	eLockOnGridMode = 0x0,
	eTeleportToPitMode = 0x1,
	eDriveThroughMode = 0x2,
};

enum class MouseButton {
	Unknown = 0xFF,
	Left = 0x0,
	Middle = 0x1,
	Right = 0x2,
};

enum class TelemetryUnits {
	eUnitMeters = 0x0,
	eUnitC = 0x1,
	eUnitG = 0x2,
	eUnitRadSec = 0x3,
	eUnitGeneric = 0x4,
	eUnitMeterSec = 0x5,
	eUnitBar = 0x6,
	eUnitMS = 0x7,
	eUnitNumber = 0x8,
	eUnitPercentage = 0x9,
	eUnitPowerWatt = 0xA,
	eUnitVolumeMQ = 0xB,
	eUnitVoltageV = 0xC,
	eUnitTorqueNM = 0xD,
	eUnitRad = 0xE,
	eUnitForceN = 0xF,
	eUnitMillimiters = 0x10,
	eUnitDeg = 0x11,
	eUnitForceKG = 0x12,
	eUnitRPM = 0x13,
};

enum class DRWWingConnectionMode {
	UseEffect = 0x0,
	UseAngle = 0x1,
};

enum class PenaltyType {
	eNothing = 0x0,
	eSecsOnResult5 = 0x1,
	eSecsOnResult10 = 0x2,
	eSecsOnResult20 = 0x3,
	eSecsOnResult30 = 0x4,
	eDriveThrough = 0x5,
	eStopAndGo = 0x6,
};

enum class eRenderTargetFormat {
	eOriginalTarget = 0x0,
	eR8G8B8A8 = 0x1,
	eR16G16B16A16 = 0x2,
	eR32F = 0x3,
	eR32Typeless = 0x4,
	eR32Typeless_MS = 0x5,
	eR16F = 0x6,
	eR16G16B16A16_MS = 0x7,
	eR8G8B8A8_MS = 0x8,
};

enum class FlagEventType {
	BlackFlag = 0x0,
	BlackFlagClear = 0x1,
};

enum class eACEventType {
	acEvent_OnCollision = 0x0,
};

enum class PixelFormat {
	eUnknownFormat = 0x0,
	eRGBA8 = 0x1,
	eRGBA32 = 0x2,
	eBC3Unorm = 0x3,
};

enum class OpenTrackTimeState {
	NotStarted = 0x0,
	Started = 0x1,
};

enum class CarSetupState {
	UnKnown = 0x0,
	Legal = 0x1,
	Illegal = 0x2,
};

enum class DynamicControllerInput {
	UndefinedInput = 0x0,
	Brake = 0x1,
	Gas = 0x2,
	LatG = 0x3,
	LonG = 0x4,
	Steer = 0x5,
	Speed = 0x6,
	Gear = 0x7,
	SlipRatioMAX = 0x8,
	SlipRatioAVG = 0x9,
	SlipAngleFrontAVG = 0xA,
	SlipAngleRearAVG = 0xB,
	SlipAngleFrontMAX = 0xC,
	SlipAngleRearMAX = 0xD,
	OversteerFactor = 0xE,
	RearSpeedRatio = 0xF,
	SteerDEG = 0x10,
	Const = 0x11,
	RPMS = 0x12,
	WheelSteerDEG = 0x13,
	LoadSpreadLF = 0x14,
	LoadSpreadRF = 0x15,
	AvgTravelRear = 0x16,
	SusTravelLR = 0x17,
	SusTravelRR = 0x18,
};

enum class DynamicControllerCombinatorMode {
	eUndefinedMode = 0x0,
	eAdd = 0x1,
	eMult = 0x2,
};

enum class eFontType {
	eFontProportional = 0x0,
	eFontMonospaced = 0x1,
	eFontCustom = 0x2,
};

enum class eFontAlign {
	eAlignLeft = 0x0,
	eAlignRight = 0x1,
	eAlignCenter = 0x2,
};

enum class CullMode {
	eCullFront = 0x0,
	eCullBack = 0x1,
	eCullNone = 0x2,
	eCullBiased = 0x3,
	eCullWireFrame = 0x4,
	eCullFrontNoMS = 0x5,
};

enum class BlendMode {
	eOpaque = 0x0,
	eAlphaBlend = 0x1,
	eAlphaToCoverage = 0x2,
};

enum class DepthMode {
	eDepthNormal = 0x0,
	eDepthNoWrite = 0x1,
	eDepthOff = 0x2,
	eDepthLessEqual = 0x3,
};

enum class DynamicWingController_eCombinatorMode {
	eUndefinedMode = 0x0,
	eAdd = 0x1,
	eMult = 0x2,
};

enum class DynamicWingController_eInputVar {
	eUndefined = 0x0,
	eBrake = 0x1,
	eGas = 0x2,
	eLatG = 0x3,
	eLonG = 0x4,
	eSteer = 0x5,
	eSpeed = 0x6,
	SusTravelLR = 0x7,
	SusTravelRR = 0x8,
};

enum class ksgui_VariableConnection {
	ConnectFloat = 0x0,
	ConnectInt = 0x1,
};

enum class KersAttachment {
	Engine = 0x0,
	Wheels = 0x1,
};

enum class CustomSpinnerMode {
	eStandardSpinner = 0x0,
	eCircularSpinner = 0x1,
	eVerticalSpinBar = 0x2,
};

enum class ksgui_eActiveButtonStates {
	eABUnselected = 0x0,
	eABSelected = 0x1,
	eABRollOver = 0x2,
};

enum class eTaskBarStatus {
	eSelected = 0x0,
	eUnselected = 0x1,
};

enum class ksgui_eArrowsDirection {
	eLeft = 0x0,
	eRight = 0x1,
	eUp = 0x2,
	eDown = 0x3,
};

enum class FindTyreCompoundLogic {
	Random = 0x0,
	Fastest = 0x1,
	Preferred = 0x2,
};

enum class eGLPrimitiveType {
	eLines = 0x0,
	eLinesStrip = 0x1,
	eTriangles = 0x2,
	eQuads = 0x3,
};

enum class ksgui_eListBoxSelectionMode {
	eLineSelected = 0x0,
	eTextHighlighted = 0x1,
};

enum class PenaltyMode {
	CutGas = 0x0,
	InvalidateLap = 0x1,
	RecoverTime = 0x2,
	Nothing = 0x3,
	CutDetection = 0x4,
};

enum class EBBMode {
	Disabled = 0x0,
	Internal = 0x1,
	DynamicController = 0x2,
};

enum class SamplerState {
	eDefaultSampler = 0x0,
	eLinearClamped = 0x1,
};

enum class TractionType {
	RWD = 0x0,
	FWD = 0x1,
	AWD = 0x2,
	AWD_NEW = 0x3,
};

enum class TorqueModeEX {
	original = 0x0,
	reactionTorques = 0x1,
	driveTorques = 0x2,
};

enum class SuspensionType {
	DoubleWishbone = 0x0,
	Strut = 0x1,
	Axle = 0x2,
	Multilink = 0x3,
};

class RenderWindow;
class Car;
struct SVar;
class ESCMenu;
class ksgui_Spinner;
struct TyreThermalPatch;
class CarAvatar;
class ksgui_Control;
class ksgui_CheckBox;
class ksgui_ScrollBar;
class ksgui_Slider;
class ICarControlsProvider;
class Wing;
struct HWND__;
struct HINSTANCE__;
class ksgui_ListBox;
struct ksgui_ListBoxRowData;
class GraphicsManager;
class Shader;
class Game;
class GameObject;
class RaceManager;
class ICollisionObject;
class NetCarStateProvider;
class IRigidBody;
class Task;
class Suspension;
class AISpline;
class Track;
class SetupItem;
class Sim;
struct ACCarState;
struct ACPluginContext;
class Joypad;
struct TimeTransponder;
class Font;
class ConsoleCommand;
class IVarCallback;
class PhysicsEngine;
class ISphereCollisionCallback;
class IRayTrackCollisionProvider;
class ACClient;
class PhysicsAvatar;
class Material;
struct CarPhysicsState;
class IJoint;
class ICollisionCallback;
class IRayCaster;
class Node;
struct CompileContext;
struct RenderContext;
class ksgui_GUI;
class GLRenderer;
class Turbo;
class ISuspension;
class IKeyEventListener;
class ksgui_TextBox;
class ksgui_Label;
class ksgui_ActiveButton;
class ksgui_MovingBar;
struct Tyre;
class ksgui_Form;
class ksgui_TaskBarIcon;
class ksgui_PopOver;
class IndexBuffer;
struct MeshVertex;
class ksgui_ListBoxRow;
class ITyreModel;
struct SurfaceDef;
struct RayCastResult;
class ksgui_Taskbar;
class AudioEngine;
class RenderTarget;
class Camera;
class KeyboardManager;
class ICarPhysicsStateProvider;
struct SlipStream;
class IPhysicsCore;
class IDebugVisualizer;
class TrackAvatar;
class SkyBox;
class ReplayManager;
class DebugVisualizer;
class ksgui_GameScreen;
class PauseMenu;
class ksgui_FormRenderStats;
class CarNodeSorter;
class NodeEvent;
class PitStop;
class DrivingAssistManager;
class MirrorTextureRenderer;
class ACCameraManager;
class NodeDirtCamera;
class SystemMessage;
class SystemNotification;
class ScreenCapturer;
class Texture;
class Console;
class TimeLimitedTest;
class QuickMenu;
class MicroSectors;
class SimScreen;
class ACErrorHandler;
class CameraForward;
class EndSessionDisplayer;
class SessionLeaderboard;
class VirtualMirrorRenderer;
struct ksgui_ValueSerie;
class ICoastGenerator;
class ITorqueGenerator;
class PvsProcessor;
class GPUProfiler;
class CubeMap;
class CBuffer;
class IVertexBuffer;
class ACClientVotingManager;
class WrongWayIndicator;
class DriverModel;
struct SetupManager;
class NodeBoundingSphere;
class IEventTrigger;
class CarAudioFMOD;
class SkidMarkBuffer;
class ISuspensionAvatar;
class CarLodManager;
class ConstrainedObjectsManager;
struct BackfireParams;
class CarAnimations;
struct CarColliderManager;
struct TyreThermalState;
struct AIState;
class Mesh;

//UDT: struct ACClient::ClientEndSession @len=12
	//_Data: this+0x0, Member, Type: bool, isConnectionFinished
	//_Data: this+0x4, Member, Type: float, sendToPitsTimer
	//_Data: this+0x8, Member, Type: float, shutdownTimer
	//_Func: public void ClientEndSession(); @loc=optimized @len=0 @rva=0
//UDT;

struct ACClient_ClientEndSession {
public:
	bool isConnectionFinished;
	float sendToPitsTimer;
	float shutdownTimer;
	inline ACClient_ClientEndSession()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ACClient_ClientEndSession)==12),"bad size");
		static_assert((offsetof(ACClient_ClientEndSession,isConnectionFinished)==0x0),"bad off");
		static_assert((offsetof(ACClient_ClientEndSession,sendToPitsTimer)==0x4),"bad off");
		static_assert((offsetof(ACClient_ClientEndSession,shutdownTimer)==0x8),"bad off");
	};
};

//UDT: struct OnSectorSplitEvent @len=16
	//_Data: this+0x0, Member, Type: unsigned int, carIndex
	//_Data: this+0x4, Member, Type: unsigned int, sectorIndex
	//_Data: this+0x8, Member, Type: unsigned int, sectorTime
	//_Data: this+0xC, Member, Type: unsigned int, cuts
//UDT;

struct OnSectorSplitEvent {
public:
	unsigned int carIndex;
	unsigned int sectorIndex;
	unsigned int sectorTime;
	unsigned int cuts;
	inline OnSectorSplitEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnSectorSplitEvent)==16),"bad size");
		static_assert((offsetof(OnSectorSplitEvent,carIndex)==0x0),"bad off");
		static_assert((offsetof(OnSectorSplitEvent,sectorIndex)==0x4),"bad off");
		static_assert((offsetof(OnSectorSplitEvent,sectorTime)==0x8),"bad off");
		static_assert((offsetof(OnSectorSplitEvent,cuts)==0xC),"bad off");
	};
};

//UDT: struct BrushTyreModelData @len=28
	//_Func: public void BrushTyreModelData(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, CF
	//_Data: this+0x4, Member, Type: float, xu
	//_Data: this+0x8, Member, Type: float, CF1
	//_Data: this+0xC, Member, Type: float, Fz0
	//_Data: this+0x10, Member, Type: float, maxSlip0
	//_Data: this+0x14, Member, Type: float, maxSlip1
	//_Data: this+0x18, Member, Type: float, falloffSpeed
//UDT;

struct BrushTyreModelData {
public:
	float CF;
	float xu;
	float CF1;
	float Fz0;
	float maxSlip0;
	float maxSlip1;
	float falloffSpeed;
	inline BrushTyreModelData()  { }
	inline void _guard_obj() {
		static_assert((sizeof(BrushTyreModelData)==28),"bad size");
		static_assert((offsetof(BrushTyreModelData,CF)==0x0),"bad off");
		static_assert((offsetof(BrushTyreModelData,xu)==0x4),"bad off");
		static_assert((offsetof(BrushTyreModelData,CF1)==0x8),"bad off");
		static_assert((offsetof(BrushTyreModelData,Fz0)==0xC),"bad off");
		static_assert((offsetof(BrushTyreModelData,maxSlip0)==0x10),"bad off");
		static_assert((offsetof(BrushTyreModelData,maxSlip1)==0x14),"bad off");
		static_assert((offsetof(BrushTyreModelData,falloffSpeed)==0x18),"bad off");
	};
};

//UDT: struct NetCarStateProvider::LagDebug @len=24
	//_Data: this+0x0, Member, Type: double, rcvTime
	//_Data: this+0x8, Member, Type: double, physicsTime
	//_Data: this+0x10, Member, Type: bool, wasLagging
	//_Func: public void LagDebug(); @loc=optimized @len=0 @rva=0
//UDT;

struct NetCarStateProvider_LagDebug {
public:
	double rcvTime;
	double physicsTime;
	bool wasLagging;
	inline NetCarStateProvider_LagDebug()  { }
	inline void _guard_obj() {
		static_assert((sizeof(NetCarStateProvider_LagDebug)==24),"bad size");
		static_assert((offsetof(NetCarStateProvider_LagDebug,rcvTime)==0x0),"bad off");
		static_assert((offsetof(NetCarStateProvider_LagDebug,physicsTime)==0x8),"bad off");
		static_assert((offsetof(NetCarStateProvider_LagDebug,wasLagging)==0x10),"bad off");
	};
};

//UDT: struct DRSWingSetting @len=8
	//_Data: this+0x0, Member, Type: int, index
	//_Data: this+0x4, Member, Type: float, angle
//UDT;

struct DRSWingSetting {
public:
	int index;
	float angle;
	inline DRSWingSetting()  { }
	inline void _guard_obj() {
		static_assert((sizeof(DRSWingSetting)==8),"bad size");
		static_assert((offsetof(DRSWingSetting,index)==0x0),"bad off");
		static_assert((offsetof(DRSWingSetting,angle)==0x4),"bad off");
	};
};

//UDT: struct RendererFlags @len=8
	//_Func: public void RendererFlags(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: int, maxFrameLatency
	//_Data: this+0x4, Member, Type: float, mipLodBias
//UDT;

struct RendererFlags {
public:
	int maxFrameLatency;
	float mipLodBias;
	inline RendererFlags()  { }
	inline void _guard_obj() {
		static_assert((sizeof(RendererFlags)==8),"bad size");
		static_assert((offsetof(RendererFlags,maxFrameLatency)==0x0),"bad off");
		static_assert((offsetof(RendererFlags,mipLodBias)==0x4),"bad off");
	};
};

//UDT: struct RenderStats @len=20
	//_Func: public void RenderStats(); @loc=optimized @len=0 @rva=0
	//_Func: public void reset(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: int, dipCalls
	//_Data: this+0x4, Member, Type: int, sceneDipCalls
	//_Data: this+0x8, Member, Type: int, triangles
	//_Data: this+0xC, Member, Type: int, sceneTriangles
	//_Data: this+0x10, Member, Type: bool, isInMainRenderPass
//UDT;

struct RenderStats {
public:
	int dipCalls;
	int sceneDipCalls;
	int triangles;
	int sceneTriangles;
	bool isInMainRenderPass;
	inline RenderStats()  { }
	inline void _guard_obj() {
		static_assert((sizeof(RenderStats)==20),"bad size");
		static_assert((offsetof(RenderStats,dipCalls)==0x0),"bad off");
		static_assert((offsetof(RenderStats,sceneDipCalls)==0x4),"bad off");
		static_assert((offsetof(RenderStats,triangles)==0x8),"bad off");
		static_assert((offsetof(RenderStats,sceneTriangles)==0xC),"bad off");
		static_assert((offsetof(RenderStats,isInMainRenderPass)==0x10),"bad off");
	};
};

//UDT: struct ksgui::ksRect @len=16
	//_Func: public void ksRect(); @loc=optimized @len=0 @rva=0
	//_Func: public void ksRect(float  _arg0, float  _arg1, float  _arg2, float  _arg3); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, left
	//_Data: this+0x4, Member, Type: float, right
	//_Data: this+0x8, Member, Type: float, top
	//_Data: this+0xC, Member, Type: float, bottom
	//_Func: public float getWidth(); @loc=static @len=10 @rva=694320
	//_Func: public float getHeight(); @loc=static @len=11 @rva=220096
	//_Func: public void scaleByMult(float  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct ksgui_ksRect {
public:
	float left;
	float right;
	float top;
	float bottom;
	inline ksgui_ksRect()  { }
	inline float getWidth() { typedef float (*_fpt)(ksgui_ksRect *pthis); _fpt _f=(_fpt)_drva(694320); return _f(this); }
	inline float getHeight() { typedef float (*_fpt)(ksgui_ksRect *pthis); _fpt _f=(_fpt)_drva(220096); return _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_ksRect)==16),"bad size");
		static_assert((offsetof(ksgui_ksRect,left)==0x0),"bad off");
		static_assert((offsetof(ksgui_ksRect,right)==0x4),"bad off");
		static_assert((offsetof(ksgui_ksRect,top)==0x8),"bad off");
		static_assert((offsetof(ksgui_ksRect,bottom)==0xC),"bad off");
	};
};

//UDT: struct SACEngineInput @len=16
	//_Data: this+0x0, Member, Type: float, gasInput
	//_Data: this+0x4, Member, Type: float, carSpeed
	//_Data: this+0x8, Member, Type: float, altitude
	//_Data: this+0xC, Member, Type: float, rpm
	//_Func: public void SACEngineInput(); @loc=optimized @len=0 @rva=0
//UDT;

struct SACEngineInput {
public:
	float gasInput;
	float carSpeed;
	float altitude;
	float rpm;
	inline SACEngineInput()  { }
	inline void _guard_obj() {
		static_assert((sizeof(SACEngineInput)==16),"bad size");
		static_assert((offsetof(SACEngineInput,gasInput)==0x0),"bad off");
		static_assert((offsetof(SACEngineInput,carSpeed)==0x4),"bad off");
		static_assert((offsetof(SACEngineInput,altitude)==0x8),"bad off");
		static_assert((offsetof(SACEngineInput,rpm)==0xC),"bad off");
	};
};

//UDT: struct TyrePatchData @len=20
	//_Func: public void TyrePatchData(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, surfaceTransfer
	//_Data: this+0x4, Member, Type: float, patchTransfer
	//_Data: this+0x8, Member, Type: float, patchCoreTransfer
	//_Data: this+0xC, Member, Type: float, internalCoreTransfer
	//_Data: this+0x10, Member, Type: float, coolFactorGain
//UDT;

struct TyrePatchData {
public:
	float surfaceTransfer;
	float patchTransfer;
	float patchCoreTransfer;
	float internalCoreTransfer;
	float coolFactorGain;
	inline TyrePatchData()  { }
	inline void _guard_obj() {
		static_assert((sizeof(TyrePatchData)==20),"bad size");
		static_assert((offsetof(TyrePatchData,surfaceTransfer)==0x0),"bad off");
		static_assert((offsetof(TyrePatchData,patchTransfer)==0x4),"bad off");
		static_assert((offsetof(TyrePatchData,patchCoreTransfer)==0x8),"bad off");
		static_assert((offsetof(TyrePatchData,internalCoreTransfer)==0xC),"bad off");
		static_assert((offsetof(TyrePatchData,coolFactorGain)==0x10),"bad off");
	};
};

//UDT: struct ClientQOSData @len=24
	//_Data: this+0x0, Member, Type: bool, usingMegapackets
	//_Data: this+0x4, Member, Type: int, counter
	//_Data: this+0x8, Member, Type: double, startTime
	//_Data: this+0x10, Member, Type: int, lastQOS
	//_Func: public void ClientQOSData(); @loc=optimized @len=0 @rva=0
//UDT;

struct ClientQOSData {
public:
	bool usingMegapackets;
	int counter;
	double startTime;
	int lastQOS;
	inline ClientQOSData()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ClientQOSData)==24),"bad size");
		static_assert((offsetof(ClientQOSData,usingMegapackets)==0x0),"bad off");
		static_assert((offsetof(ClientQOSData,counter)==0x4),"bad off");
		static_assert((offsetof(ClientQOSData,startTime)==0x8),"bad off");
		static_assert((offsetof(ClientQOSData,lastQOS)==0x10),"bad off");
	};
};

//UDT: struct ACPluginContext @len=1
//UDT;

struct ACPluginContext {
public:
	inline ACPluginContext()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ACPluginContext)==1),"bad size");
	};
};

//UDT: struct WheelValues @len=16
	//_Data: this+0x0, Member, Type: float, lf
	//_Data: this+0x4, Member, Type: float, rf
	//_Data: this+0x8, Member, Type: float, lr
	//_Data: this+0xC, Member, Type: float, rr
	//_Func: public void WheelValues(); @loc=optimized @len=0 @rva=0
//UDT;

struct WheelValues {
public:
	float lf;
	float rf;
	float lr;
	float rr;
	inline WheelValues()  { }
	inline void _guard_obj() {
		static_assert((sizeof(WheelValues)==16),"bad size");
		static_assert((offsetof(WheelValues,lf)==0x0),"bad off");
		static_assert((offsetof(WheelValues,rf)==0x4),"bad off");
		static_assert((offsetof(WheelValues,lr)==0x8),"bad off");
		static_assert((offsetof(WheelValues,rr)==0xC),"bad off");
	};
};

//UDT: struct KPI @len=8
	//_Data: this+0x0, Member, Type: float, angleRAD
	//_Data: this+0x4, Member, Type: float, scrubRadius
	//_Func: public void KPI(); @loc=optimized @len=0 @rva=0
//UDT;

struct KPI {
public:
	float angleRAD;
	float scrubRadius;
	inline KPI()  { }
	inline void _guard_obj() {
		static_assert((sizeof(KPI)==8),"bad size");
		static_assert((offsetof(KPI,angleRAD)==0x0),"bad off");
		static_assert((offsetof(KPI,scrubRadius)==0x4),"bad off");
	};
};

//UDT: struct CoastSettings @len=8
	//_Data: this+0x0, Member, Type: float, coast1
	//_Data: this+0x4, Member, Type: float, coast2
//UDT;

struct CoastSettings {
public:
	float coast1;
	float coast2;
	inline CoastSettings()  { }
	inline void _guard_obj() {
		static_assert((sizeof(CoastSettings)==8),"bad size");
		static_assert((offsetof(CoastSettings,coast1)==0x0),"bad off");
		static_assert((offsetof(CoastSettings,coast2)==0x4),"bad off");
	};
};

//UDT: struct AWD2Data @len=24
	//_Data: this+0x0, Member, Type: double, ramp
	//_Data: this+0x8, Member, Type: double, maxTorque
	//_Data: this+0x10, Member, Type: float, currentLockTorque
	//_Func: public void AWD2Data(); @loc=optimized @len=0 @rva=0
//UDT;

struct AWD2Data {
public:
	double ramp;
	double maxTorque;
	float currentLockTorque;
	inline AWD2Data()  { }
	inline void _guard_obj() {
		static_assert((sizeof(AWD2Data)==24),"bad size");
		static_assert((offsetof(AWD2Data,ramp)==0x0),"bad off");
		static_assert((offsetof(AWD2Data,maxTorque)==0x8),"bad off");
		static_assert((offsetof(AWD2Data,currentLockTorque)==0x10),"bad off");
	};
};

//UDT: struct SplineLocatorData @len=40
	//_Data: this+0x0, Member, Type: float, npos
	//_Data: this+0x4, Member, Type: unsigned int, currentIndex
	//_Data: this+0x8, Member, Type: float, lateralOffset
	//_Data: this+0xC, Member, Type: float, splineLength
	//_Data: this+0x10, Member, Type: float[0x2], sides
	//_Data: this+0x18, Member, Type: float[0x2], sidesFromIL
	//_Data: this+0x20, Member, Type: float, sideVelocity
	//_Data: this+0x24, Member, Type: bool, isOutsideTrackLimits
	//_Func: public void SplineLocatorData(); @loc=optimized @len=0 @rva=0
//UDT;

struct SplineLocatorData {
public:
	float npos;
	unsigned int currentIndex;
	float lateralOffset;
	float splineLength;
	float sides[0x2];
	float sidesFromIL[0x2];
	float sideVelocity;
	bool isOutsideTrackLimits;
	inline SplineLocatorData()  { }
	inline void _guard_obj() {
		static_assert((sizeof(SplineLocatorData)==40),"bad size");
		static_assert((offsetof(SplineLocatorData,npos)==0x0),"bad off");
		static_assert((offsetof(SplineLocatorData,currentIndex)==0x4),"bad off");
		static_assert((offsetof(SplineLocatorData,lateralOffset)==0x8),"bad off");
		static_assert((offsetof(SplineLocatorData,splineLength)==0xC),"bad off");
		static_assert((offsetof(SplineLocatorData,sides)==0x10),"bad off");
		static_assert((offsetof(SplineLocatorData,sidesFromIL)==0x18),"bad off");
		static_assert((offsetof(SplineLocatorData,sideVelocity)==0x20),"bad off");
		static_assert((offsetof(SplineLocatorData,isOutsideTrackLimits)==0x24),"bad off");
	};
};

//UDT: struct PerformancePair @len=8
	//_Func: public void PerformancePair(unsigned int  _arg0, float  _arg1); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: unsigned int, t
	//_Data: this+0x4, Member, Type: float, speedMS
//UDT;

struct PerformancePair {
public:
	unsigned int t;
	float speedMS;
	inline PerformancePair()  { }
	inline void _guard_obj() {
		static_assert((sizeof(PerformancePair)==8),"bad size");
		static_assert((offsetof(PerformancePair,t)==0x0),"bad off");
		static_assert((offsetof(PerformancePair,speedMS)==0x4),"bad off");
	};
};

//UDT: struct PitStopTime @len=16
	//_Data: this+0x0, Member, Type: float, total
	//_Data: this+0x4, Member, Type: float, tyres
	//_Data: this+0x8, Member, Type: float, repair
	//_Data: this+0xC, Member, Type: float, fuel
	//_Func: public void PitStopTime(); @loc=optimized @len=0 @rva=0
//UDT;

struct PitStopTime {
public:
	float total;
	float tyres;
	float repair;
	float fuel;
	inline PitStopTime()  { }
	inline void _guard_obj() {
		static_assert((sizeof(PitStopTime)==16),"bad size");
		static_assert((offsetof(PitStopTime,total)==0x0),"bad off");
		static_assert((offsetof(PitStopTime,tyres)==0x4),"bad off");
		static_assert((offsetof(PitStopTime,repair)==0x8),"bad off");
		static_assert((offsetof(PitStopTime,fuel)==0xC),"bad off");
	};
};

//UDT: struct SplineIndexBound @len=8
	//_Func: public void SplineIndexBound(unsigned int  _arg0, unsigned int  _arg1); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: unsigned int, minIndex
	//_Data: this+0x4, Member, Type: unsigned int, maxIndex
//UDT;

struct SplineIndexBound {
public:
	unsigned int minIndex;
	unsigned int maxIndex;
	inline SplineIndexBound()  { }
	inline void _guard_obj() {
		static_assert((sizeof(SplineIndexBound)==8),"bad size");
		static_assert((offsetof(SplineIndexBound,minIndex)==0x0),"bad off");
		static_assert((offsetof(SplineIndexBound,maxIndex)==0x4),"bad off");
	};
};

//UDT: struct SplineLocationData @len=4
	//_Func: public void SplineLocationData(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: int, currentIndex
//UDT;

struct SplineLocationData {
public:
	int currentIndex;
	inline SplineLocationData()  { }
	inline void _guard_obj() {
		static_assert((sizeof(SplineLocationData)==4),"bad size");
		static_assert((offsetof(SplineLocationData,currentIndex)==0x0),"bad off");
	};
};

//UDT: struct WreckerProtection @len=16
	//_Data: this+0x0, Member, Type: float, maxContactsPerKM
	//_Data: this+0x4, Member, Type: int, warningCount
	//_Data: this+0x8, Member, Type: int, contacts
	//_Data: this+0xC, Member, Type: bool, blackListRequested
	//_Func: public void WreckerProtection(); @loc=optimized @len=0 @rva=0
//UDT;

struct WreckerProtection {
public:
	float maxContactsPerKM;
	int warningCount;
	int contacts;
	bool blackListRequested;
	inline WreckerProtection()  { }
	inline void _guard_obj() {
		static_assert((sizeof(WreckerProtection)==16),"bad size");
		static_assert((offsetof(WreckerProtection,maxContactsPerKM)==0x0),"bad off");
		static_assert((offsetof(WreckerProtection,warningCount)==0x4),"bad off");
		static_assert((offsetof(WreckerProtection,contacts)==0x8),"bad off");
		static_assert((offsetof(WreckerProtection,blackListRequested)==0xC),"bad off");
	};
};

//UDT: struct OnKeyCharEvent @len=4
	//_Func: public void OnKeyCharEvent(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: unsigned int, key
//UDT;

struct OnKeyCharEvent {
public:
	unsigned int key;
	inline OnKeyCharEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnKeyCharEvent)==4),"bad size");
		static_assert((offsetof(OnKeyCharEvent,key)==0x0),"bad off");
	};
};

//UDT: struct PushToPass @len=40
	//_Data: this+0x0, Member, Type: bool, enabled
	//_Data: this+0x1, Member, Type: bool, active
	//_Data: this+0x4, Member, Type: float, overboost
	//_Data: this+0x8, Member, Type: float, timeS
	//_Data: this+0xC, Member, Type: float, coolDownS
	//_Data: this+0x10, Member, Type: float, timeAccum
	//_Data: this+0x14, Member, Type: int, activations
	//_Data: this+0x18, Member, Type: float, baseWastegate
	//_Data: this+0x1C, Member, Type: int, baseActivations
	//_Data: this+0x20, Member, Type: int, basePositionCoeff
	//_Data: this+0x24, Member, Type: int, maxActivations
	//_Func: public void PushToPass(); @loc=optimized @len=0 @rva=0
//UDT;

struct PushToPass {
public:
	bool enabled;
	bool active;
	float overboost;
	float timeS;
	float coolDownS;
	float timeAccum;
	int activations;
	float baseWastegate;
	int baseActivations;
	int basePositionCoeff;
	int maxActivations;
	inline PushToPass()  { }
	inline void _guard_obj() {
		static_assert((sizeof(PushToPass)==40),"bad size");
		static_assert((offsetof(PushToPass,enabled)==0x0),"bad off");
		static_assert((offsetof(PushToPass,active)==0x1),"bad off");
		static_assert((offsetof(PushToPass,overboost)==0x4),"bad off");
		static_assert((offsetof(PushToPass,timeS)==0x8),"bad off");
		static_assert((offsetof(PushToPass,coolDownS)==0xC),"bad off");
		static_assert((offsetof(PushToPass,timeAccum)==0x10),"bad off");
		static_assert((offsetof(PushToPass,activations)==0x14),"bad off");
		static_assert((offsetof(PushToPass,baseWastegate)==0x18),"bad off");
		static_assert((offsetof(PushToPass,baseActivations)==0x1C),"bad off");
		static_assert((offsetof(PushToPass,basePositionCoeff)==0x20),"bad off");
		static_assert((offsetof(PushToPass,maxActivations)==0x24),"bad off");
	};
};

//UDT: struct DamageReportDef @len=32
	//_Func: public void DamageReportDef(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: double, lastSendTime
	//_Data: this+0x8, Member, Type: float[0x5], damageZoneLevel
//UDT;

struct DamageReportDef {
public:
	double lastSendTime;
	float damageZoneLevel[0x5];
	inline DamageReportDef()  { }
	inline void _guard_obj() {
		static_assert((sizeof(DamageReportDef)==32),"bad size");
		static_assert((offsetof(DamageReportDef,lastSendTime)==0x0),"bad off");
		static_assert((offsetof(DamageReportDef,damageZoneLevel)==0x8),"bad off");
	};
};

//UDT: struct VideoSettings @len=80
	//_Func: public void VideoSettings(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: int, aaSamples
	//_Data: this+0x4, Member, Type: int, width
	//_Data: this+0x8, Member, Type: int, height
	//_Data: this+0x10, Member, Type: void *, hWnd
	//_Data: this+0x18, Member, Type: bool, isFullscreen
	//_Data: this+0x19, Member, Type: bool, vSync
	//_Data: this+0x1C, Member, Type: int, anisotropic
	//_Data: this+0x20, Member, Type: int, aaQuality
	//_Data: this+0x24, Member, Type: int, shadowMapSize
	//_Data: this+0x28, Member, Type: double, fpsCapMS
	//_Data: this+0x30, Member, Type: int, dxgiModeIndex
	//_Data: this+0x34, Member, Type: int, worldDetail
	//_Data: this+0x38, Member, Type: bool, ppHDREnabled
	//_Data: this+0x39, Member, Type: bool, ppHeatShimmer
	//_Data: this+0x3A, Member, Type: bool, ppFXAA
	//_Data: this+0x3B, Member, Type: bool, ppRaysOfGod
	//_Data: this+0x3C, Member, Type: int, ppQuality
	//_Data: this+0x40, Member, Type: int, ppGlare
	//_Data: this+0x44, Member, Type: int, ppDof
	//_Data: this+0x48, Member, Type: bool, tripleBuffer
	//_Data: this+0x4C, Member, Type: float, refresh
//UDT;

struct VideoSettings {
public:
	int aaSamples;
	int width;
	int height;
	void * hWnd;
	bool isFullscreen;
	bool vSync;
	int anisotropic;
	int aaQuality;
	int shadowMapSize;
	double fpsCapMS;
	int dxgiModeIndex;
	int worldDetail;
	bool ppHDREnabled;
	bool ppHeatShimmer;
	bool ppFXAA;
	bool ppRaysOfGod;
	int ppQuality;
	int ppGlare;
	int ppDof;
	bool tripleBuffer;
	float refresh;
	inline VideoSettings()  { }
	inline void _guard_obj() {
		static_assert((sizeof(VideoSettings)==80),"bad size");
		static_assert((offsetof(VideoSettings,aaSamples)==0x0),"bad off");
		static_assert((offsetof(VideoSettings,width)==0x4),"bad off");
		static_assert((offsetof(VideoSettings,height)==0x8),"bad off");
		static_assert((offsetof(VideoSettings,hWnd)==0x10),"bad off");
		static_assert((offsetof(VideoSettings,isFullscreen)==0x18),"bad off");
		static_assert((offsetof(VideoSettings,vSync)==0x19),"bad off");
		static_assert((offsetof(VideoSettings,anisotropic)==0x1C),"bad off");
		static_assert((offsetof(VideoSettings,aaQuality)==0x20),"bad off");
		static_assert((offsetof(VideoSettings,shadowMapSize)==0x24),"bad off");
		static_assert((offsetof(VideoSettings,fpsCapMS)==0x28),"bad off");
		static_assert((offsetof(VideoSettings,dxgiModeIndex)==0x30),"bad off");
		static_assert((offsetof(VideoSettings,worldDetail)==0x34),"bad off");
		static_assert((offsetof(VideoSettings,ppHDREnabled)==0x38),"bad off");
		static_assert((offsetof(VideoSettings,ppHeatShimmer)==0x39),"bad off");
		static_assert((offsetof(VideoSettings,ppFXAA)==0x3A),"bad off");
		static_assert((offsetof(VideoSettings,ppRaysOfGod)==0x3B),"bad off");
		static_assert((offsetof(VideoSettings,ppQuality)==0x3C),"bad off");
		static_assert((offsetof(VideoSettings,ppGlare)==0x40),"bad off");
		static_assert((offsetof(VideoSettings,ppDof)==0x44),"bad off");
		static_assert((offsetof(VideoSettings,tripleBuffer)==0x48),"bad off");
		static_assert((offsetof(VideoSettings,refresh)==0x4C),"bad off");
	};
};

//UDT: struct GameStats @len=40
	//_Func: public void GameStats(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: double, cpuTime
	//_Data: this+0x8, Member, Type: double, updateTime
	//_Data: this+0x10, Member, Type: double, renderHUDTime
	//_Data: this+0x18, Member, Type: double, renderTime
	//_Data: this+0x20, Member, Type: double, renderAudioTime
//UDT;

struct GameStats {
public:
	double cpuTime;
	double updateTime;
	double renderHUDTime;
	double renderTime;
	double renderAudioTime;
	inline GameStats()  { }
	inline void _guard_obj() {
		static_assert((sizeof(GameStats)==40),"bad size");
		static_assert((offsetof(GameStats,cpuTime)==0x0),"bad off");
		static_assert((offsetof(GameStats,updateTime)==0x8),"bad off");
		static_assert((offsetof(GameStats,renderHUDTime)==0x10),"bad off");
		static_assert((offsetof(GameStats,renderTime)==0x18),"bad off");
		static_assert((offsetof(GameStats,renderAudioTime)==0x20),"bad off");
	};
};

//UDT: struct OnKeyEvent @len=4
	//_Func: public void OnKeyEvent(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: unsigned int, keyCode
//UDT;

struct OnKeyEvent {
public:
	unsigned int keyCode;
	inline OnKeyEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnKeyEvent)==4),"bad size");
		static_assert((offsetof(OnKeyEvent,keyCode)==0x0),"bad off");
	};
};

//UDT: class ITorqueGenerator @len=8 @vfcount=2
	//_VTable: 
	//_Func: public void ~ITorqueGenerator(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=11 @rva=2549840
	//_Func: public float getOutputTorque(); @intro @pure @virtual vtpo=0 vfid=1 @loc=optimized @len=0 @rva=0
	//_Func: public void ITorqueGenerator(ITorqueGenerator &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ITorqueGenerator(); @loc=optimized @len=0 @rva=0
	//_Func: public ITorqueGenerator & operator=(ITorqueGenerator &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class ITorqueGenerator {
public:
	inline ITorqueGenerator()  { }
	virtual ~ITorqueGenerator();
	inline void dtor() { typedef void (*_fpt)(ITorqueGenerator *pthis); _fpt _f=(_fpt)_drva(2549840); _f(this); }
	virtual float getOutputTorque_vf1() = 0;
	inline float getOutputTorque() { return getOutputTorque_vf1(); }
	inline void _guard_obj() {
		static_assert((sizeof(ITorqueGenerator)==8),"bad size");
	};
};

//UDT: struct TyreInputs @len=12
	//_Func: public void TyreInputs(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, brakeTorque
	//_Data: this+0x4, Member, Type: float, handBrakeTorque
	//_Data: this+0x8, Member, Type: float, electricTorque
//UDT;

struct TyreInputs {
public:
	float brakeTorque;
	float handBrakeTorque;
	float electricTorque;
	inline TyreInputs()  { }
	inline void _guard_obj() {
		static_assert((sizeof(TyreInputs)==12),"bad size");
		static_assert((offsetof(TyreInputs,brakeTorque)==0x0),"bad off");
		static_assert((offsetof(TyreInputs,handBrakeTorque)==0x4),"bad off");
		static_assert((offsetof(TyreInputs,electricTorque)==0x8),"bad off");
	};
};

//UDT: struct TyreStatus @len=184
	//_Func: public void TyreStatus(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, depth
	//_Data: this+0x4, Member, Type: float, load
	//_Data: this+0x8, Member, Type: float, camberRAD
	//_Data: this+0xC, Member, Type: float, slipAngleRAD
	//_Data: this+0x10, Member, Type: float, slipRatio
	//_Data: this+0x14, Member, Type: float, angularVelocity
	//_Data: this+0x18, Member, Type: float, Fy
	//_Data: this+0x1C, Member, Type: float, Fx
	//_Data: this+0x20, Member, Type: float, Mz
	//_Data: this+0x24, Member, Type: bool, isLocked
	//_Data: this+0x28, Member, Type: float, slipFactor
	//_Data: this+0x2C, Member, Type: float, ndSlip
	//_Data: this+0x30, Member, Type: float, distToGround
	//_Data: this+0x34, Member, Type: float, Dy
	//_Data: this+0x38, Member, Type: float, Dx
	//_Data: this+0x3C, Member, Type: float, D
	//_Data: this+0x40, Member, Type: float, dirtyLevel
	//_Data: this+0x44, Member, Type: float, rollingResistence
	//_Data: this+0x48, Member, Type: float, thermalInput
	//_Data: this+0x4C, Member, Type: float, feedbackTorque
	//_Data: this+0x50, Member, Type: float, loadedRadius
	//_Data: this+0x54, Member, Type: float, effectiveRadius
	//_Data: this+0x58, Member, Type: float, liveRadius
	//_Data: this+0x5C, Member, Type: float, pressureStatic
	//_Data: this+0x60, Member, Type: float, pressureDynamic
	//_Data: this+0x68, Member, Type: double, virtualKM
	//_Data: this+0x70, Member, Type: float[0x3], lastTempIMO
	//_Data: this+0x7C, Member, Type: float, peakSA
	//_Data: this+0x80, Member, Type: double, grain
	//_Data: this+0x88, Member, Type: double, blister
	//_Data: this+0x90, Member, Type: float, inflation
	//_Data: this+0x98, Member, Type: double, flatSpot
	//_Data: this+0xA0, Member, Type: float, lastGrain
	//_Data: this+0xA4, Member, Type: float, lastBlister
	//_Data: this+0xA8, Member, Type: float, normalizedSlideX
	//_Data: this+0xAC, Member, Type: float, normalizedSlideY
	//_Data: this+0xB0, Member, Type: float, finalDY
	//_Data: this+0xB4, Member, Type: float, wearMult
//UDT;

struct TyreStatus {
public:
	float depth;
	float load;
	float camberRAD;
	float slipAngleRAD;
	float slipRatio;
	float angularVelocity;
	float Fy;
	float Fx;
	float Mz;
	bool isLocked;
	float slipFactor;
	float ndSlip;
	float distToGround;
	float Dy;
	float Dx;
	float D;
	float dirtyLevel;
	float rollingResistence;
	float thermalInput;
	float feedbackTorque;
	float loadedRadius;
	float effectiveRadius;
	float liveRadius;
	float pressureStatic;
	float pressureDynamic;
	double virtualKM;
	float lastTempIMO[0x3];
	float peakSA;
	double grain;
	double blister;
	float inflation;
	double flatSpot;
	float lastGrain;
	float lastBlister;
	float normalizedSlideX;
	float normalizedSlideY;
	float finalDY;
	float wearMult;
	inline TyreStatus()  { }
	inline void _guard_obj() {
		static_assert((sizeof(TyreStatus)==184),"bad size");
		static_assert((offsetof(TyreStatus,depth)==0x0),"bad off");
		static_assert((offsetof(TyreStatus,load)==0x4),"bad off");
		static_assert((offsetof(TyreStatus,camberRAD)==0x8),"bad off");
		static_assert((offsetof(TyreStatus,slipAngleRAD)==0xC),"bad off");
		static_assert((offsetof(TyreStatus,slipRatio)==0x10),"bad off");
		static_assert((offsetof(TyreStatus,angularVelocity)==0x14),"bad off");
		static_assert((offsetof(TyreStatus,Fy)==0x18),"bad off");
		static_assert((offsetof(TyreStatus,Fx)==0x1C),"bad off");
		static_assert((offsetof(TyreStatus,Mz)==0x20),"bad off");
		static_assert((offsetof(TyreStatus,isLocked)==0x24),"bad off");
		static_assert((offsetof(TyreStatus,slipFactor)==0x28),"bad off");
		static_assert((offsetof(TyreStatus,ndSlip)==0x2C),"bad off");
		static_assert((offsetof(TyreStatus,distToGround)==0x30),"bad off");
		static_assert((offsetof(TyreStatus,Dy)==0x34),"bad off");
		static_assert((offsetof(TyreStatus,Dx)==0x38),"bad off");
		static_assert((offsetof(TyreStatus,D)==0x3C),"bad off");
		static_assert((offsetof(TyreStatus,dirtyLevel)==0x40),"bad off");
		static_assert((offsetof(TyreStatus,rollingResistence)==0x44),"bad off");
		static_assert((offsetof(TyreStatus,thermalInput)==0x48),"bad off");
		static_assert((offsetof(TyreStatus,feedbackTorque)==0x4C),"bad off");
		static_assert((offsetof(TyreStatus,loadedRadius)==0x50),"bad off");
		static_assert((offsetof(TyreStatus,effectiveRadius)==0x54),"bad off");
		static_assert((offsetof(TyreStatus,liveRadius)==0x58),"bad off");
		static_assert((offsetof(TyreStatus,pressureStatic)==0x5C),"bad off");
		static_assert((offsetof(TyreStatus,pressureDynamic)==0x60),"bad off");
		static_assert((offsetof(TyreStatus,virtualKM)==0x68),"bad off");
		static_assert((offsetof(TyreStatus,lastTempIMO)==0x70),"bad off");
		static_assert((offsetof(TyreStatus,peakSA)==0x7C),"bad off");
		static_assert((offsetof(TyreStatus,grain)==0x80),"bad off");
		static_assert((offsetof(TyreStatus,blister)==0x88),"bad off");
		static_assert((offsetof(TyreStatus,inflation)==0x90),"bad off");
		static_assert((offsetof(TyreStatus,flatSpot)==0x98),"bad off");
		static_assert((offsetof(TyreStatus,lastGrain)==0xA0),"bad off");
		static_assert((offsetof(TyreStatus,lastBlister)==0xA4),"bad off");
		static_assert((offsetof(TyreStatus,normalizedSlideX)==0xA8),"bad off");
		static_assert((offsetof(TyreStatus,normalizedSlideY)==0xAC),"bad off");
		static_assert((offsetof(TyreStatus,finalDY)==0xB0),"bad off");
		static_assert((offsetof(TyreStatus,wearMult)==0xB4),"bad off");
	};
};

//UDT: struct SCarStateAero @len=12
	//_Func: public void SCarStateAero(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, CD
	//_Data: this+0x4, Member, Type: float, CL_Front
	//_Data: this+0x8, Member, Type: float, CL_Rear
//UDT;

struct SCarStateAero {
public:
	float CD;
	float CL_Front;
	float CL_Rear;
	inline SCarStateAero()  { }
	inline void _guard_obj() {
		static_assert((sizeof(SCarStateAero)==12),"bad size");
		static_assert((offsetof(SCarStateAero,CD)==0x0),"bad off");
		static_assert((offsetof(SCarStateAero,CL_Front)==0x4),"bad off");
		static_assert((offsetof(SCarStateAero,CL_Rear)==0x8),"bad off");
	};
};

//UDT: struct AccelerationProfile @len=8
	//_Data: this+0x0, Member, Type: float, zero
	//_Data: this+0x4, Member, Type: float, maxTyres
//UDT;

struct AccelerationProfile {
public:
	float zero;
	float maxTyres;
	inline AccelerationProfile()  { }
	inline void _guard_obj() {
		static_assert((sizeof(AccelerationProfile)==8),"bad size");
		static_assert((offsetof(AccelerationProfile,zero)==0x0),"bad off");
		static_assert((offsetof(AccelerationProfile,maxTyres)==0x4),"bad off");
	};
};

//UDT: struct TyreData @len=72
	//_Func: public void TyreData(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, width
	//_Data: this+0x4, Member, Type: float, radius
	//_Data: this+0x8, Member, Type: float, k
	//_Data: this+0xC, Member, Type: float, d
	//_Data: this+0x10, Member, Type: float, angularInertia
	//_Data: this+0x14, Member, Type: float, thermalFrictionK
	//_Data: this+0x18, Member, Type: float, thermalRollingK
	//_Data: this+0x1C, Member, Type: float, thermalRollingSurfaceK
	//_Data: this+0x20, Member, Type: float, grainThreshold
	//_Data: this+0x24, Member, Type: float, blisterThreshold
	//_Data: this+0x28, Member, Type: float, grainGamma
	//_Data: this+0x2C, Member, Type: float, blisterGamma
	//_Data: this+0x30, Member, Type: float, grainGain
	//_Data: this+0x34, Member, Type: float, blisterGain
	//_Data: this+0x38, Member, Type: float, rimRadius
	//_Data: this+0x3C, Member, Type: float, optimumTemp
	//_Data: this+0x40, Member, Type: float, softnessIndex
	//_Data: this+0x44, Member, Type: float, radiusRaiseK
//UDT;

struct TyreData {
public:
	float width;
	float radius;
	float k;
	float d;
	float angularInertia;
	float thermalFrictionK;
	float thermalRollingK;
	float thermalRollingSurfaceK;
	float grainThreshold;
	float blisterThreshold;
	float grainGamma;
	float blisterGamma;
	float grainGain;
	float blisterGain;
	float rimRadius;
	float optimumTemp;
	float softnessIndex;
	float radiusRaiseK;
	inline TyreData()  { }
	inline void _guard_obj() {
		static_assert((sizeof(TyreData)==72),"bad size");
		static_assert((offsetof(TyreData,width)==0x0),"bad off");
		static_assert((offsetof(TyreData,radius)==0x4),"bad off");
		static_assert((offsetof(TyreData,k)==0x8),"bad off");
		static_assert((offsetof(TyreData,d)==0xC),"bad off");
		static_assert((offsetof(TyreData,angularInertia)==0x10),"bad off");
		static_assert((offsetof(TyreData,thermalFrictionK)==0x14),"bad off");
		static_assert((offsetof(TyreData,thermalRollingK)==0x18),"bad off");
		static_assert((offsetof(TyreData,thermalRollingSurfaceK)==0x1C),"bad off");
		static_assert((offsetof(TyreData,grainThreshold)==0x20),"bad off");
		static_assert((offsetof(TyreData,blisterThreshold)==0x24),"bad off");
		static_assert((offsetof(TyreData,grainGamma)==0x28),"bad off");
		static_assert((offsetof(TyreData,blisterGamma)==0x2C),"bad off");
		static_assert((offsetof(TyreData,grainGain)==0x30),"bad off");
		static_assert((offsetof(TyreData,blisterGain)==0x34),"bad off");
		static_assert((offsetof(TyreData,rimRadius)==0x38),"bad off");
		static_assert((offsetof(TyreData,optimumTemp)==0x3C),"bad off");
		static_assert((offsetof(TyreData,softnessIndex)==0x40),"bad off");
		static_assert((offsetof(TyreData,radiusRaiseK)==0x44),"bad off");
	};
};

//UDT: struct TyreThermalState @len=192
	//_Data: this+0x0, Member, Type: float[0x3][0xC], temps
	//_Data: this+0x90, Member, Type: float, coreTemp
	//_Data: this+0x94, Member, Type: float, thermalInput
	//_Data: this+0x98, Member, Type: float, dynamicPressure
	//_Data: this+0x9C, Member, Type: float, staticPressure
	//_Data: this+0xA0, Member, Type: float[0x3], lastSetIMO
	//_Data: this+0xAC, Member, Type: float, cpTemperature
	//_Data: this+0xB0, Member, Type: float, lastGrain
	//_Data: this+0xB4, Member, Type: float, lastBlister
	//_Data: this+0xB8, Member, Type: float, mult
	//_Data: this+0xBC, Member, Type: bool, isHot
	//_Func: public void TyreThermalState(); @loc=optimized @len=0 @rva=0
//UDT;

struct TyreThermalState {
public:
	float temps[0x3][0xC];
	float coreTemp;
	float thermalInput;
	float dynamicPressure;
	float staticPressure;
	float lastSetIMO[0x3];
	float cpTemperature;
	float lastGrain;
	float lastBlister;
	float mult;
	bool isHot;
	inline TyreThermalState()  { }
	inline void _guard_obj() {
		static_assert((sizeof(TyreThermalState)==192),"bad size");
		static_assert((offsetof(TyreThermalState,temps)==0x0),"bad off");
		static_assert((offsetof(TyreThermalState,coreTemp)==0x90),"bad off");
		static_assert((offsetof(TyreThermalState,thermalInput)==0x94),"bad off");
		static_assert((offsetof(TyreThermalState,dynamicPressure)==0x98),"bad off");
		static_assert((offsetof(TyreThermalState,staticPressure)==0x9C),"bad off");
		static_assert((offsetof(TyreThermalState,lastSetIMO)==0xA0),"bad off");
		static_assert((offsetof(TyreThermalState,cpTemperature)==0xAC),"bad off");
		static_assert((offsetof(TyreThermalState,lastGrain)==0xB0),"bad off");
		static_assert((offsetof(TyreThermalState,lastBlister)==0xB4),"bad off");
		static_assert((offsetof(TyreThermalState,mult)==0xB8),"bad off");
		static_assert((offsetof(TyreThermalState,isHot)==0xBC),"bad off");
	};
};

//UDT: struct BrushOutput @len=8
	//_Func: public void BrushOutput(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, force
	//_Data: this+0x4, Member, Type: float, slip
//UDT;

struct BrushOutput {
public:
	float force;
	float slip;
	inline BrushOutput()  { }
	inline void _guard_obj() {
		static_assert((sizeof(BrushOutput)==8),"bad size");
		static_assert((offsetof(BrushOutput,force)==0x0),"bad off");
		static_assert((offsetof(BrushOutput,slip)==0x4),"bad off");
	};
};

//UDT: struct NetCarQoS @len=8
	//_Data: this+0x0, Member, Type: int, goodPackets
	//_Data: this+0x4, Member, Type: int, badPackets
	//_Func: public void NetCarQoS(); @loc=optimized @len=0 @rva=0
//UDT;

struct NetCarQoS {
public:
	int goodPackets;
	int badPackets;
	inline NetCarQoS()  { }
	inline void _guard_obj() {
		static_assert((sizeof(NetCarQoS)==8),"bad size");
		static_assert((offsetof(NetCarQoS,goodPackets)==0x0),"bad off");
		static_assert((offsetof(NetCarQoS,badPackets)==0x4),"bad off");
	};
};

//UDT: struct TyreExternalInputs @len=16
	//_Data: this+0x0, Member, Type: bool, isActive
	//_Data: this+0x4, Member, Type: float, load
	//_Data: this+0x8, Member, Type: float, slipAngle
	//_Data: this+0xC, Member, Type: float, slipRatio
	//_Func: public void TyreExternalInputs(); @loc=optimized @len=0 @rva=0
//UDT;

struct TyreExternalInputs {
public:
	bool isActive;
	float load;
	float slipAngle;
	float slipRatio;
	inline TyreExternalInputs()  { }
	inline void _guard_obj() {
		static_assert((sizeof(TyreExternalInputs)==16),"bad size");
		static_assert((offsetof(TyreExternalInputs,isActive)==0x0),"bad off");
		static_assert((offsetof(TyreExternalInputs,load)==0x4),"bad off");
		static_assert((offsetof(TyreExternalInputs,slipAngle)==0x8),"bad off");
		static_assert((offsetof(TyreExternalInputs,slipRatio)==0xC),"bad off");
	};
};

//UDT: class SignalGenerator @len=16 @vfcount=3
	//_VTable: 
	//_Func: public void SignalGenerator(SignalGenerator &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void SignalGenerator(); @loc=static @len=22 @rva=2282048
	//_Func: public void ~SignalGenerator(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=11 @rva=2282080
	//_Data: this+0x8, Member, Type: float, freqScale
	//_Func: public void step(float dt); @intro @virtual vtpo=0 vfid=1 @loc=static @len=21 @rva=2282240
	//_Func: public float getValue(); @intro @pure @virtual vtpo=0 vfid=2 @loc=optimized @len=0 @rva=0
	//_Data: this+0xC, Member, Type: int, value
	//_Func: public SignalGenerator & operator=(SignalGenerator &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class SignalGenerator {
public:
	float freqScale;
	int value;
	inline SignalGenerator()  { }
	inline void ctor() { typedef void (*_fpt)(SignalGenerator *pthis); _fpt _f=(_fpt)_drva(2282048); _f(this); }
	virtual ~SignalGenerator();
	inline void dtor() { typedef void (*_fpt)(SignalGenerator *pthis); _fpt _f=(_fpt)_drva(2282080); _f(this); }
	virtual void step_vf1(float dt);
	inline void step_impl(float dt) { typedef void (*_fpt)(SignalGenerator *pthis, float); _fpt _f=(_fpt)_drva(2282240); return _f(this, dt); }
	inline void step(float dt) { return step_vf1(dt); }
	virtual float getValue_vf2() = 0;
	inline float getValue() { return getValue_vf2(); }
	inline void _guard_obj() {
		static_assert((sizeof(SignalGenerator)==16),"bad size");
		static_assert((offsetof(SignalGenerator,freqScale)==0x8),"bad off");
		static_assert((offsetof(SignalGenerator,value)==0xC),"bad off");
	};
};

//UDT: class ICoastGenerator @len=8 @vfcount=2
	//_VTable: 
	//_Func: public void ~ICoastGenerator(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=11 @rva=2693184
	//_Func: public float getCoastTorque(); @intro @pure @virtual vtpo=0 vfid=1 @loc=optimized @len=0 @rva=0
	//_Func: public void ICoastGenerator(ICoastGenerator &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ICoastGenerator(); @loc=optimized @len=0 @rva=0
	//_Func: public ICoastGenerator & operator=(ICoastGenerator &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class ICoastGenerator {
public:
	inline ICoastGenerator()  { }
	virtual ~ICoastGenerator();
	inline void dtor() { typedef void (*_fpt)(ICoastGenerator *pthis); _fpt _f=(_fpt)_drva(2693184); _f(this); }
	virtual float getCoastTorque_vf1() = 0;
	inline float getCoastTorque() { return getCoastTorque_vf1(); }
	inline void _guard_obj() {
		static_assert((sizeof(ICoastGenerator)==8),"bad size");
	};
};

//UDT: struct OnWindowResize @len=8
	//_Data: this+0x0, Member, Type: int, width
	//_Data: this+0x4, Member, Type: int, height
//UDT;

struct OnWindowResize {
public:
	int width;
	int height;
	inline OnWindowResize()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnWindowResize)==8),"bad size");
		static_assert((offsetof(OnWindowResize,width)==0x0),"bad off");
		static_assert((offsetof(OnWindowResize,height)==0x4),"bad off");
	};
};

//UDT: struct SamplerStates @len=56
	//_Data: this+0x0, Member, Type: void *, samplerAniso
	//_Data: this+0x8, Member, Type: void *, samplerLinearShadow
	//_Data: this+0x10, Member, Type: void *, samplerShadow
	//_Data: this+0x18, Member, Type: void *, samplerPoint
	//_Data: this+0x20, Member, Type: void *, samplerPointClamp
	//_Data: this+0x28, Member, Type: void *, samplerLinearSimple
	//_Data: this+0x30, Member, Type: void *, samplerLinearClamp
//UDT;

struct SamplerStates {
public:
	void * samplerAniso;
	void * samplerLinearShadow;
	void * samplerShadow;
	void * samplerPoint;
	void * samplerPointClamp;
	void * samplerLinearSimple;
	void * samplerLinearClamp;
	inline SamplerStates()  { }
	inline void _guard_obj() {
		static_assert((sizeof(SamplerStates)==56),"bad size");
		static_assert((offsetof(SamplerStates,samplerAniso)==0x0),"bad off");
		static_assert((offsetof(SamplerStates,samplerLinearShadow)==0x8),"bad off");
		static_assert((offsetof(SamplerStates,samplerShadow)==0x10),"bad off");
		static_assert((offsetof(SamplerStates,samplerPoint)==0x18),"bad off");
		static_assert((offsetof(SamplerStates,samplerPointClamp)==0x20),"bad off");
		static_assert((offsetof(SamplerStates,samplerLinearSimple)==0x28),"bad off");
		static_assert((offsetof(SamplerStates,samplerLinearClamp)==0x30),"bad off");
	};
};

//UDT: struct ERSStatus @len=8
	//_Data: this+0x0, Member, Type: float, kineticRecovery
	//_Data: this+0x4, Member, Type: float, heatRecovery
	//_Func: public void ERSStatus(); @loc=optimized @len=0 @rva=0
//UDT;

struct ERSStatus {
public:
	float kineticRecovery;
	float heatRecovery;
	inline ERSStatus()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ERSStatus)==8),"bad size");
		static_assert((offsetof(ERSStatus,kineticRecovery)==0x0),"bad off");
		static_assert((offsetof(ERSStatus,heatRecovery)==0x4),"bad off");
	};
};

//UDT: struct TyreSlipOutput @len=8
	//_Data: this+0x0, Member, Type: float, normalizedForce
	//_Data: this+0x4, Member, Type: float, slip
//UDT;

struct TyreSlipOutput {
public:
	float normalizedForce;
	float slip;
	inline TyreSlipOutput()  { }
	inline void _guard_obj() {
		static_assert((sizeof(TyreSlipOutput)==8),"bad size");
		static_assert((offsetof(TyreSlipOutput,normalizedForce)==0x0),"bad off");
		static_assert((offsetof(TyreSlipOutput,slip)==0x4),"bad off");
	};
};

//UDT: class GameTime @len=56 @vfcount=1
	//_VTable: 
	//_Func: public void GameTime(GameTime &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void GameTime(); @loc=static @len=62 @rva=4506064
	//_Func: public void ~GameTime(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=11 @rva=4506128
	//_Data: this+0x8, Member, Type: double, now
	//_Data: this+0x10, Member, Type: float, deltaT
	//_Data: this+0x14, Member, Type: float, smoothDeltaT
	//_Data: this+0x18, Member, Type: float, fps
	//_Data: this+0x1C, Member, Type: bool, useStabilizer
	//_Data: this+0x20, Member, Type: double, cappedFPS
	//_Data: this+0x28, Member, Type: double, startTime
	//_Func: public void update(); @loc=static @len=341 @rva=4506192
	//_Func: public bool isUsingHRT(); @loc=optimized @len=0 @rva=0
	//_Func: protected void initTimer(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x30, Member, Type: bool, m_isUsingHRT
	//_Func: public GameTime & operator=(GameTime &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class GameTime {
public:
	double now;
	float deltaT;
	float smoothDeltaT;
	float fps;
	bool useStabilizer;
	double cappedFPS;
	double startTime;
	bool m_isUsingHRT;
	inline GameTime()  { }
	inline void ctor() { typedef void (*_fpt)(GameTime *pthis); _fpt _f=(_fpt)_drva(4506064); _f(this); }
	virtual ~GameTime();
	inline void dtor() { typedef void (*_fpt)(GameTime *pthis); _fpt _f=(_fpt)_drva(4506128); _f(this); }
	inline void update() { typedef void (*_fpt)(GameTime *pthis); _fpt _f=(_fpt)_drva(4506192); return _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(GameTime)==56),"bad size");
		static_assert((offsetof(GameTime,now)==0x8),"bad off");
		static_assert((offsetof(GameTime,deltaT)==0x10),"bad off");
		static_assert((offsetof(GameTime,smoothDeltaT)==0x14),"bad off");
		static_assert((offsetof(GameTime,fps)==0x18),"bad off");
		static_assert((offsetof(GameTime,useStabilizer)==0x1C),"bad off");
		static_assert((offsetof(GameTime,cappedFPS)==0x20),"bad off");
		static_assert((offsetof(GameTime,startTime)==0x28),"bad off");
		static_assert((offsetof(GameTime,m_isUsingHRT)==0x30),"bad off");
	};
};

//UDT: struct ERSCockpitControls @len=3
	//_Data: this+0x0, Member, Type: bool, recovery
	//_Data: this+0x1, Member, Type: bool, mguHMode
	//_Data: this+0x2, Member, Type: bool, deliveryProfile
	//_Func: public void ERSCockpitControls(); @loc=optimized @len=0 @rva=0
//UDT;

struct ERSCockpitControls {
public:
	bool recovery;
	bool mguHMode;
	bool deliveryProfile;
	inline ERSCockpitControls()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ERSCockpitControls)==3),"bad size");
		static_assert((offsetof(ERSCockpitControls,recovery)==0x0),"bad off");
		static_assert((offsetof(ERSCockpitControls,mguHMode)==0x1),"bad off");
		static_assert((offsetof(ERSCockpitControls,deliveryProfile)==0x2),"bad off");
	};
};

//UDT: class CarControls @len=52
	//_Func: public void CarControls(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: bool, gearUp
	//_Data: this+0x1, Member, Type: bool, gearDn
	//_Data: this+0x2, Member, Type: bool, drs
	//_Data: this+0x3, Member, Type: bool, kers
	//_Data: this+0x4, Member, Type: bool, brakeBalanceUp
	//_Data: this+0x5, Member, Type: bool, brakeBalanceDn
	//_Data: this+0x8, Member, Type: int, requestedGearIndex
	//_Data: this+0xC, Member, Type: bool, isShifterSupported
	//_Data: this+0x10, Member, Type: float, handBrake
	//_Data: this+0x14, Member, Type: bool, absUp
	//_Data: this+0x15, Member, Type: bool, absDn
	//_Data: this+0x16, Member, Type: bool, tcUp
	//_Data: this+0x17, Member, Type: bool, tcDn
	//_Data: this+0x18, Member, Type: bool, turboUp
	//_Data: this+0x19, Member, Type: bool, turboDn
	//_Data: this+0x1A, Member, Type: bool, engineBrakeUp
	//_Data: this+0x1B, Member, Type: bool, engineBrakeDn
	//_Data: this+0x1C, Member, Type: bool, MGUKDeliveryUp
	//_Data: this+0x1D, Member, Type: bool, MGUKDeliveryDn
	//_Data: this+0x1E, Member, Type: bool, MGUKRecoveryUp
	//_Data: this+0x1F, Member, Type: bool, MGUKRecoveryDn
	//_Data: this+0x20, Member, Type: bool, MGUHMode
	//_Func: public void setSteer(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public float getSteer(); @loc=optimized @len=0 @rva=0
	//_Func: public void setGas(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public float getGas(); @loc=optimized @len=0 @rva=0
	//_Func: public void setBrake(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public float getBrake(); @loc=optimized @len=0 @rva=0
	//_Func: public void setClutch(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public float getClutch(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x24, Member, Type: float, gas
	//_Data: this+0x28, Member, Type: float, brake
	//_Data: this+0x2C, Member, Type: float, steer
	//_Data: this+0x30, Member, Type: float, clutch
//UDT;

class CarControls {
public:
	bool gearUp;
	bool gearDn;
	bool drs;
	bool kers;
	bool brakeBalanceUp;
	bool brakeBalanceDn;
	int requestedGearIndex;
	bool isShifterSupported;
	float handBrake;
	bool absUp;
	bool absDn;
	bool tcUp;
	bool tcDn;
	bool turboUp;
	bool turboDn;
	bool engineBrakeUp;
	bool engineBrakeDn;
	bool MGUKDeliveryUp;
	bool MGUKDeliveryDn;
	bool MGUKRecoveryUp;
	bool MGUKRecoveryDn;
	bool MGUHMode;
	float gas;
	float brake;
	float steer;
	float clutch;
	inline CarControls()  { }
	inline void _guard_obj() {
		static_assert((sizeof(CarControls)==52),"bad size");
		static_assert((offsetof(CarControls,gearUp)==0x0),"bad off");
		static_assert((offsetof(CarControls,gearDn)==0x1),"bad off");
		static_assert((offsetof(CarControls,drs)==0x2),"bad off");
		static_assert((offsetof(CarControls,kers)==0x3),"bad off");
		static_assert((offsetof(CarControls,brakeBalanceUp)==0x4),"bad off");
		static_assert((offsetof(CarControls,brakeBalanceDn)==0x5),"bad off");
		static_assert((offsetof(CarControls,requestedGearIndex)==0x8),"bad off");
		static_assert((offsetof(CarControls,isShifterSupported)==0xC),"bad off");
		static_assert((offsetof(CarControls,handBrake)==0x10),"bad off");
		static_assert((offsetof(CarControls,absUp)==0x14),"bad off");
		static_assert((offsetof(CarControls,absDn)==0x15),"bad off");
		static_assert((offsetof(CarControls,tcUp)==0x16),"bad off");
		static_assert((offsetof(CarControls,tcDn)==0x17),"bad off");
		static_assert((offsetof(CarControls,turboUp)==0x18),"bad off");
		static_assert((offsetof(CarControls,turboDn)==0x19),"bad off");
		static_assert((offsetof(CarControls,engineBrakeUp)==0x1A),"bad off");
		static_assert((offsetof(CarControls,engineBrakeDn)==0x1B),"bad off");
		static_assert((offsetof(CarControls,MGUKDeliveryUp)==0x1C),"bad off");
		static_assert((offsetof(CarControls,MGUKDeliveryDn)==0x1D),"bad off");
		static_assert((offsetof(CarControls,MGUKRecoveryUp)==0x1E),"bad off");
		static_assert((offsetof(CarControls,MGUKRecoveryDn)==0x1F),"bad off");
		static_assert((offsetof(CarControls,MGUHMode)==0x20),"bad off");
		static_assert((offsetof(CarControls,gas)==0x24),"bad off");
		static_assert((offsetof(CarControls,brake)==0x28),"bad off");
		static_assert((offsetof(CarControls,steer)==0x2C),"bad off");
		static_assert((offsetof(CarControls,clutch)==0x30),"bad off");
	};
};

//UDT: struct TyreModelInput @len=48
	//_Data: this+0x0, Member, Type: float, load
	//_Data: this+0x4, Member, Type: float, slipAngleRAD
	//_Data: this+0x8, Member, Type: float, slipRatio
	//_Data: this+0xC, Member, Type: float, camberRAD
	//_Data: this+0x10, Member, Type: float, speed
	//_Data: this+0x14, Member, Type: float, u
	//_Data: this+0x18, Member, Type: int, tyreIndex
	//_Data: this+0x1C, Member, Type: float, cpLength
	//_Data: this+0x20, Member, Type: float, grain
	//_Data: this+0x24, Member, Type: float, blister
	//_Data: this+0x28, Member, Type: float, pressureRatio
	//_Data: this+0x2C, Member, Type: bool, useSimpleModel
//UDT;

struct TyreModelInput {
public:
	float load;
	float slipAngleRAD;
	float slipRatio;
	float camberRAD;
	float speed;
	float u;
	int tyreIndex;
	float cpLength;
	float grain;
	float blister;
	float pressureRatio;
	bool useSimpleModel;
	inline TyreModelInput()  { }
	inline void _guard_obj() {
		static_assert((sizeof(TyreModelInput)==48),"bad size");
		static_assert((offsetof(TyreModelInput,load)==0x0),"bad off");
		static_assert((offsetof(TyreModelInput,slipAngleRAD)==0x4),"bad off");
		static_assert((offsetof(TyreModelInput,slipRatio)==0x8),"bad off");
		static_assert((offsetof(TyreModelInput,camberRAD)==0xC),"bad off");
		static_assert((offsetof(TyreModelInput,speed)==0x10),"bad off");
		static_assert((offsetof(TyreModelInput,u)==0x14),"bad off");
		static_assert((offsetof(TyreModelInput,tyreIndex)==0x18),"bad off");
		static_assert((offsetof(TyreModelInput,cpLength)==0x1C),"bad off");
		static_assert((offsetof(TyreModelInput,grain)==0x20),"bad off");
		static_assert((offsetof(TyreModelInput,blister)==0x24),"bad off");
		static_assert((offsetof(TyreModelInput,pressureRatio)==0x28),"bad off");
		static_assert((offsetof(TyreModelInput,useSimpleModel)==0x2C),"bad off");
	};
};

//UDT: class CBuffer @len=40
	//_Func: public void CBuffer(); @loc=static @len=27 @rva=2201856
	//_Func: public void CBuffer(int islot, int isize); @loc=static @len=104 @rva=2201744
	//_Func: public void ~CBuffer(); @loc=static @len=55 @rva=2202128
	//_Data: this+0x0, Member, Type: int, size
	//_Data: this+0x4, Member, Type: int, slot
	//_Data: this+0x8, Member, Type: bool, isSystem
	//_Data: this+0x9, Member, Type: bool, isPS
	//_Data: this+0xA, Member, Type: bool, isVS
	//_Data: this+0x10, Member, Type: void *, kid
	//_Func: public void set(int * value, int offset, int size); @loc=static @len=37 @rva=2202192
	//_Func: public void set(float * value, int offset, int size); @loc=static @len=37 @rva=2202192
	//_Func: public void get(int *  _arg0, int  _arg1, int  _arg2); @loc=optimized @len=0 @rva=0
	//_Func: public void get(float * value, int offset, int size); @loc=static @len=24 @rva=2201968
	//_Func: public void commit(); @loc=static @len=77 @rva=2201888
	//_Func: public void touch(); @loc=static @len=5 @rva=2202240
	//_Func: public void map(void * bdata, int bsize); @loc=static @len=28 @rva=2202096
	//_Func: public void init(int islot, int isize); @loc=static @len=82 @rva=2202000
	//_Func: public void release(); @loc=static @len=55 @rva=2202128
	//_Data: this+0x18, Member, Type: unsigned char *, data
	//_Data: this+0x20, Member, Type: bool, touched
	//_Func: public void __autoclassinit2(unsigned __int64  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class CBuffer {
public:
	int size;
	int slot;
	bool isSystem;
	bool isPS;
	bool isVS;
	void * kid;
	unsigned char * data;
	bool touched;
	inline CBuffer()  { }
	inline void ctor() { typedef void (*_fpt)(CBuffer *pthis); _fpt _f=(_fpt)_drva(2201856); _f(this); }
	inline void ctor(int islot, int isize) { typedef void (*_fpt)(CBuffer *pthis, int, int); _fpt _f=(_fpt)_drva(2201744); _f(this, islot, isize); }
	inline void dtor() { typedef void (*_fpt)(CBuffer *pthis); _fpt _f=(_fpt)_drva(2202128); _f(this); }
	inline void set(int * value, int offset, int size) { typedef void (*_fpt)(CBuffer *pthis, int *, int, int); _fpt _f=(_fpt)_drva(2202192); return _f(this, value, offset, size); }
	inline void set(float * value, int offset, int size) { typedef void (*_fpt)(CBuffer *pthis, float *, int, int); _fpt _f=(_fpt)_drva(2202192); return _f(this, value, offset, size); }
	inline void get(float * value, int offset, int size) { typedef void (*_fpt)(CBuffer *pthis, float *, int, int); _fpt _f=(_fpt)_drva(2201968); return _f(this, value, offset, size); }
	inline void commit() { typedef void (*_fpt)(CBuffer *pthis); _fpt _f=(_fpt)_drva(2201888); return _f(this); }
	inline void touch() { typedef void (*_fpt)(CBuffer *pthis); _fpt _f=(_fpt)_drva(2202240); return _f(this); }
	inline void map(void * bdata, int bsize) { typedef void (*_fpt)(CBuffer *pthis, void *, int); _fpt _f=(_fpt)_drva(2202096); return _f(this, bdata, bsize); }
	inline void init(int islot, int isize) { typedef void (*_fpt)(CBuffer *pthis, int, int); _fpt _f=(_fpt)_drva(2202000); return _f(this, islot, isize); }
	inline void release() { typedef void (*_fpt)(CBuffer *pthis); _fpt _f=(_fpt)_drva(2202128); return _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(CBuffer)==40),"bad size");
		static_assert((offsetof(CBuffer,size)==0x0),"bad off");
		static_assert((offsetof(CBuffer,slot)==0x4),"bad off");
		static_assert((offsetof(CBuffer,isSystem)==0x8),"bad off");
		static_assert((offsetof(CBuffer,isPS)==0x9),"bad off");
		static_assert((offsetof(CBuffer,isVS)==0xA),"bad off");
		static_assert((offsetof(CBuffer,kid)==0x10),"bad off");
		static_assert((offsetof(CBuffer,data)==0x18),"bad off");
		static_assert((offsetof(CBuffer,touched)==0x20),"bad off");
	};
};

//UDT: struct EngineStatus @len=24
	//_Data: this+0x0, Member, Type: double, outTorque
	//_Data: this+0x8, Member, Type: double, externalCoastTorque
	//_Data: this+0x10, Member, Type: float, turboBoost
	//_Data: this+0x14, Member, Type: bool, isLimiterOn
	//_Func: public void EngineStatus(); @loc=optimized @len=0 @rva=0
//UDT;

struct EngineStatus {
public:
	double outTorque;
	double externalCoastTorque;
	float turboBoost;
	bool isLimiterOn;
	inline EngineStatus()  { }
	inline void _guard_obj() {
		static_assert((sizeof(EngineStatus)==24),"bad size");
		static_assert((offsetof(EngineStatus,outTorque)==0x0),"bad off");
		static_assert((offsetof(EngineStatus,externalCoastTorque)==0x8),"bad off");
		static_assert((offsetof(EngineStatus,turboBoost)==0x10),"bad off");
		static_assert((offsetof(EngineStatus,isLimiterOn)==0x14),"bad off");
	};
};

//UDT: struct HeaveSpringStatus @len=4
	//_Func: public void HeaveSpringStatus(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, travel
//UDT;

struct HeaveSpringStatus {
public:
	float travel;
	inline HeaveSpringStatus()  { }
	inline void _guard_obj() {
		static_assert((sizeof(HeaveSpringStatus)==4),"bad size");
		static_assert((offsetof(HeaveSpringStatus,travel)==0x0),"bad off");
	};
};

//UDT: struct TyreSlipInput @len=24
	//_Func: public void TyreSlipInput(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, slip
	//_Data: this+0x4, Member, Type: float, friction
	//_Data: this+0x8, Member, Type: float, load
	//_Data: this+0xC, Member, Type: float, normalizedSlipX
	//_Data: this+0x10, Member, Type: float, normalizedSlipY
	//_Data: this+0x14, Member, Type: float, D
//UDT;

struct TyreSlipInput {
public:
	float slip;
	float friction;
	float load;
	float normalizedSlipX;
	float normalizedSlipY;
	float D;
	inline TyreSlipInput()  { }
	inline void _guard_obj() {
		static_assert((sizeof(TyreSlipInput)==24),"bad size");
		static_assert((offsetof(TyreSlipInput,slip)==0x0),"bad off");
		static_assert((offsetof(TyreSlipInput,friction)==0x4),"bad off");
		static_assert((offsetof(TyreSlipInput,load)==0x8),"bad off");
		static_assert((offsetof(TyreSlipInput,normalizedSlipX)==0xC),"bad off");
		static_assert((offsetof(TyreSlipInput,normalizedSlipY)==0x10),"bad off");
		static_assert((offsetof(TyreSlipInput,D)==0x14),"bad off");
	};
};

//UDT: class Damper @len=24
	//_Func: public void Damper(); @loc=static @len=45 @rva=2830928
	//_Func: public void ~Damper(); @loc=static @len=3 @rva=96368
	//_Data: this+0x0, Member, Type: float, reboundSlow
	//_Data: this+0x4, Member, Type: float, reboundFast
	//_Data: this+0x8, Member, Type: float, bumpSlow
	//_Data: this+0xC, Member, Type: float, bumpFast
	//_Data: this+0x10, Member, Type: float, fastThresholdBump
	//_Data: this+0x14, Member, Type: float, fastThresholdRebound
	//_Func: public float getForce(float v); @loc=static @len=119 @rva=2830976
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class Damper {
public:
	float reboundSlow;
	float reboundFast;
	float bumpSlow;
	float bumpFast;
	float fastThresholdBump;
	float fastThresholdRebound;
	inline Damper()  { }
	inline void ctor() { typedef void (*_fpt)(Damper *pthis); _fpt _f=(_fpt)_drva(2830928); _f(this); }
	inline void dtor() { typedef void (*_fpt)(Damper *pthis); _fpt _f=(_fpt)_drva(96368); _f(this); }
	inline float getForce(float v) { typedef float (*_fpt)(Damper *pthis, float); _fpt _f=(_fpt)_drva(2830976); return _f(this, v); }
	inline void _guard_obj() {
		static_assert((sizeof(Damper)==24),"bad size");
		static_assert((offsetof(Damper,reboundSlow)==0x0),"bad off");
		static_assert((offsetof(Damper,reboundFast)==0x4),"bad off");
		static_assert((offsetof(Damper,bumpSlow)==0x8),"bad off");
		static_assert((offsetof(Damper,bumpFast)==0xC),"bad off");
		static_assert((offsetof(Damper,fastThresholdBump)==0x10),"bad off");
		static_assert((offsetof(Damper,fastThresholdRebound)==0x14),"bad off");
	};
};

//UDT: struct ServerDrivingAssists @len=12
	//_Data: this+0x0, Member, Type: int, tc
	//_Data: this+0x4, Member, Type: int, abs
	//_Data: this+0x8, Member, Type: bool, stability
	//_Data: this+0x9, Member, Type: bool, autoClutch
	//_Func: public void ServerDrivingAssists(); @loc=optimized @len=0 @rva=0
//UDT;

struct ServerDrivingAssists {
public:
	int tc;
	int abs;
	bool stability;
	bool autoClutch;
	inline ServerDrivingAssists()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ServerDrivingAssists)==12),"bad size");
		static_assert((offsetof(ServerDrivingAssists,tc)==0x0),"bad off");
		static_assert((offsetof(ServerDrivingAssists,abs)==0x4),"bad off");
		static_assert((offsetof(ServerDrivingAssists,stability)==0x8),"bad off");
		static_assert((offsetof(ServerDrivingAssists,autoClutch)==0x9),"bad off");
	};
};

//UDT: struct PerformanceSplit @len=16
	//_Data: this+0x0, Member, Type: double, t
	//_Data: this+0x8, Member, Type: float, speedMS
	//_Func: public void PerformanceSplit(); @loc=optimized @len=0 @rva=0
//UDT;

struct PerformanceSplit {
public:
	double t;
	float speedMS;
	inline PerformanceSplit()  { }
	inline void _guard_obj() {
		static_assert((sizeof(PerformanceSplit)==16),"bad size");
		static_assert((offsetof(PerformanceSplit,t)==0x0),"bad off");
		static_assert((offsetof(PerformanceSplit,speedMS)==0x8),"bad off");
	};
};

//UDT: struct NetCarPushToPass @len=20
	//_Data: this+0x0, Member, Type: bool, enabled
	//_Data: this+0x1, Member, Type: bool, active
	//_Data: this+0x4, Member, Type: float, coolDownS
	//_Data: this+0x8, Member, Type: float, timeS
	//_Data: this+0xC, Member, Type: float, timeAccum
	//_Data: this+0x10, Member, Type: int, activations
	//_Func: public void NetCarPushToPass(); @loc=optimized @len=0 @rva=0
//UDT;

struct NetCarPushToPass {
public:
	bool enabled;
	bool active;
	float coolDownS;
	float timeS;
	float timeAccum;
	int activations;
	inline NetCarPushToPass()  { }
	inline void _guard_obj() {
		static_assert((sizeof(NetCarPushToPass)==20),"bad size");
		static_assert((offsetof(NetCarPushToPass,enabled)==0x0),"bad off");
		static_assert((offsetof(NetCarPushToPass,active)==0x1),"bad off");
		static_assert((offsetof(NetCarPushToPass,coolDownS)==0x4),"bad off");
		static_assert((offsetof(NetCarPushToPass,timeS)==0x8),"bad off");
		static_assert((offsetof(NetCarPushToPass,timeAccum)==0xC),"bad off");
		static_assert((offsetof(NetCarPushToPass,activations)==0x10),"bad off");
	};
};

//UDT: class Speed @len=4
	//_Func: private void Speed(float v); @loc=static @len=8 @rva=2333072
	//_Func: public void Speed(); @loc=static @len=10 @rva=2333024
	//_Func: public void ~Speed(); @loc=static @len=3 @rva=96368
	//_Func: public Speed fromMS(float ms); @pure @loc=static @len=8 @rva=2333072
	//_Func: public Speed fromKMH(float ms); @pure @loc=static @len=16 @rva=2333040
	//_Func: public Speed fromMPH(float ms); @pure @loc=static @len=16 @rva=2333056
	//_Data: static, [0155A5AE][0003:000475AE], Static Member, Type: bool, useMPH
	//_Func: public float ms(); @loc=optimized @len=0 @rva=0
	//_Func: public float kmh(); @loc=static @len=13 @rva=364368
	//_Func: public float mph(); @loc=optimized @len=0 @rva=0
	//_Func: public float toSystemDefault(); @loc=optimized @len=0 @rva=0
	//_Func: public Speed operator-(Speed &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public Speed operator+(Speed &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public Speed operator*(float v2); @loc=static @len=41 @rva=2502224
	//_Func: public Speed operator/(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, value
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class Speed {
public:
	float value;
	inline Speed()  { }
	inline void ctor(float v) { typedef void (*_fpt)(Speed *pthis, float); _fpt _f=(_fpt)_drva(2333072); _f(this, v); }
	inline void ctor() { typedef void (*_fpt)(Speed *pthis); _fpt _f=(_fpt)_drva(2333024); _f(this); }
	inline void dtor() { typedef void (*_fpt)(Speed *pthis); _fpt _f=(_fpt)_drva(96368); _f(this); }
	inline float kmh() { typedef float (*_fpt)(Speed *pthis); _fpt _f=(_fpt)_drva(364368); return _f(this); }
	inline Speed operator*(float v2) { typedef Speed (*_fpt)(Speed *pthis, float); _fpt _f=(_fpt)_drva(2502224); return _f(this, v2); }
	inline void _guard_obj() {
		static_assert((sizeof(Speed)==4),"bad size");
		static_assert((offsetof(Speed,value)==0x0),"bad off");
	};
};

//UDT: struct CommandItem @len=4
	//_Func: public void CommandItem(int akey); @loc=static @len=6 @rva=953184
	//_Func: public void CommandItem(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: int, key
//UDT;

struct CommandItem {
public:
	int key;
	inline CommandItem()  { }
	inline void ctor(int akey) { typedef void (*_fpt)(CommandItem *pthis, int); _fpt _f=(_fpt)_drva(953184); _f(this, akey); }
	inline void _guard_obj() {
		static_assert((sizeof(CommandItem)==4),"bad size");
		static_assert((offsetof(CommandItem,key)==0x0),"bad off");
	};
};

//UDT: struct GearElement @len=24
	//_Data: this+0x0, Member, Type: double, velocity
	//_Data: this+0x8, Member, Type: double, inertia
	//_Data: this+0x10, Member, Type: double, oldVelocity
	//_Func: public void GearElement(); @loc=optimized @len=0 @rva=0
//UDT;

struct GearElement {
public:
	double velocity;
	double inertia;
	double oldVelocity;
	inline GearElement()  { }
	inline void _guard_obj() {
		static_assert((sizeof(GearElement)==24),"bad size");
		static_assert((offsetof(GearElement,velocity)==0x0),"bad off");
		static_assert((offsetof(GearElement,inertia)==0x8),"bad off");
		static_assert((offsetof(GearElement,oldVelocity)==0x10),"bad off");
	};
};

//UDT: struct HDRLevels @len=8
	//_Func: public void HDRLevels(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, minExposure
	//_Data: this+0x4, Member, Type: float, maxExposure
//UDT;

struct HDRLevels {
public:
	float minExposure;
	float maxExposure;
	inline HDRLevels()  { }
	inline void _guard_obj() {
		static_assert((sizeof(HDRLevels)==8),"bad size");
		static_assert((offsetof(HDRLevels,minExposure)==0x0),"bad off");
		static_assert((offsetof(HDRLevels,maxExposure)==0x4),"bad off");
	};
};

//UDT: struct ACCarState @len=328
	//_Data: this+0x0, Member, Type: float[0x3], wheelLF_localPos
	//_Data: this+0xC, Member, Type: float[0x3], wheelRF_localPos
	//_Data: this+0x18, Member, Type: float[0x3], wheelLR_localPos
	//_Data: this+0x24, Member, Type: float[0x3], wheelRR_localPos
	//_Data: this+0x30, Member, Type: float[0x3], localVelocity
	//_Data: this+0x3C, Member, Type: float[0x3], worldVelocity
	//_Data: this+0x48, Member, Type: float[0x3], accG
	//_Data: this+0x54, Member, Type: float, engineRPMS
	//_Data: this+0x58, Member, Type: float[0x3], worldPosition
	//_Data: this+0x64, Member, Type: float[0x10], bodyMatrix
	//_Data: this+0xA4, Member, Type: int, gear
	//_Data: this+0xA8, Member, Type: bool, isEngineLimiterOn
	//_Data: this+0xAC, Member, Type: float[0x4], wheelAngularSpeed
	//_Data: this+0xBC, Member, Type: float, steer
	//_Data: this+0xC0, Member, Type: float, gas
	//_Data: this+0xC4, Member, Type: float, brake
	//_Data: this+0xC8, Member, Type: float, clutch
	//_Data: this+0xCC, Member, Type: float[0x3], localAngularVelocity
	//_Data: this+0xD8, Member, Type: float[0x4], ndSlip
	//_Data: this+0xE8, Member, Type: float[0x4], load
	//_Data: this+0xF8, Member, Type: float[0x4], Mz
	//_Data: this+0x108, Member, Type: float[0x4], tyreDirtyLevel
	//_Data: this+0x118, Member, Type: float, lastFF
	//_Data: this+0x11C, Member, Type: float, drivetrainSpeed
	//_Data: this+0x120, Member, Type: float, turboBoost
	//_Data: this+0x124, Member, Type: float, performanceMeter
	//_Data: this+0x128, Member, Type: bool, isGearGrinding
	//_Data: this+0x12C, Member, Type: float[0x5], damageZoneLevel
	//_Data: this+0x140, Member, Type: int, limiterRPM
	//_Data: this+0x144, Member, Type: float, speedMS
//UDT;

struct ACCarState {
public:
	float wheelLF_localPos[0x3];
	float wheelRF_localPos[0x3];
	float wheelLR_localPos[0x3];
	float wheelRR_localPos[0x3];
	float localVelocity[0x3];
	float worldVelocity[0x3];
	float accG[0x3];
	float engineRPMS;
	float worldPosition[0x3];
	float bodyMatrix[0x10];
	int gear;
	bool isEngineLimiterOn;
	float wheelAngularSpeed[0x4];
	float steer;
	float gas;
	float brake;
	float clutch;
	float localAngularVelocity[0x3];
	float ndSlip[0x4];
	float load[0x4];
	float Mz[0x4];
	float tyreDirtyLevel[0x4];
	float lastFF;
	float drivetrainSpeed;
	float turboBoost;
	float performanceMeter;
	bool isGearGrinding;
	float damageZoneLevel[0x5];
	int limiterRPM;
	float speedMS;
	inline ACCarState()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ACCarState)==328),"bad size");
		static_assert((offsetof(ACCarState,wheelLF_localPos)==0x0),"bad off");
		static_assert((offsetof(ACCarState,wheelRF_localPos)==0xC),"bad off");
		static_assert((offsetof(ACCarState,wheelLR_localPos)==0x18),"bad off");
		static_assert((offsetof(ACCarState,wheelRR_localPos)==0x24),"bad off");
		static_assert((offsetof(ACCarState,localVelocity)==0x30),"bad off");
		static_assert((offsetof(ACCarState,worldVelocity)==0x3C),"bad off");
		static_assert((offsetof(ACCarState,accG)==0x48),"bad off");
		static_assert((offsetof(ACCarState,engineRPMS)==0x54),"bad off");
		static_assert((offsetof(ACCarState,worldPosition)==0x58),"bad off");
		static_assert((offsetof(ACCarState,bodyMatrix)==0x64),"bad off");
		static_assert((offsetof(ACCarState,gear)==0xA4),"bad off");
		static_assert((offsetof(ACCarState,isEngineLimiterOn)==0xA8),"bad off");
		static_assert((offsetof(ACCarState,wheelAngularSpeed)==0xAC),"bad off");
		static_assert((offsetof(ACCarState,steer)==0xBC),"bad off");
		static_assert((offsetof(ACCarState,gas)==0xC0),"bad off");
		static_assert((offsetof(ACCarState,brake)==0xC4),"bad off");
		static_assert((offsetof(ACCarState,clutch)==0xC8),"bad off");
		static_assert((offsetof(ACCarState,localAngularVelocity)==0xCC),"bad off");
		static_assert((offsetof(ACCarState,ndSlip)==0xD8),"bad off");
		static_assert((offsetof(ACCarState,load)==0xE8),"bad off");
		static_assert((offsetof(ACCarState,Mz)==0xF8),"bad off");
		static_assert((offsetof(ACCarState,tyreDirtyLevel)==0x108),"bad off");
		static_assert((offsetof(ACCarState,lastFF)==0x118),"bad off");
		static_assert((offsetof(ACCarState,drivetrainSpeed)==0x11C),"bad off");
		static_assert((offsetof(ACCarState,turboBoost)==0x120),"bad off");
		static_assert((offsetof(ACCarState,performanceMeter)==0x124),"bad off");
		static_assert((offsetof(ACCarState,isGearGrinding)==0x128),"bad off");
		static_assert((offsetof(ACCarState,damageZoneLevel)==0x12C),"bad off");
		static_assert((offsetof(ACCarState,limiterRPM)==0x140),"bad off");
		static_assert((offsetof(ACCarState,speedMS)==0x144),"bad off");
	};
};

//UDT: struct WingOverrideDef @len=8
	//_Data: this+0x0, Member, Type: float, overrideAngle
	//_Data: this+0x4, Member, Type: bool, isActive
	//_Func: public void WingOverrideDef(); @loc=optimized @len=0 @rva=0
//UDT;

struct WingOverrideDef {
public:
	float overrideAngle;
	bool isActive;
	inline WingOverrideDef()  { }
	inline void _guard_obj() {
		static_assert((sizeof(WingOverrideDef)==8),"bad size");
		static_assert((offsetof(WingOverrideDef,overrideAngle)==0x0),"bad off");
		static_assert((offsetof(WingOverrideDef,isActive)==0x4),"bad off");
	};
};

//UDT: struct SurfaceDef @len=200
	//_Func: public void SurfaceDef(SurfaceDef &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void SurfaceDef(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: wchar_t[0x40], wavString
	//_Data: this+0x80, Member, Type: float, wavPitchSpeed
	//_Data: this+0x88, Member, Type: void *, userPointer
	//_Data: this+0x90, Member, Type: float, gripMod
	//_Data: this+0x94, Member, Type: int, sectorID
	//_Data: this+0x98, Member, Type: float, dirtAdditiveK
	//_Data: this+0x9C, Member, Type: unsigned int, collisionCategory
	//_Data: this+0xA0, Member, Type: bool, isValidTrack
	//_Data: this+0xA4, Member, Type: float, blackFlagTime
	//_Data: this+0xA8, Member, Type: float, sinHeight
	//_Data: this+0xAC, Member, Type: float, sinLength
	//_Data: this+0xB0, Member, Type: bool, isPitlane
	//_Data: this+0xB4, Member, Type: float, damping
	//_Data: this+0xB8, Member, Type: float, granularity
	//_Data: this+0xBC, Member, Type: float, vibrationGain
	//_Data: this+0xC0, Member, Type: float, vibrationLength
//UDT;

struct SurfaceDef {
public:
	wchar_t wavString[0x40];
	float wavPitchSpeed;
	void * userPointer;
	float gripMod;
	int sectorID;
	float dirtAdditiveK;
	unsigned int collisionCategory;
	bool isValidTrack;
	float blackFlagTime;
	float sinHeight;
	float sinLength;
	bool isPitlane;
	float damping;
	float granularity;
	float vibrationGain;
	float vibrationLength;
	inline SurfaceDef()  { }
	inline void _guard_obj() {
		static_assert((sizeof(SurfaceDef)==200),"bad size");
		static_assert((offsetof(SurfaceDef,wavString)==0x0),"bad off");
		static_assert((offsetof(SurfaceDef,wavPitchSpeed)==0x80),"bad off");
		static_assert((offsetof(SurfaceDef,userPointer)==0x88),"bad off");
		static_assert((offsetof(SurfaceDef,gripMod)==0x90),"bad off");
		static_assert((offsetof(SurfaceDef,sectorID)==0x94),"bad off");
		static_assert((offsetof(SurfaceDef,dirtAdditiveK)==0x98),"bad off");
		static_assert((offsetof(SurfaceDef,collisionCategory)==0x9C),"bad off");
		static_assert((offsetof(SurfaceDef,isValidTrack)==0xA0),"bad off");
		static_assert((offsetof(SurfaceDef,blackFlagTime)==0xA4),"bad off");
		static_assert((offsetof(SurfaceDef,sinHeight)==0xA8),"bad off");
		static_assert((offsetof(SurfaceDef,sinLength)==0xAC),"bad off");
		static_assert((offsetof(SurfaceDef,isPitlane)==0xB0),"bad off");
		static_assert((offsetof(SurfaceDef,damping)==0xB4),"bad off");
		static_assert((offsetof(SurfaceDef,granularity)==0xB8),"bad off");
		static_assert((offsetof(SurfaceDef,vibrationGain)==0xBC),"bad off");
		static_assert((offsetof(SurfaceDef,vibrationLength)==0xC0),"bad off");
	};
};

//UDT: class vec2f @len=8
	//_Data: this+0x0, Member, Type: float, x
	//_Data: this+0x4, Member, Type: float, y
	//_Func: public void vec2f(float ix, float iy); @loc=static @len=13 @rva=216944
	//_Func: public void vec2f(); @loc=optimized @len=0 @rva=0
	//_Func: public float length(); @loc=optimized @len=0 @rva=0
	//_Func: public void normalize(); @loc=optimized @len=0 @rva=0
//UDT;

class vec2f {
public:
	float x;
	float y;
	inline vec2f()  { }
	inline void ctor(float ix, float iy) { typedef void (*_fpt)(vec2f *pthis, float, float); _fpt _f=(_fpt)_drva(216944); _f(this, ix, iy); }
	inline void _guard_obj() {
		static_assert((sizeof(vec2f)==8),"bad size");
		static_assert((offsetof(vec2f,x)==0x0),"bad off");
		static_assert((offsetof(vec2f,y)==0x4),"bad off");
	};
};

//UDT: struct TyreModelOutput @len=28
	//_Data: this+0x0, Member, Type: float, Fy
	//_Data: this+0x4, Member, Type: float, Fx
	//_Data: this+0x8, Member, Type: float, Mz
	//_Data: this+0xC, Member, Type: float, trail
	//_Data: this+0x10, Member, Type: float, ndSlip
	//_Data: this+0x14, Member, Type: float, Dy
	//_Data: this+0x18, Member, Type: float, Dx
//UDT;

struct TyreModelOutput {
public:
	float Fy;
	float Fx;
	float Mz;
	float trail;
	float ndSlip;
	float Dy;
	float Dx;
	inline TyreModelOutput()  { }
	inline void _guard_obj() {
		static_assert((sizeof(TyreModelOutput)==28),"bad size");
		static_assert((offsetof(TyreModelOutput,Fy)==0x0),"bad off");
		static_assert((offsetof(TyreModelOutput,Fx)==0x4),"bad off");
		static_assert((offsetof(TyreModelOutput,Mz)==0x8),"bad off");
		static_assert((offsetof(TyreModelOutput,trail)==0xC),"bad off");
		static_assert((offsetof(TyreModelOutput,ndSlip)==0x10),"bad off");
		static_assert((offsetof(TyreModelOutput,Dy)==0x14),"bad off");
		static_assert((offsetof(TyreModelOutput,Dx)==0x18),"bad off");
	};
};

//UDT: struct ClientRules @len=4
	//_Data: this+0x0, Member, Type: float, maxMetersWrongWay
	//_Func: public void ClientRules(); @loc=optimized @len=0 @rva=0
//UDT;

struct ClientRules {
public:
	float maxMetersWrongWay;
	inline ClientRules()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ClientRules)==4),"bad size");
		static_assert((offsetof(ClientRules,maxMetersWrongWay)==0x0),"bad off");
	};
};

//UDT: struct PitStopTimings @len=20
	//_Data: this+0x0, Member, Type: float, tyreChangeTimeSec
	//_Data: this+0x4, Member, Type: float, fuelChangeTimeSec
	//_Data: this+0x8, Member, Type: float, bodyRepairTimeSec
	//_Data: this+0xC, Member, Type: float, engineRepairTimeSec
	//_Data: this+0x10, Member, Type: float, suspRepairTimeSec
	//_Func: public void PitStopTimings(); @loc=optimized @len=0 @rva=0
//UDT;

struct PitStopTimings {
public:
	float tyreChangeTimeSec;
	float fuelChangeTimeSec;
	float bodyRepairTimeSec;
	float engineRepairTimeSec;
	float suspRepairTimeSec;
	inline PitStopTimings()  { }
	inline void _guard_obj() {
		static_assert((sizeof(PitStopTimings)==20),"bad size");
		static_assert((offsetof(PitStopTimings,tyreChangeTimeSec)==0x0),"bad off");
		static_assert((offsetof(PitStopTimings,fuelChangeTimeSec)==0x4),"bad off");
		static_assert((offsetof(PitStopTimings,bodyRepairTimeSec)==0x8),"bad off");
		static_assert((offsetof(PitStopTimings,engineRepairTimeSec)==0xC),"bad off");
		static_assert((offsetof(PitStopTimings,suspRepairTimeSec)==0x10),"bad off");
	};
};

//UDT: struct ksgui::GUI::FormData @len=16
	//_Data: this+0x0, Member, Type: float, x
	//_Data: this+0x4, Member, Type: float, y
	//_Data: this+0x8, Member, Type: bool, visible
	//_Data: this+0x9, Member, Type: bool, blocked
	//_Data: this+0xC, Member, Type: float, scale
	//_Func: public void FormData(); @loc=optimized @len=0 @rva=0
//UDT;

struct ksgui_GUI_FormData {
public:
	float x;
	float y;
	bool visible;
	bool blocked;
	float scale;
	inline ksgui_GUI_FormData()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_GUI_FormData)==16),"bad size");
		static_assert((offsetof(ksgui_GUI_FormData,x)==0x0),"bad off");
		static_assert((offsetof(ksgui_GUI_FormData,y)==0x4),"bad off");
		static_assert((offsetof(ksgui_GUI_FormData,visible)==0x8),"bad off");
		static_assert((offsetof(ksgui_GUI_FormData,blocked)==0x9),"bad off");
		static_assert((offsetof(ksgui_GUI_FormData,scale)==0xC),"bad off");
	};
};

//UDT: class Trigger @len=12
	//_Func: public void Trigger(); @loc=static @len=13 @rva=2339728
	//_Func: public void ~Trigger(); @loc=static @len=3 @rva=96368
	//_Func: public bool hasSwitchedState(bool  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public bool ignoreSubsequentTrue(bool value); @loc=static @len=32 @rva=2339744
	//_Func: public bool keepSteady(float dt, bool value); @loc=static @len=60 @rva=2339776
	//_Func: public bool turnOn(bool  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public bool turnOff(bool  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void setAccumulatorLimit(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: bool, state
	//_Data: this+0x1, Member, Type: bool, lastState
	//_Data: this+0x4, Member, Type: float, accumulator
	//_Data: this+0x8, Member, Type: float, accumulatorLimit
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class Trigger {
public:
	bool state;
	bool lastState;
	float accumulator;
	float accumulatorLimit;
	inline Trigger()  { }
	inline void ctor() { typedef void (*_fpt)(Trigger *pthis); _fpt _f=(_fpt)_drva(2339728); _f(this); }
	inline void dtor() { typedef void (*_fpt)(Trigger *pthis); _fpt _f=(_fpt)_drva(96368); _f(this); }
	inline bool ignoreSubsequentTrue(bool value) { typedef bool (*_fpt)(Trigger *pthis, bool); _fpt _f=(_fpt)_drva(2339744); return _f(this, value); }
	inline bool keepSteady(float dt, bool value) { typedef bool (*_fpt)(Trigger *pthis, float, bool); _fpt _f=(_fpt)_drva(2339776); return _f(this, dt, value); }
	inline void _guard_obj() {
		static_assert((sizeof(Trigger)==12),"bad size");
		static_assert((offsetof(Trigger,state)==0x0),"bad off");
		static_assert((offsetof(Trigger,lastState)==0x1),"bad off");
		static_assert((offsetof(Trigger,accumulator)==0x4),"bad off");
		static_assert((offsetof(Trigger,accumulatorLimit)==0x8),"bad off");
	};
};

//UDT: struct SteerMzLowSpeedReduction @len=8
	//_Data: this+0x0, Member, Type: float, speedKMH
	//_Data: this+0x4, Member, Type: float, minValue
	//_Func: public void SteerMzLowSpeedReduction(); @loc=optimized @len=0 @rva=0
//UDT;

struct SteerMzLowSpeedReduction {
public:
	float speedKMH;
	float minValue;
	inline SteerMzLowSpeedReduction()  { }
	inline void _guard_obj() {
		static_assert((sizeof(SteerMzLowSpeedReduction)==8),"bad size");
		static_assert((offsetof(SteerMzLowSpeedReduction,speedKMH)==0x0),"bad off");
		static_assert((offsetof(SteerMzLowSpeedReduction,minValue)==0x4),"bad off");
	};
};

//UDT: struct CoreCPUTimes @len=24
	//_Data: this+0x0, Member, Type: double, solverTime
	//_Data: this+0x8, Member, Type: double, collisionTime
	//_Data: this+0x10, Member, Type: int, contactPoints
	//_Data: this+0x14, Member, Type: int, narrowPhaseTests
	//_Func: public void CoreCPUTimes(); @loc=optimized @len=0 @rva=0
//UDT;

struct CoreCPUTimes {
public:
	double solverTime;
	double collisionTime;
	int contactPoints;
	int narrowPhaseTests;
	inline CoreCPUTimes()  { }
	inline void _guard_obj() {
		static_assert((sizeof(CoreCPUTimes)==24),"bad size");
		static_assert((offsetof(CoreCPUTimes,solverTime)==0x0),"bad off");
		static_assert((offsetof(CoreCPUTimes,collisionTime)==0x8),"bad off");
		static_assert((offsetof(CoreCPUTimes,contactPoints)==0x10),"bad off");
		static_assert((offsetof(CoreCPUTimes,narrowPhaseTests)==0x14),"bad off");
	};
};

//UDT: struct DownshiftProtection @len=12
	//_Data: this+0x0, Member, Type: bool, isActive
	//_Data: this+0x1, Member, Type: bool, isDebug
	//_Data: this+0x4, Member, Type: int, overrev
	//_Data: this+0x8, Member, Type: bool, lockN
	//_Func: public void DownshiftProtection(); @loc=optimized @len=0 @rva=0
//UDT;

struct DownshiftProtection {
public:
	bool isActive;
	bool isDebug;
	int overrev;
	bool lockN;
	inline DownshiftProtection()  { }
	inline void _guard_obj() {
		static_assert((sizeof(DownshiftProtection)==12),"bad size");
		static_assert((offsetof(DownshiftProtection,isActive)==0x0),"bad off");
		static_assert((offsetof(DownshiftProtection,isDebug)==0x1),"bad off");
		static_assert((offsetof(DownshiftProtection,overrev)==0x4),"bad off");
		static_assert((offsetof(DownshiftProtection,lockN)==0x8),"bad off");
	};
};

//UDT: struct TurboDef @len=28
	//_Func: public void TurboDef(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, maxBoost
	//_Data: this+0x4, Member, Type: float, lagUP
	//_Data: this+0x8, Member, Type: float, lagDN
	//_Data: this+0xC, Member, Type: float, rpmRef
	//_Data: this+0x10, Member, Type: float, gamma
	//_Data: this+0x14, Member, Type: float, wastegate
	//_Data: this+0x18, Member, Type: bool, isAdjustable
//UDT;

struct TurboDef {
public:
	float maxBoost;
	float lagUP;
	float lagDN;
	float rpmRef;
	float gamma;
	float wastegate;
	bool isAdjustable;
	inline TurboDef()  { }
	inline void _guard_obj() {
		static_assert((sizeof(TurboDef)==28),"bad size");
		static_assert((offsetof(TurboDef,maxBoost)==0x0),"bad off");
		static_assert((offsetof(TurboDef,lagUP)==0x4),"bad off");
		static_assert((offsetof(TurboDef,lagDN)==0x8),"bad off");
		static_assert((offsetof(TurboDef,rpmRef)==0xC),"bad off");
		static_assert((offsetof(TurboDef,gamma)==0x10),"bad off");
		static_assert((offsetof(TurboDef,wastegate)==0x14),"bad off");
		static_assert((offsetof(TurboDef,isAdjustable)==0x18),"bad off");
	};
};

//UDT: struct OnWindowClosedEvent @len=8
	//_Func: public void OnWindowClosedEvent(RenderWindow *  _arg0); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class RenderWindow *, renderWindow
//UDT;

struct OnWindowClosedEvent {
public:
	RenderWindow * renderWindow;
	inline OnWindowClosedEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnWindowClosedEvent)==8),"bad size");
		static_assert((offsetof(OnWindowClosedEvent,renderWindow)==0x0),"bad off");
	};
};

//UDT: struct ClientRemoteCarDef @len=216
	//_Data: this+0x0, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, model
	//_Data: this+0x20, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, config
	//_Data: this+0x40, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, skin
	//_Data: this+0x60, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, driverName
	//_Data: this+0x80, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, team
	//_Data: this+0xA0, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, nationCode
	//_Data: this+0xC0, Member, Type: unsigned char, sessionID
	//_Data: this+0xC4, Member, Type: float[0x5], damageZoneLevel
	//_Func: public void ClientRemoteCarDef(ClientRemoteCarDef & __that); @loc=static @len=314 @rva=241776
	//_Func: public void ClientRemoteCarDef(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~ClientRemoteCarDef(); @loc=static @len=246 @rva=246128
	//_Func: public ClientRemoteCarDef & operator=(ClientRemoteCarDef &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct ClientRemoteCarDef {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > model;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > config;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > skin;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > driverName;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > team;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > nationCode;
	unsigned char sessionID;
	float damageZoneLevel[0x5];
	inline ClientRemoteCarDef()  { }
	inline void ctor(ClientRemoteCarDef & __that) { typedef void (*_fpt)(ClientRemoteCarDef *pthis, ClientRemoteCarDef &); _fpt _f=(_fpt)_drva(241776); _f(this, __that); }
	inline void dtor() { typedef void (*_fpt)(ClientRemoteCarDef *pthis); _fpt _f=(_fpt)_drva(246128); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(ClientRemoteCarDef)==216),"bad size");
		static_assert((offsetof(ClientRemoteCarDef,model)==0x0),"bad off");
		static_assert((offsetof(ClientRemoteCarDef,config)==0x20),"bad off");
		static_assert((offsetof(ClientRemoteCarDef,skin)==0x40),"bad off");
		static_assert((offsetof(ClientRemoteCarDef,driverName)==0x60),"bad off");
		static_assert((offsetof(ClientRemoteCarDef,team)==0x80),"bad off");
		static_assert((offsetof(ClientRemoteCarDef,nationCode)==0xA0),"bad off");
		static_assert((offsetof(ClientRemoteCarDef,sessionID)==0xC0),"bad off");
		static_assert((offsetof(ClientRemoteCarDef,damageZoneLevel)==0xC4),"bad off");
	};
};

//UDT: struct DriftModeComponent @len=80
	//_Func: public void ~DriftModeComponent(); @loc=static @len=3 @rva=96368
	//_Func: public double getPoints(); @loc=optimized @len=0 @rva=0
	//_Func: public double getInstantPoints(); @loc=optimized @len=0 @rva=0
	//_Func: public bool isExtremeDrifting(); @loc=optimized @len=0 @rva=0
	//_Func: public bool isValid(); @loc=optimized @len=0 @rva=0
	//_Func: public double getCurrentSpeedMult(); @loc=optimized @len=0 @rva=0
	//_Func: public double getCurrentDriftAngle(); @loc=optimized @len=0 @rva=0
	//_Func: public int getComboCounter(); @loc=optimized @len=0 @rva=0
	//_Func: public void init(Car * car); @loc=static @len=380 @rva=2882976
	//_Func: public void step(float dt); @loc=static @len=846 @rva=2883360
	//_Data: this+0x0, Member, Type: class Car *, car
	//_Data: this+0x8, Member, Type: float, driftStraightTimer
	//_Data: this+0x10, Member, Type: double, points
	//_Data: this+0x18, Member, Type: double, instantDrift
	//_Data: this+0x20, Member, Type: double, currentSpeedMultiplier
	//_Data: this+0x28, Member, Type: double, currentDriftAngle
	//_Data: this+0x30, Member, Type: int, comboCounter
	//_Data: this+0x34, Member, Type: int, lastDriftDirection
	//_Data: this+0x38, Member, Type: bool, extremeDrifting
	//_Data: this+0x39, Member, Type: bool, drifting
	//_Data: this+0x3A, Member, Type: bool, invalid
	//_Data: this+0x3C, Member, Type: float[0x5], oldDamageZones
	//_Func: private bool checkExtremeDrifting(); @loc=static @len=321 @rva=2882640
	//_Func: private bool hasCarBeenDamaged(); @loc=optimized @len=0 @rva=0
	//_Func: private void validateDrift(); @loc=static @len=347 @rva=2884208
	//_Func: public void DriftModeComponent(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct DriftModeComponent {
public:
	Car * car;
	float driftStraightTimer;
	double points;
	double instantDrift;
	double currentSpeedMultiplier;
	double currentDriftAngle;
	int comboCounter;
	int lastDriftDirection;
	bool extremeDrifting;
	bool drifting;
	bool invalid;
	float oldDamageZones[0x5];
	inline DriftModeComponent()  { }
	inline void dtor() { typedef void (*_fpt)(DriftModeComponent *pthis); _fpt _f=(_fpt)_drva(96368); _f(this); }
	inline void init(Car * car) { typedef void (*_fpt)(DriftModeComponent *pthis, Car *); _fpt _f=(_fpt)_drva(2882976); return _f(this, car); }
	inline void step(float dt) { typedef void (*_fpt)(DriftModeComponent *pthis, float); _fpt _f=(_fpt)_drva(2883360); return _f(this, dt); }
	inline bool checkExtremeDrifting() { typedef bool (*_fpt)(DriftModeComponent *pthis); _fpt _f=(_fpt)_drva(2882640); return _f(this); }
	inline void validateDrift() { typedef void (*_fpt)(DriftModeComponent *pthis); _fpt _f=(_fpt)_drva(2884208); return _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(DriftModeComponent)==80),"bad size");
		static_assert((offsetof(DriftModeComponent,car)==0x0),"bad off");
		static_assert((offsetof(DriftModeComponent,driftStraightTimer)==0x8),"bad off");
		static_assert((offsetof(DriftModeComponent,points)==0x10),"bad off");
		static_assert((offsetof(DriftModeComponent,instantDrift)==0x18),"bad off");
		static_assert((offsetof(DriftModeComponent,currentSpeedMultiplier)==0x20),"bad off");
		static_assert((offsetof(DriftModeComponent,currentDriftAngle)==0x28),"bad off");
		static_assert((offsetof(DriftModeComponent,comboCounter)==0x30),"bad off");
		static_assert((offsetof(DriftModeComponent,lastDriftDirection)==0x34),"bad off");
		static_assert((offsetof(DriftModeComponent,extremeDrifting)==0x38),"bad off");
		static_assert((offsetof(DriftModeComponent,drifting)==0x39),"bad off");
		static_assert((offsetof(DriftModeComponent,invalid)==0x3A),"bad off");
		static_assert((offsetof(DriftModeComponent,oldDamageZones)==0x3C),"bad off");
	};
};

//UDT: struct AutoShifter @len=40
	//_Func: public void ~AutoShifter(); @loc=static @len=3 @rva=96368
	//_Data: this+0x0, Member, Type: bool, isActive
	//_Data: this+0x4, Member, Type: int, changeUpRpm
	//_Data: this+0x8, Member, Type: int, changeDnRpm
	//_Data: this+0xC, Member, Type: float, slipThreshold
	//_Func: public void init(Car * car); @loc=static @len=44 @rva=2859040
	//_Func: public void step(float dt); @loc=static @len=843 @rva=2861040
	//_Data: this+0x10, Member, Type: class Car *, car
	//_Data: this+0x18, Member, Type: bool, butGearUp
	//_Data: this+0x19, Member, Type: bool, butGearDn
	//_Data: this+0x1C, Member, Type: float, gasCutoff
	//_Data: this+0x20, Member, Type: float, gasCutoffTime
	//_Func: private void loadINI(); @loc=static @len=1946 @rva=2859088
	//_Func: public void AutoShifter(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct AutoShifter {
public:
	bool isActive;
	int changeUpRpm;
	int changeDnRpm;
	float slipThreshold;
	Car * car;
	bool butGearUp;
	bool butGearDn;
	float gasCutoff;
	float gasCutoffTime;
	inline AutoShifter()  { }
	inline void dtor() { typedef void (*_fpt)(AutoShifter *pthis); _fpt _f=(_fpt)_drva(96368); _f(this); }
	inline void init(Car * car) { typedef void (*_fpt)(AutoShifter *pthis, Car *); _fpt _f=(_fpt)_drva(2859040); return _f(this, car); }
	inline void step(float dt) { typedef void (*_fpt)(AutoShifter *pthis, float); _fpt _f=(_fpt)_drva(2861040); return _f(this, dt); }
	inline void loadINI() { typedef void (*_fpt)(AutoShifter *pthis); _fpt _f=(_fpt)_drva(2859088); return _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(AutoShifter)==40),"bad size");
		static_assert((offsetof(AutoShifter,isActive)==0x0),"bad off");
		static_assert((offsetof(AutoShifter,changeUpRpm)==0x4),"bad off");
		static_assert((offsetof(AutoShifter,changeDnRpm)==0x8),"bad off");
		static_assert((offsetof(AutoShifter,slipThreshold)==0xC),"bad off");
		static_assert((offsetof(AutoShifter,car)==0x10),"bad off");
		static_assert((offsetof(AutoShifter,butGearUp)==0x18),"bad off");
		static_assert((offsetof(AutoShifter,butGearDn)==0x19),"bad off");
		static_assert((offsetof(AutoShifter,gasCutoff)==0x1C),"bad off");
		static_assert((offsetof(AutoShifter,gasCutoffTime)==0x20),"bad off");
	};
};

//UDT: struct ClientHandshakeResult @len=144
	//_Data: this+0x0, Member, Type: bool, success
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, model
	//_Data: this+0x28, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, skin
	//_Data: this+0x48, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, track
	//_Data: this+0x68, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, track_config
	//_Data: this+0x88, Member, Type: float, sunAngle
	//_Data: this+0x8C, Member, Type: unsigned char, sessionID
	//_Func: public void ClientHandshakeResult(ClientHandshakeResult & __that); @loc=static @len=229 @rva=241536
	//_Func: public void ClientHandshakeResult(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~ClientHandshakeResult(); @loc=static @len=160 @rva=245968
	//_Func: public ClientHandshakeResult & operator=(ClientHandshakeResult &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct ClientHandshakeResult {
public:
	bool success;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > model;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > skin;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > track;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > track_config;
	float sunAngle;
	unsigned char sessionID;
	inline ClientHandshakeResult()  { }
	inline void ctor(ClientHandshakeResult & __that) { typedef void (*_fpt)(ClientHandshakeResult *pthis, ClientHandshakeResult &); _fpt _f=(_fpt)_drva(241536); _f(this, __that); }
	inline void dtor() { typedef void (*_fpt)(ClientHandshakeResult *pthis); _fpt _f=(_fpt)_drva(245968); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(ClientHandshakeResult)==144),"bad size");
		static_assert((offsetof(ClientHandshakeResult,success)==0x0),"bad off");
		static_assert((offsetof(ClientHandshakeResult,model)==0x8),"bad off");
		static_assert((offsetof(ClientHandshakeResult,skin)==0x28),"bad off");
		static_assert((offsetof(ClientHandshakeResult,track)==0x48),"bad off");
		static_assert((offsetof(ClientHandshakeResult,track_config)==0x68),"bad off");
		static_assert((offsetof(ClientHandshakeResult,sunAngle)==0x88),"bad off");
		static_assert((offsetof(ClientHandshakeResult,sessionID)==0x8C),"bad off");
	};
};

//UDT: struct EDL @len=56
	//_Func: public void ~EDL(); @loc=static @len=3 @rva=96368
	//_Data: this+0x0, Member, Type: bool, isPresent
	//_Data: this+0x1, Member, Type: bool, isActive
	//_Data: this+0x4, Member, Type: float, wheelSpeedGainPower
	//_Data: this+0x8, Member, Type: float, wheelSpeedGainCoast
	//_Data: this+0xC, Member, Type: float, deadZonePower
	//_Data: this+0x10, Member, Type: float, deadZoneCoast
	//_Data: this+0x14, Member, Type: float, brakeTorquePower
	//_Data: this+0x18, Member, Type: float, brakeTorqueCoast
	//_Data: this+0x1C, Member, Type: float, outLevel
	//_Data: this+0x20, Member, Type: float, outBrakeTorque
	//_Data: this+0x24, Member, Type: float, speedDiff
	//_Func: public void step(float td); @loc=static @len=414 @rva=2864224
	//_Func: public void init(Car * a_car); @loc=static @len=2145 @rva=2862064
	//_Data: this+0x28, Member, Type: class Car *, car
	//_Data: this+0x30, Member, Type: int, leftTyreIndex
	//_Data: this+0x34, Member, Type: int, rightTyreIndex
	//_Func: public void EDL(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct EDL {
public:
	bool isPresent;
	bool isActive;
	float wheelSpeedGainPower;
	float wheelSpeedGainCoast;
	float deadZonePower;
	float deadZoneCoast;
	float brakeTorquePower;
	float brakeTorqueCoast;
	float outLevel;
	float outBrakeTorque;
	float speedDiff;
	Car * car;
	int leftTyreIndex;
	int rightTyreIndex;
	inline EDL()  { }
	inline void dtor() { typedef void (*_fpt)(EDL *pthis); _fpt _f=(_fpt)_drva(96368); _f(this); }
	inline void step(float td) { typedef void (*_fpt)(EDL *pthis, float); _fpt _f=(_fpt)_drva(2864224); return _f(this, td); }
	inline void init(Car * a_car) { typedef void (*_fpt)(EDL *pthis, Car *); _fpt _f=(_fpt)_drva(2862064); return _f(this, a_car); }
	inline void _guard_obj() {
		static_assert((sizeof(EDL)==56),"bad size");
		static_assert((offsetof(EDL,isPresent)==0x0),"bad off");
		static_assert((offsetof(EDL,isActive)==0x1),"bad off");
		static_assert((offsetof(EDL,wheelSpeedGainPower)==0x4),"bad off");
		static_assert((offsetof(EDL,wheelSpeedGainCoast)==0x8),"bad off");
		static_assert((offsetof(EDL,deadZonePower)==0xC),"bad off");
		static_assert((offsetof(EDL,deadZoneCoast)==0x10),"bad off");
		static_assert((offsetof(EDL,brakeTorquePower)==0x14),"bad off");
		static_assert((offsetof(EDL,brakeTorqueCoast)==0x18),"bad off");
		static_assert((offsetof(EDL,outLevel)==0x1C),"bad off");
		static_assert((offsetof(EDL,outBrakeTorque)==0x20),"bad off");
		static_assert((offsetof(EDL,speedDiff)==0x24),"bad off");
		static_assert((offsetof(EDL,car)==0x28),"bad off");
		static_assert((offsetof(EDL,leftTyreIndex)==0x30),"bad off");
		static_assert((offsetof(EDL,rightTyreIndex)==0x34),"bad off");
	};
};

//UDT: class FileChangeObserver @len=48
	//_Func: public void FileChangeObserver(FileChangeObserver &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void FileChangeObserver(); @loc=optimized @len=0 @rva=0
	//_Func: public void FileChangeObserver(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & a_filename); @loc=static @len=55 @rva=2339840
	//_Func: public void ~FileChangeObserver(); @loc=static @len=49 @rva=2180672
	//_Func: public bool hasChanged(); @loc=static @len=47 @rva=2339904
	//_Func: public void reset(); @loc=static @len=162 @rva=2340144
	//_Func: public void observe(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & a_filename); @loc=static @len=191 @rva=2339952
	//_Data: this+0x0, Member, Type: struct _FILETIME, lastFileTime
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, filename
	//_Data: this+0x28, Member, Type: unsigned long, lastChanged
	//_Func: private bool getFileTime(_FILETIME &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public FileChangeObserver & operator=(FileChangeObserver &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class FileChangeObserver {
public:
	_FILETIME lastFileTime;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > filename;
	unsigned long lastChanged;
	inline FileChangeObserver()  { }
	inline void ctor(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & a_filename) { typedef void (*_fpt)(FileChangeObserver *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &); _fpt _f=(_fpt)_drva(2339840); _f(this, a_filename); }
	inline void dtor() { typedef void (*_fpt)(FileChangeObserver *pthis); _fpt _f=(_fpt)_drva(2180672); _f(this); }
	inline bool hasChanged() { typedef bool (*_fpt)(FileChangeObserver *pthis); _fpt _f=(_fpt)_drva(2339904); return _f(this); }
	inline void reset() { typedef void (*_fpt)(FileChangeObserver *pthis); _fpt _f=(_fpt)_drva(2340144); return _f(this); }
	inline void observe(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & a_filename) { typedef void (*_fpt)(FileChangeObserver *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &); _fpt _f=(_fpt)_drva(2339952); return _f(this, a_filename); }
	inline void _guard_obj() {
		static_assert((sizeof(FileChangeObserver)==48),"bad size");
		static_assert((offsetof(FileChangeObserver,lastFileTime)==0x0),"bad off");
		static_assert((offsetof(FileChangeObserver,filename)==0x8),"bad off");
		static_assert((offsetof(FileChangeObserver,lastChanged)==0x28),"bad off");
	};
};

//UDT: struct sockaddr_in @len=16
	//_Data: this+0x0, Member, Type: unsigned short, sin_family
	//_Data: this+0x2, Member, Type: unsigned short, sin_port
	//_Data: this+0x4, Member, Type: struct in_addr, sin_addr
	//_Data: this+0x8, Member, Type: char[0x8], sin_zero
//UDT;

struct sockaddr_in {
public:
	unsigned short sin_family;
	unsigned short sin_port;
	in_addr sin_addr;
	char sin_zero[0x8];
	inline sockaddr_in()  { }
	inline void _guard_obj() {
		static_assert((sizeof(sockaddr_in)==16),"bad size");
		static_assert((offsetof(sockaddr_in,sin_family)==0x0),"bad off");
		static_assert((offsetof(sockaddr_in,sin_port)==0x2),"bad off");
		static_assert((offsetof(sockaddr_in,sin_addr)==0x4),"bad off");
		static_assert((offsetof(sockaddr_in,sin_zero)==0x8),"bad off");
	};
};

//UDT: struct OnReplayStatusChanged @len=12
	//_Func: public void OnReplayStatusChanged(eReplayStatus  _arg0, float  _arg1, float  _arg2); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: enum eReplayStatus, status
	//_Data: this+0x4, Member, Type: float, timeMult
	//_Data: this+0x8, Member, Type: float, slowMotionLevel
//UDT;

struct OnReplayStatusChanged {
public:
	eReplayStatus status;
	float timeMult;
	float slowMotionLevel;
	inline OnReplayStatusChanged()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnReplayStatusChanged)==12),"bad size");
		static_assert((offsetof(OnReplayStatusChanged,status)==0x0),"bad off");
		static_assert((offsetof(OnReplayStatusChanged,timeMult)==0x4),"bad off");
		static_assert((offsetof(OnReplayStatusChanged,slowMotionLevel)==0x8),"bad off");
	};
};

//UDT: struct GearChanger @len=24
	//_Func: public void ~GearChanger(); @loc=static @len=3 @rva=96368
	//_Data: this+0x0, Member, Type: bool, wasGearUpTriggered
	//_Data: this+0x1, Member, Type: bool, wasGearDnTriggered
	//_Func: public void init(Car * car); @loc=static @len=11 @rva=2861888
	//_Func: public void step(float dt); @loc=static @len=146 @rva=2861904
	//_Data: this+0x8, Member, Type: class Car *, car
	//_Data: this+0x10, Member, Type: bool, lastGearUp
	//_Data: this+0x11, Member, Type: bool, lastGearDn
	//_Func: public void GearChanger(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct GearChanger {
public:
	bool wasGearUpTriggered;
	bool wasGearDnTriggered;
	Car * car;
	bool lastGearUp;
	bool lastGearDn;
	inline GearChanger()  { }
	inline void dtor() { typedef void (*_fpt)(GearChanger *pthis); _fpt _f=(_fpt)_drva(96368); _f(this); }
	inline void init(Car * car) { typedef void (*_fpt)(GearChanger *pthis, Car *); _fpt _f=(_fpt)_drva(2861888); return _f(this, car); }
	inline void step(float dt) { typedef void (*_fpt)(GearChanger *pthis, float); _fpt _f=(_fpt)_drva(2861904); return _f(this, dt); }
	inline void _guard_obj() {
		static_assert((sizeof(GearChanger)==24),"bad size");
		static_assert((offsetof(GearChanger,wasGearUpTriggered)==0x0),"bad off");
		static_assert((offsetof(GearChanger,wasGearDnTriggered)==0x1),"bad off");
		static_assert((offsetof(GearChanger,car)==0x8),"bad off");
		static_assert((offsetof(GearChanger,lastGearUp)==0x10),"bad off");
		static_assert((offsetof(GearChanger,lastGearDn)==0x11),"bad off");
	};
};

//UDT: struct DisconnectCountdown @len=40
	//_Data: this+0x0, Member, Type: bool, isSignaled
	//_Data: this+0x4, Member, Type: float, timeToDisconnection
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, message
	//_Func: public void DisconnectCountdown(DisconnectCountdown &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void DisconnectCountdown(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~DisconnectCountdown(); @loc=static @len=49 @rva=2180672
	//_Func: public DisconnectCountdown & operator=(DisconnectCountdown &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct DisconnectCountdown {
public:
	bool isSignaled;
	float timeToDisconnection;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > message;
	inline DisconnectCountdown()  { }
	inline void dtor() { typedef void (*_fpt)(DisconnectCountdown *pthis); _fpt _f=(_fpt)_drva(2180672); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(DisconnectCountdown)==40),"bad size");
		static_assert((offsetof(DisconnectCountdown,isSignaled)==0x0),"bad off");
		static_assert((offsetof(DisconnectCountdown,timeToDisconnection)==0x4),"bad off");
		static_assert((offsetof(DisconnectCountdown,message)==0x8),"bad off");
	};
};

//UDT: struct LapInvalidator @len=32
	//_Func: public void ~LapInvalidator(); @loc=static @len=3 @rva=96368
	//_Data: this+0x0, Member, Type: double, collisionSafeTime
	//_Func: public void init(Car * car); @loc=static @len=5 @rva=2865408
	//_Func: public int getCurrentTyresOut(); @loc=optimized @len=0 @rva=0
	//_Func: public void step(float dt); @loc=static @len=402 @rva=2884992
	//_Data: this+0x8, Member, Type: class Car *, car
	//_Data: this+0x10, Member, Type: int, currentTyresOut
	//_Data: this+0x14, Member, Type: bool, isInPenaltyZone
	//_Data: this+0x18, Member, Type: float, lastBlackFlagTime
	//_Func: private void onEnterPenaltyZone(int tyre_count, float black_flag_time); @loc=static @len=431 @rva=2884560
	//_Func: private void onInPenaltyZone(int  _arg0, float  _arg1); @loc=optimized @len=0 @rva=0
	//_Func: public void LapInvalidator(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct LapInvalidator {
public:
	double collisionSafeTime;
	Car * car;
	int currentTyresOut;
	bool isInPenaltyZone;
	float lastBlackFlagTime;
	inline LapInvalidator()  { }
	inline void dtor() { typedef void (*_fpt)(LapInvalidator *pthis); _fpt _f=(_fpt)_drva(96368); _f(this); }
	inline void init(Car * car) { typedef void (*_fpt)(LapInvalidator *pthis, Car *); _fpt _f=(_fpt)_drva(2865408); return _f(this, car); }
	inline void step(float dt) { typedef void (*_fpt)(LapInvalidator *pthis, float); _fpt _f=(_fpt)_drva(2884992); return _f(this, dt); }
	inline void onEnterPenaltyZone(int tyre_count, float black_flag_time) { typedef void (*_fpt)(LapInvalidator *pthis, int, float); _fpt _f=(_fpt)_drva(2884560); return _f(this, tyre_count, black_flag_time); }
	inline void _guard_obj() {
		static_assert((sizeof(LapInvalidator)==32),"bad size");
		static_assert((offsetof(LapInvalidator,collisionSafeTime)==0x0),"bad off");
		static_assert((offsetof(LapInvalidator,car)==0x8),"bad off");
		static_assert((offsetof(LapInvalidator,currentTyresOut)==0x10),"bad off");
		static_assert((offsetof(LapInvalidator,isInPenaltyZone)==0x14),"bad off");
		static_assert((offsetof(LapInvalidator,lastBlackFlagTime)==0x18),"bad off");
	};
};

//UDT: struct OnStepCompleteEvent @len=16
	//_Data: this+0x0, Member, Type: class Car *, car
	//_Data: this+0x8, Member, Type: double, physicsTime
//UDT;

struct OnStepCompleteEvent {
public:
	Car * car;
	double physicsTime;
	inline OnStepCompleteEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnStepCompleteEvent)==16),"bad size");
		static_assert((offsetof(OnStepCompleteEvent,car)==0x0),"bad off");
		static_assert((offsetof(OnStepCompleteEvent,physicsTime)==0x8),"bad off");
	};
};

//UDT: class TCPQueue @len=65540
	//_Func: public void TCPQueue(); @loc=optimized @len=0 @rva=0
	//_Func: public void push(unsigned char * data, unsigned int size); @loc=static @len=215 @rva=2482992
	//_Func: public std::vector<unsigned char,std::allocator<unsigned char> > getPacket(); @loc=static @len=238 @rva=2482752
	//_Data: this+0x0, Member, Type: unsigned char[0x10000], buffer
	//_Data: this+0x10000, Member, Type: unsigned int, cursor
//UDT;

class TCPQueue {
public:
	unsigned char buffer[0x10000];
	unsigned int cursor;
	inline TCPQueue()  { }
	inline void push(unsigned char * data, unsigned int size) { typedef void (*_fpt)(TCPQueue *pthis, unsigned char *, unsigned int); _fpt _f=(_fpt)_drva(2482992); return _f(this, data, size); }
	inline std::vector<unsigned char,std::allocator<unsigned char> > getPacket() { typedef std::vector<unsigned char,std::allocator<unsigned char> > (*_fpt)(TCPQueue *pthis); _fpt _f=(_fpt)_drva(2482752); return _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(TCPQueue)==65540),"bad size");
		static_assert((offsetof(TCPQueue,buffer)==0x0),"bad off");
		static_assert((offsetof(TCPQueue,cursor)==0x10000),"bad off");
	};
};

//UDT: class vec3f @len=12
	//_Data: this+0x0, Member, Type: float, x
	//_Data: this+0x4, Member, Type: float, y
	//_Data: this+0x8, Member, Type: float, z
	//_Func: public void vec3f(double *  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void vec3f(float *  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void vec3f(float ix, float iy, float iz); @loc=static @len=18 @rva=147424
	//_Func: public void vec3f(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void vec3f(); @loc=optimized @len=0 @rva=0
	//_Func: public void normalize(); @loc=static @len=136 @rva=147456
	//_Func: public bool isZero(); @loc=optimized @len=0 @rva=0
	//_Func: public std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > toString(); @loc=static @len=322 @rva=340976
	//_Func: public float length(); @loc=optimized @len=0 @rva=0
	//_Func: public float lengthSquared(); @loc=optimized @len=0 @rva=0
	//_Func: public bool isFinite(); @loc=static @len=105 @rva=418800
	//_Func: public vec3f negate(); @loc=optimized @len=0 @rva=0
	//_Func: public void operator+=(vec3f &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void operator-=(vec3f &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void operator*=(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void operator/=(float m); @loc=static @len=47 @rva=908800
	//_Func: public void print(char * name); @loc=static @len=61 @rva=918176
//UDT;

class vec3f {
public:
	float x;
	float y;
	float z;
	inline vec3f()  { }
	inline void ctor(float ix, float iy, float iz) { typedef void (*_fpt)(vec3f *pthis, float, float, float); _fpt _f=(_fpt)_drva(147424); _f(this, ix, iy, iz); }
	inline void normalize() { typedef void (*_fpt)(vec3f *pthis); _fpt _f=(_fpt)_drva(147456); return _f(this); }
	inline std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > toString() { typedef std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > (*_fpt)(vec3f *pthis); _fpt _f=(_fpt)_drva(340976); return _f(this); }
	inline bool isFinite() { typedef bool (*_fpt)(vec3f *pthis); _fpt _f=(_fpt)_drva(418800); return _f(this); }
	inline void operator/=(float m) { typedef void (*_fpt)(vec3f *pthis, float); _fpt _f=(_fpt)_drva(908800); return _f(this, m); }
	inline void print(char * name) { typedef void (*_fpt)(vec3f *pthis, char *); _fpt _f=(_fpt)_drva(918176); return _f(this, name); }
	inline void _guard_obj() {
		static_assert((sizeof(vec3f)==12),"bad size");
		static_assert((offsetof(vec3f,x)==0x0),"bad off");
		static_assert((offsetof(vec3f,y)==0x4),"bad off");
		static_assert((offsetof(vec3f,z)==0x8),"bad off");
	};
};

//UDT: struct FuelLapEvaluator @len=72
	//_Func: public void ~FuelLapEvaluator(); @loc=static @len=3 @rva=96368
	//_Func: public float getFuelLaps(); @loc=static @len=43 @rva=2675296
	//_Func: public void setIgnoreLap(bool value); @loc=static @len=4 @rva=2675536
	//_Func: public void init(Car * icar); @loc=static @len=145 @rva=2675376
	//_Func: public float getFuelPerLap(); @loc=static @len=26 @rva=2675344
	//_Func: public float getKmPerLiter(); @loc=optimized @len=0 @rva=0
	//_Func: public float getTotalKM(); @loc=optimized @len=0 @rva=0
	//_Func: public void step(float dt); @loc=static @len=152 @rva=2675552
	//_Data: this+0x0, Member, Type: class Car *, car
	//_Data: this+0x8, Member, Type: int, lapCount
	//_Data: this+0x10, Member, Type: double, lapStartFuel
	//_Data: this+0x18, Member, Type: double, fuelPerLap
	//_Data: this+0x20, Member, Type: double, totalM
	//_Data: this+0x28, Member, Type: double, totalLiters
	//_Data: this+0x30, Member, Type: double, startFuel
	//_Data: this+0x38, Member, Type: double, oldFuelPerLap
	//_Data: this+0x40, Member, Type: bool, ignoreLap
	//_Func: public void FuelLapEvaluator(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct FuelLapEvaluator {
public:
	Car * car;
	int lapCount;
	double lapStartFuel;
	double fuelPerLap;
	double totalM;
	double totalLiters;
	double startFuel;
	double oldFuelPerLap;
	bool ignoreLap;
	inline FuelLapEvaluator()  { }
	inline void dtor() { typedef void (*_fpt)(FuelLapEvaluator *pthis); _fpt _f=(_fpt)_drva(96368); _f(this); }
	inline float getFuelLaps() { typedef float (*_fpt)(FuelLapEvaluator *pthis); _fpt _f=(_fpt)_drva(2675296); return _f(this); }
	inline void setIgnoreLap(bool value) { typedef void (*_fpt)(FuelLapEvaluator *pthis, bool); _fpt _f=(_fpt)_drva(2675536); return _f(this, value); }
	inline void init(Car * icar) { typedef void (*_fpt)(FuelLapEvaluator *pthis, Car *); _fpt _f=(_fpt)_drva(2675376); return _f(this, icar); }
	inline float getFuelPerLap() { typedef float (*_fpt)(FuelLapEvaluator *pthis); _fpt _f=(_fpt)_drva(2675344); return _f(this); }
	inline void step(float dt) { typedef void (*_fpt)(FuelLapEvaluator *pthis, float); _fpt _f=(_fpt)_drva(2675552); return _f(this, dt); }
	inline void _guard_obj() {
		static_assert((sizeof(FuelLapEvaluator)==72),"bad size");
		static_assert((offsetof(FuelLapEvaluator,car)==0x0),"bad off");
		static_assert((offsetof(FuelLapEvaluator,lapCount)==0x8),"bad off");
		static_assert((offsetof(FuelLapEvaluator,lapStartFuel)==0x10),"bad off");
		static_assert((offsetof(FuelLapEvaluator,fuelPerLap)==0x18),"bad off");
		static_assert((offsetof(FuelLapEvaluator,totalM)==0x20),"bad off");
		static_assert((offsetof(FuelLapEvaluator,totalLiters)==0x28),"bad off");
		static_assert((offsetof(FuelLapEvaluator,startFuel)==0x30),"bad off");
		static_assert((offsetof(FuelLapEvaluator,oldFuelPerLap)==0x38),"bad off");
		static_assert((offsetof(FuelLapEvaluator,ignoreLap)==0x40),"bad off");
	};
};

//UDT: struct DriverActionsState @len=4
	//_Data: this+0x0, Member, Type: int, state
	//_Func: public void reset(); @loc=optimized @len=0 @rva=0
	//_Func: public void setState(DriverActions  _arg0, bool  _arg1); @loc=optimized @len=0 @rva=0
	//_Func: public bool getState(DriverActions  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void DriverActionsState(); @loc=optimized @len=0 @rva=0
//UDT;

struct DriverActionsState {
public:
	int state;
	inline DriverActionsState()  { }
	inline void _guard_obj() {
		static_assert((sizeof(DriverActionsState)==4),"bad size");
		static_assert((offsetof(DriverActionsState,state)==0x0),"bad off");
	};
};

//UDT: struct TimeLineStatus @len=12
	//_Func: public void TimeLineStatus(); @loc=optimized @len=0 @rva=0
	//_Func: public void reset(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: bool, isValid
	//_Data: this+0x4, Member, Type: enum eTimeLineCheckResponse, lastResponse
	//_Data: this+0x8, Member, Type: unsigned int, lastTime
//UDT;

struct TimeLineStatus {
public:
	bool isValid;
	eTimeLineCheckResponse lastResponse;
	unsigned int lastTime;
	inline TimeLineStatus()  { }
	inline void _guard_obj() {
		static_assert((sizeof(TimeLineStatus)==12),"bad size");
		static_assert((offsetof(TimeLineStatus,isValid)==0x0),"bad off");
		static_assert((offsetof(TimeLineStatus,lastResponse)==0x4),"bad off");
		static_assert((offsetof(TimeLineStatus,lastTime)==0x8),"bad off");
	};
};

//UDT: struct SpeedLimiter @len=16
	//_Func: public void ~SpeedLimiter(); @loc=static @len=3 @rva=96368
	//_Func: public void init(Car * car); @loc=static @len=5 @rva=2865408
	//_Func: public void step(float dt); @loc=static @len=247 @rva=2865424
	//_Func: public bool isLimitingSpeed(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: bool, shoudLimit
	//_Data: this+0x1, Member, Type: bool, isLimiting
	//_Data: this+0x8, Member, Type: class Car *, car
	//_Func: public void SpeedLimiter(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct SpeedLimiter {
public:
	bool shoudLimit;
	bool isLimiting;
	Car * car;
	inline SpeedLimiter()  { }
	inline void dtor() { typedef void (*_fpt)(SpeedLimiter *pthis); _fpt _f=(_fpt)_drva(96368); _f(this); }
	inline void init(Car * car) { typedef void (*_fpt)(SpeedLimiter *pthis, Car *); _fpt _f=(_fpt)_drva(2865408); return _f(this, car); }
	inline void step(float dt) { typedef void (*_fpt)(SpeedLimiter *pthis, float); _fpt _f=(_fpt)_drva(2865424); return _f(this, dt); }
	inline void _guard_obj() {
		static_assert((sizeof(SpeedLimiter)==16),"bad size");
		static_assert((offsetof(SpeedLimiter,shoudLimit)==0x0),"bad off");
		static_assert((offsetof(SpeedLimiter,isLimiting)==0x1),"bad off");
		static_assert((offsetof(SpeedLimiter,car)==0x8),"bad off");
	};
};

//UDT: struct OnWindowResizeEvent @len=16
	//_Func: public void OnWindowResizeEvent(int  _arg0, int  _arg1, RenderWindow *  _arg2); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: int, width
	//_Data: this+0x4, Member, Type: int, height
	//_Data: this+0x8, Member, Type: class RenderWindow *, renderWindow
//UDT;

struct OnWindowResizeEvent {
public:
	int width;
	int height;
	RenderWindow * renderWindow;
	inline OnWindowResizeEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnWindowResizeEvent)==16),"bad size");
		static_assert((offsetof(OnWindowResizeEvent,width)==0x0),"bad off");
		static_assert((offsetof(OnWindowResizeEvent,height)==0x4),"bad off");
		static_assert((offsetof(OnWindowResizeEvent,renderWindow)==0x8),"bad off");
	};
};

//UDT: struct ServerInfo @len=72
	//_Func: public void ServerInfo(ServerInfo &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ServerInfo(); @loc=static @len=127 @rva=243344
	//_Data: this+0x0, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Data: this+0x20, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, ip
	//_Data: this+0x40, Member, Type: unsigned short, httpPort
	//_Data: this+0x42, Member, Type: unsigned short, udpPort
	//_Data: this+0x44, Member, Type: unsigned short, tcpPort
	//_Func: public void ~ServerInfo(); @loc=static @len=88 @rva=776352
	//_Func: public ServerInfo & operator=(ServerInfo &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct ServerInfo {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > ip;
	unsigned short httpPort;
	unsigned short udpPort;
	unsigned short tcpPort;
	inline ServerInfo()  { }
	inline void ctor() { typedef void (*_fpt)(ServerInfo *pthis); _fpt _f=(_fpt)_drva(243344); _f(this); }
	inline void dtor() { typedef void (*_fpt)(ServerInfo *pthis); _fpt _f=(_fpt)_drva(776352); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(ServerInfo)==72),"bad size");
		static_assert((offsetof(ServerInfo,name)==0x0),"bad off");
		static_assert((offsetof(ServerInfo,ip)==0x20),"bad off");
		static_assert((offsetof(ServerInfo,httpPort)==0x40),"bad off");
		static_assert((offsetof(ServerInfo,udpPort)==0x42),"bad off");
		static_assert((offsetof(ServerInfo,tcpPort)==0x44),"bad off");
	};
};

//UDT: struct DriverInfo @len=128
	//_Data: this+0x0, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Data: this+0x20, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, team
	//_Data: this+0x40, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, nationality
	//_Data: this+0x60, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, nationCode
	//_Func: public void DriverInfo(DriverInfo & __that); @loc=static @len=192 @rva=242096
	//_Func: public void DriverInfo(); @loc=static @len=69 @rva=242288
	//_Func: public void ~DriverInfo(); @loc=static @len=152 @rva=246464
	//_Func: public DriverInfo & operator=(DriverInfo & __that); @loc=static @len=122 @rva=848192
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct DriverInfo {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > team;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > nationality;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > nationCode;
	inline DriverInfo()  { }
	inline void ctor(DriverInfo & __that) { typedef void (*_fpt)(DriverInfo *pthis, DriverInfo &); _fpt _f=(_fpt)_drva(242096); _f(this, __that); }
	inline void ctor() { typedef void (*_fpt)(DriverInfo *pthis); _fpt _f=(_fpt)_drva(242288); _f(this); }
	inline void dtor() { typedef void (*_fpt)(DriverInfo *pthis); _fpt _f=(_fpt)_drva(246464); _f(this); }
	inline DriverInfo & operator=(DriverInfo & __that) { typedef DriverInfo & (*_fpt)(DriverInfo *pthis, DriverInfo &); _fpt _f=(_fpt)_drva(848192); return _f(this, __that); }
	inline void _guard_obj() {
		static_assert((sizeof(DriverInfo)==128),"bad size");
		static_assert((offsetof(DriverInfo,name)==0x0),"bad off");
		static_assert((offsetof(DriverInfo,team)==0x20),"bad off");
		static_assert((offsetof(DriverInfo,nationality)==0x40),"bad off");
		static_assert((offsetof(DriverInfo,nationCode)==0x60),"bad off");
	};
};

//UDT: struct SessionInfo @len=32
	//_Func: public void SessionInfo(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: enum SessionType, type
	//_Data: this+0x8, Member, Type: double, startTimeMS
	//_Data: this+0x10, Member, Type: double, timeSecs
	//_Data: this+0x18, Member, Type: int, laps
	//_Data: this+0x1C, Member, Type: int, index
//UDT;

struct SessionInfo {
public:
	SessionType type;
	double startTimeMS;
	double timeSecs;
	int laps;
	int index;
	inline SessionInfo()  { }
	inline void _guard_obj() {
		static_assert((sizeof(SessionInfo)==32),"bad size");
		static_assert((offsetof(SessionInfo,type)==0x0),"bad off");
		static_assert((offsetof(SessionInfo,startTimeMS)==0x8),"bad off");
		static_assert((offsetof(SessionInfo,timeSecs)==0x10),"bad off");
		static_assert((offsetof(SessionInfo,laps)==0x18),"bad off");
		static_assert((offsetof(SessionInfo,index)==0x1C),"bad off");
	};
};

//UDT: struct DifferentialSetting @len=16
	//_Data: this+0x0, Member, Type: float, power
	//_Data: this+0x4, Member, Type: float, coast
	//_Data: this+0x8, Member, Type: float, preload
	//_Data: this+0xC, Member, Type: enum DifferentialType, type
	//_Func: public void DifferentialSetting(); @loc=optimized @len=0 @rva=0
//UDT;

struct DifferentialSetting {
public:
	float power;
	float coast;
	float preload;
	DifferentialType type;
	inline DifferentialSetting()  { }
	inline void _guard_obj() {
		static_assert((sizeof(DifferentialSetting)==16),"bad size");
		static_assert((offsetof(DifferentialSetting,power)==0x0),"bad off");
		static_assert((offsetof(DifferentialSetting,coast)==0x4),"bad off");
		static_assert((offsetof(DifferentialSetting,preload)==0x8),"bad off");
		static_assert((offsetof(DifferentialSetting,type)==0xC),"bad off");
	};
};

//UDT: struct ReceivedVoteDef @len=28
	//_Data: this+0x0, Member, Type: enum VoteType, voteType
	//_Data: this+0x4, Member, Type: int, quorum
	//_Data: this+0x8, Member, Type: int, votes
	//_Data: this+0xC, Member, Type: int, timeLeftMS
	//_Data: this+0x10, Member, Type: int, lastVoterSessionID
	//_Data: this+0x14, Member, Type: int, lastVoterVote
	//_Data: this+0x18, Member, Type: unsigned char, targetSessionID
	//_Data: this+0x19, Member, Type: bool, isMe
	//_Func: public void ReceivedVoteDef(); @loc=static @len=25 @rva=242528
//UDT;

struct ReceivedVoteDef {
public:
	VoteType voteType;
	int quorum;
	int votes;
	int timeLeftMS;
	int lastVoterSessionID;
	int lastVoterVote;
	unsigned char targetSessionID;
	bool isMe;
	inline ReceivedVoteDef()  { }
	inline void ctor() { typedef void (*_fpt)(ReceivedVoteDef *pthis); _fpt _f=(_fpt)_drva(242528); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(ReceivedVoteDef)==28),"bad size");
		static_assert((offsetof(ReceivedVoteDef,voteType)==0x0),"bad off");
		static_assert((offsetof(ReceivedVoteDef,quorum)==0x4),"bad off");
		static_assert((offsetof(ReceivedVoteDef,votes)==0x8),"bad off");
		static_assert((offsetof(ReceivedVoteDef,timeLeftMS)==0xC),"bad off");
		static_assert((offsetof(ReceivedVoteDef,lastVoterSessionID)==0x10),"bad off");
		static_assert((offsetof(ReceivedVoteDef,lastVoterVote)==0x14),"bad off");
		static_assert((offsetof(ReceivedVoteDef,targetSessionID)==0x18),"bad off");
		static_assert((offsetof(ReceivedVoteDef,isMe)==0x19),"bad off");
	};
};

//UDT: struct OnLapCompletedEvent @len=56
	//_Func: public void OnLapCompletedEvent(OnLapCompletedEvent &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void OnLapCompletedEvent(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: unsigned int, carIndex
	//_Data: this+0x4, Member, Type: unsigned int, lapTime
	//_Data: this+0x8, Member, Type: unsigned int, lapCount
	//_Data: this+0x10, Member, Type: class std::vector<unsigned int,std::allocator<unsigned int> >, splits
	//_Data: this+0x28, Member, Type: double, eventTime
	//_Data: this+0x30, Member, Type: bool, isValid
	//_Data: this+0x34, Member, Type: int, cuts
	//_Func: public void ~OnLapCompletedEvent(); @loc=static @len=53 @rva=246720
	//_Func: public OnLapCompletedEvent & operator=(OnLapCompletedEvent &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct OnLapCompletedEvent {
public:
	unsigned int carIndex;
	unsigned int lapTime;
	unsigned int lapCount;
	std::vector<unsigned int,std::allocator<unsigned int> > splits;
	double eventTime;
	bool isValid;
	int cuts;
	inline OnLapCompletedEvent()  { }
	inline void dtor() { typedef void (*_fpt)(OnLapCompletedEvent *pthis); _fpt _f=(_fpt)_drva(246720); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(OnLapCompletedEvent)==56),"bad size");
		static_assert((offsetof(OnLapCompletedEvent,carIndex)==0x0),"bad off");
		static_assert((offsetof(OnLapCompletedEvent,lapTime)==0x4),"bad off");
		static_assert((offsetof(OnLapCompletedEvent,lapCount)==0x8),"bad off");
		static_assert((offsetof(OnLapCompletedEvent,splits)==0x10),"bad off");
		static_assert((offsetof(OnLapCompletedEvent,eventTime)==0x28),"bad off");
		static_assert((offsetof(OnLapCompletedEvent,isValid)==0x30),"bad off");
		static_assert((offsetof(OnLapCompletedEvent,cuts)==0x34),"bad off");
	};
};

//UDT: struct OnChatMessageEvent @len=40
	//_Data: this+0x0, Member, Type: int, sessionID
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, message
	//_Func: public void OnChatMessageEvent(OnChatMessageEvent &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void OnChatMessageEvent(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~OnChatMessageEvent(); @loc=static @len=49 @rva=2180672
	//_Func: public OnChatMessageEvent & operator=(OnChatMessageEvent &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct OnChatMessageEvent {
public:
	int sessionID;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > message;
	inline OnChatMessageEvent()  { }
	inline void dtor() { typedef void (*_fpt)(OnChatMessageEvent *pthis); _fpt _f=(_fpt)_drva(2180672); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(OnChatMessageEvent)==40),"bad size");
		static_assert((offsetof(OnChatMessageEvent,sessionID)==0x0),"bad off");
		static_assert((offsetof(OnChatMessageEvent,message)==0x8),"bad off");
	};
};

//UDT: struct PenaltyRecord @len=12
	//_Func: public void PenaltyRecord(unsigned int  _arg0, unsigned int  _arg1, PenaltyDescription  _arg2); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: unsigned int, lap
	//_Data: this+0x4, Member, Type: unsigned int, seconds
	//_Data: this+0x8, Member, Type: enum PenaltyDescription, descr
//UDT;

struct PenaltyRecord {
public:
	unsigned int lap;
	unsigned int seconds;
	PenaltyDescription descr;
	inline PenaltyRecord()  { }
	inline void _guard_obj() {
		static_assert((sizeof(PenaltyRecord)==12),"bad size");
		static_assert((offsetof(PenaltyRecord,lap)==0x0),"bad off");
		static_assert((offsetof(PenaltyRecord,seconds)==0x4),"bad off");
		static_assert((offsetof(PenaltyRecord,descr)==0x8),"bad off");
	};
};

//UDT: class IVarCallback @len=8 @vfcount=1
	//_VTable: 
	//_Func: public void onSetVar(SVar *  _arg0, float  _arg1); @intro @pure @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
	//_Func: public void IVarCallback(IVarCallback &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void IVarCallback(); @loc=optimized @len=0 @rva=0
	//_Func: public IVarCallback & operator=(IVarCallback &  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class IVarCallback {
public:
	inline IVarCallback()  { }
	virtual void onSetVar_vf0(SVar *  _arg0, float  _arg1) = 0;
	inline void onSetVar(SVar *  _arg0, float  _arg1) { return onSetVar_vf0( _arg0,  _arg1); }
	inline void _guard_obj() {
		static_assert((sizeof(IVarCallback)==8),"bad size");
	};
};

//UDT: struct GearRequestStatus @len=32
	//_Func: public void GearRequestStatus(); @loc=optimized @len=0 @rva=0
	//_Func: public bool setRequest(GearChangeRequest  _arg0, double  _arg1, int  _arg2); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: enum GearChangeRequest, request
	//_Data: this+0x8, Member, Type: double, timeAccumulator
	//_Data: this+0x10, Member, Type: double, timeout
	//_Data: this+0x18, Member, Type: int, requestedGear
//UDT;

struct GearRequestStatus {
public:
	GearChangeRequest request;
	double timeAccumulator;
	double timeout;
	int requestedGear;
	inline GearRequestStatus()  { }
	inline void _guard_obj() {
		static_assert((sizeof(GearRequestStatus)==32),"bad size");
		static_assert((offsetof(GearRequestStatus,request)==0x0),"bad off");
		static_assert((offsetof(GearRequestStatus,timeAccumulator)==0x8),"bad off");
		static_assert((offsetof(GearRequestStatus,timeout)==0x10),"bad off");
		static_assert((offsetof(GearRequestStatus,requestedGear)==0x18),"bad off");
	};
};

//UDT: struct PenaltyRules @len=8
	//_Data: this+0x0, Member, Type: enum JumpStartPenaltyMode, jumpStartPenaltyMode
	//_Data: this+0x4, Member, Type: short, basePitPenaltyLaps
	//_Func: public bool isFirstGearLocked(); @loc=optimized @len=0 @rva=0
	//_Func: public void PenaltyRules(); @loc=optimized @len=0 @rva=0
//UDT;

struct PenaltyRules {
public:
	JumpStartPenaltyMode jumpStartPenaltyMode;
	short basePitPenaltyLaps;
	inline PenaltyRules()  { }
	inline void _guard_obj() {
		static_assert((sizeof(PenaltyRules)==8),"bad size");
		static_assert((offsetof(PenaltyRules,jumpStartPenaltyMode)==0x0),"bad off");
		static_assert((offsetof(PenaltyRules,basePitPenaltyLaps)==0x4),"bad off");
	};
};

//UDT: struct OnESCMenuTriggered @len=16
	//_Func: public void OnESCMenuTriggered(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class ESCMenu *, menu
	//_Data: this+0x8, Member, Type: bool, visible
	//_Data: this+0x9, Member, Type: bool, startReplay
//UDT;

struct OnESCMenuTriggered {
public:
	ESCMenu * menu;
	bool visible;
	bool startReplay;
	inline OnESCMenuTriggered()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnESCMenuTriggered)==16),"bad size");
		static_assert((offsetof(OnESCMenuTriggered,menu)==0x0),"bad off");
		static_assert((offsetof(OnESCMenuTriggered,visible)==0x8),"bad off");
		static_assert((offsetof(OnESCMenuTriggered,startReplay)==0x9),"bad off");
	};
};

//UDT: struct ksgui::OnSpinnerValueChanged @len=16
	//_Data: this+0x0, Member, Type: class ksgui::Spinner *, spinner
	//_Data: this+0x8, Member, Type: int, value
//UDT;

struct ksgui_OnSpinnerValueChanged {
public:
	ksgui_Spinner * spinner;
	int value;
	inline ksgui_OnSpinnerValueChanged()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_OnSpinnerValueChanged)==16),"bad size");
		static_assert((offsetof(ksgui_OnSpinnerValueChanged,spinner)==0x0),"bad off");
		static_assert((offsetof(ksgui_OnSpinnerValueChanged,value)==0x8),"bad off");
	};
};

//UDT: struct TyreThermalPatch @len=40
	//_Func: public void TyreThermalPatch(TyreThermalPatch &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void TyreThermalPatch(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class std::vector<TyreThermalPatch *,std::allocator<TyreThermalPatch *> >, connections
	//_Data: this+0x18, Member, Type: float, T
	//_Data: this+0x1C, Member, Type: float, inputT
	//_Data: this+0x20, Member, Type: int, elementIndex
	//_Data: this+0x24, Member, Type: int, stripeIndex
	//_Func: public void ~TyreThermalPatch(); @loc=optimized @len=0 @rva=0
	//_Func: public TyreThermalPatch & operator=(TyreThermalPatch &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct TyreThermalPatch {
public:
	std::vector<TyreThermalPatch *,std::allocator<TyreThermalPatch *> > connections;
	float T;
	float inputT;
	int elementIndex;
	int stripeIndex;
	inline TyreThermalPatch()  { }
	inline void _guard_obj() {
		static_assert((sizeof(TyreThermalPatch)==40),"bad size");
		static_assert((offsetof(TyreThermalPatch,connections)==0x0),"bad off");
		static_assert((offsetof(TyreThermalPatch,T)==0x18),"bad off");
		static_assert((offsetof(TyreThermalPatch,inputT)==0x1C),"bad off");
		static_assert((offsetof(TyreThermalPatch,elementIndex)==0x20),"bad off");
		static_assert((offsetof(TyreThermalPatch,stripeIndex)==0x24),"bad off");
	};
};

//UDT: class Task @len=40
	//_Func: public void Task(Task &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void Task(); @loc=optimized @len=0 @rva=0
	//_Func: public void Task(std::function<void __cdecl(void)>  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void run(); @loc=optimized @len=0 @rva=0
	//_Func: public void spinWait(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: volatile bool, isDone
	//_Data: this+0x8, Member, Type: class std::function<void __cdecl(void)>, function
	//_Func: public void ~Task(); @loc=static @len=74 @rva=175552
	//_Func: public Task & operator=(Task &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class Task {
public:
	bool isDone;
	std::function<void __cdecl(void)> function;
	inline Task()  { }
	inline void dtor() { typedef void (*_fpt)(Task *pthis); _fpt _f=(_fpt)_drva(175552); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(Task)==40),"bad size");
		static_assert((offsetof(Task,isDone)==0x0),"bad off");
		static_assert((offsetof(Task,function)==0x8),"bad off");
	};
};

//UDT: struct StabilityControl @len=24
	//_Func: public void ~StabilityControl(); @loc=static @len=3 @rva=96368
	//_Data: this+0x0, Member, Type: float, gain
	//_Data: this+0x4, Member, Type: bool, useBeta
	//_Func: public void init(Car * car); @loc=static @len=22 @rva=2882096
	//_Func: public void step(float dt); @loc=static @len=511 @rva=2882128
	//_Data: this+0x8, Member, Type: class Car *, car
	//_Data: this+0x10, Member, Type: float, maxGain
	//_Func: public void StabilityControl(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct StabilityControl {
public:
	float gain;
	bool useBeta;
	Car * car;
	float maxGain;
	inline StabilityControl()  { }
	inline void dtor() { typedef void (*_fpt)(StabilityControl *pthis); _fpt _f=(_fpt)_drva(96368); _f(this); }
	inline void init(Car * car) { typedef void (*_fpt)(StabilityControl *pthis, Car *); _fpt _f=(_fpt)_drva(2882096); return _f(this, car); }
	inline void step(float dt) { typedef void (*_fpt)(StabilityControl *pthis, float); _fpt _f=(_fpt)_drva(2882128); return _f(this, dt); }
	inline void _guard_obj() {
		static_assert((sizeof(StabilityControl)==24),"bad size");
		static_assert((offsetof(StabilityControl,gain)==0x0),"bad off");
		static_assert((offsetof(StabilityControl,useBeta)==0x4),"bad off");
		static_assert((offsetof(StabilityControl,car)==0x8),"bad off");
		static_assert((offsetof(StabilityControl,maxGain)==0x10),"bad off");
	};
};

//UDT: struct TrackData @len=72
	//_Data: this+0x0, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Data: this+0x20, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, configuration
	//_Data: this+0x40, Member, Type: int, gridPlaces
	//_Func: public void TrackData(TrackData &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void TrackData(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~TrackData(); @loc=static @len=88 @rva=776352
	//_Func: public TrackData & operator=(TrackData &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct TrackData {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > configuration;
	int gridPlaces;
	inline TrackData()  { }
	inline void dtor() { typedef void (*_fpt)(TrackData *pthis); _fpt _f=(_fpt)_drva(776352); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(TrackData)==72),"bad size");
		static_assert((offsetof(TrackData,name)==0x0),"bad off");
		static_assert((offsetof(TrackData,configuration)==0x20),"bad off");
		static_assert((offsetof(TrackData,gridPlaces)==0x40),"bad off");
	};
};

//UDT: struct OnTyreCompoundChanged @len=72
	//_Data: this+0x0, Member, Type: int, tyreIndex
	//_Data: this+0x4, Member, Type: int, compoundIndex
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, compoundName
	//_Data: this+0x28, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, shortName
	//_Func: public void OnTyreCompoundChanged(OnTyreCompoundChanged &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void OnTyreCompoundChanged(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~OnTyreCompoundChanged(); @loc=static @len=90 @rva=847584
	//_Func: public OnTyreCompoundChanged & operator=(OnTyreCompoundChanged &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct OnTyreCompoundChanged {
public:
	int tyreIndex;
	int compoundIndex;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > compoundName;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > shortName;
	inline OnTyreCompoundChanged()  { }
	inline void dtor() { typedef void (*_fpt)(OnTyreCompoundChanged *pthis); _fpt _f=(_fpt)_drva(847584); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(OnTyreCompoundChanged)==72),"bad size");
		static_assert((offsetof(OnTyreCompoundChanged,tyreIndex)==0x0),"bad off");
		static_assert((offsetof(OnTyreCompoundChanged,compoundIndex)==0x4),"bad off");
		static_assert((offsetof(OnTyreCompoundChanged,compoundName)==0x8),"bad off");
		static_assert((offsetof(OnTyreCompoundChanged,shortName)==0x28),"bad off");
	};
};

//UDT: struct SGearRatio @len=40
	//_Func: public void SGearRatio(SGearRatio &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void SGearRatio(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * iname, double iratio); @loc=static @len=173 @rva=2514800
	//_Data: this+0x0, Member, Type: double, ratio
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Func: public void ~SGearRatio(); @loc=static @len=49 @rva=2180672
	//_Func: public SGearRatio & operator=(SGearRatio &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct SGearRatio {
public:
	double ratio;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	inline SGearRatio()  { }
	inline void ctor(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * iname, double iratio) { typedef void (*_fpt)(SGearRatio *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > *, double); _fpt _f=(_fpt)_drva(2514800); _f(this, iname, iratio); }
	inline void dtor() { typedef void (*_fpt)(SGearRatio *pthis); _fpt _f=(_fpt)_drva(2180672); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(SGearRatio)==40),"bad size");
		static_assert((offsetof(SGearRatio,ratio)==0x0),"bad off");
		static_assert((offsetof(SGearRatio,name)==0x8),"bad off");
	};
};

//UDT: struct OnGearRequestEvent @len=8
	//_Func: public void OnGearRequestEvent(GearChangeRequest  _arg0, int  _arg1); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: enum GearChangeRequest, request
	//_Data: this+0x4, Member, Type: int, nextGear
//UDT;

struct OnGearRequestEvent {
public:
	GearChangeRequest request;
	int nextGear;
	inline OnGearRequestEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnGearRequestEvent)==8),"bad size");
		static_assert((offsetof(OnGearRequestEvent,request)==0x0),"bad off");
		static_assert((offsetof(OnGearRequestEvent,nextGear)==0x4),"bad off");
	};
};

//UDT: struct OnNewCarLoadedEvent @len=8
	//_Data: this+0x0, Member, Type: class CarAvatar *, car
//UDT;

struct OnNewCarLoadedEvent {
public:
	CarAvatar * car;
	inline OnNewCarLoadedEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnNewCarLoadedEvent)==8),"bad size");
		static_assert((offsetof(OnNewCarLoadedEvent,car)==0x0),"bad off");
	};
};

//UDT: struct ksgui::OnControlClicked @len=16
	//_Data: this+0x0, Member, Type: class ksgui::Control *, control
	//_Data: this+0x8, Member, Type: int, localx
	//_Data: this+0xC, Member, Type: int, localy
//UDT;

struct ksgui_OnControlClicked {
public:
	ksgui_Control * control;
	int localx;
	int localy;
	inline ksgui_OnControlClicked()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_OnControlClicked)==16),"bad size");
		static_assert((offsetof(ksgui_OnControlClicked,control)==0x0),"bad off");
		static_assert((offsetof(ksgui_OnControlClicked,localx)==0x8),"bad off");
		static_assert((offsetof(ksgui_OnControlClicked,localy)==0xC),"bad off");
	};
};

//UDT: struct MouseEvent @len=12
	//_Func: public void MouseEvent(int  _arg0, int  _arg1); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: int, x
	//_Data: this+0x4, Member, Type: int, y
	//_Data: this+0x8, Member, Type: enum MouseButton, button
//UDT;

struct MouseEvent {
public:
	int x;
	int y;
	MouseButton button;
	inline MouseEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(MouseEvent)==12),"bad size");
		static_assert((offsetof(MouseEvent,x)==0x0),"bad off");
		static_assert((offsetof(MouseEvent,y)==0x4),"bad off");
		static_assert((offsetof(MouseEvent,button)==0x8),"bad off");
	};
};

//UDT: struct ksgui::OnCheckBoxChanged @len=16
	//_Data: this+0x0, Member, Type: class ksgui::CheckBox *, checkBox
	//_Data: this+0x8, Member, Type: bool, value
//UDT;

struct ksgui_OnCheckBoxChanged {
public:
	ksgui_CheckBox * checkBox;
	bool value;
	inline ksgui_OnCheckBoxChanged()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_OnCheckBoxChanged)==16),"bad size");
		static_assert((offsetof(ksgui_OnCheckBoxChanged,checkBox)==0x0),"bad off");
		static_assert((offsetof(ksgui_OnCheckBoxChanged,value)==0x8),"bad off");
	};
};

//UDT: struct ksgui::OnScrollBarValueChanged @len=16
	//_Data: this+0x0, Member, Type: class ksgui::ScrollBar *, scrollBar
	//_Data: this+0x8, Member, Type: int, value
//UDT;

struct ksgui_OnScrollBarValueChanged {
public:
	ksgui_ScrollBar * scrollBar;
	int value;
	inline ksgui_OnScrollBarValueChanged()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_OnScrollBarValueChanged)==16),"bad size");
		static_assert((offsetof(ksgui_OnScrollBarValueChanged,scrollBar)==0x0),"bad off");
		static_assert((offsetof(ksgui_OnScrollBarValueChanged,value)==0x8),"bad off");
	};
};

//UDT: struct ksgui::OnCutExtremesChanged @len=16
	//_Data: this+0x0, Member, Type: class ksgui::Slider *, slider
	//_Data: this+0x8, Member, Type: float, cutIn
	//_Data: this+0xC, Member, Type: float, cutOut
//UDT;

struct ksgui_OnCutExtremesChanged {
public:
	ksgui_Slider * slider;
	float cutIn;
	float cutOut;
	inline ksgui_OnCutExtremesChanged()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_OnCutExtremesChanged)==16),"bad size");
		static_assert((offsetof(ksgui_OnCutExtremesChanged,slider)==0x0),"bad off");
		static_assert((offsetof(ksgui_OnCutExtremesChanged,cutIn)==0x8),"bad off");
		static_assert((offsetof(ksgui_OnCutExtremesChanged,cutOut)==0xC),"bad off");
	};
};

//UDT: struct ksgui::OnSliderInteraction @len=16
	//_Data: this+0x0, Member, Type: class ksgui::Slider *, slider
	//_Data: this+0x8, Member, Type: float, value
//UDT;

struct ksgui_OnSliderInteraction {
public:
	ksgui_Slider * slider;
	float value;
	inline ksgui_OnSliderInteraction()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_OnSliderInteraction)==16),"bad size");
		static_assert((offsetof(ksgui_OnSliderInteraction,slider)==0x0),"bad off");
		static_assert((offsetof(ksgui_OnSliderInteraction,value)==0x8),"bad off");
	};
};

//UDT: struct INISection @len=16
	//_Data: this+0x0, Member, Type: class std::map<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,std::less<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > >,std::allocator<std::pair<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > const ,std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > > > >, keys
	//_Func: public bool hasKey(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & k); @loc=static @len=105 @rva=2322496
	//_Func: public void INISection(INISection &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void INISection(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~INISection(); @loc=static @len=41 @rva=4512704
	//_Func: public INISection & operator=(INISection &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct INISection {
public:
	std::map<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,std::less<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > >,std::allocator<std::pair<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > const ,std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > > > > keys;
	inline INISection()  { }
	inline bool hasKey(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & k) { typedef bool (*_fpt)(INISection *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &); _fpt _f=(_fpt)_drva(2322496); return _f(this, k); }
	inline void dtor() { typedef void (*_fpt)(INISection *pthis); _fpt _f=(_fpt)_drva(4512704); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(INISection)==16),"bad size");
		static_assert((offsetof(INISection,keys)==0x0),"bad off");
	};
};

//UDT: struct OnControlsProviderChanged @len=16
	//_Data: this+0x0, Member, Type: class Car *, car
	//_Data: this+0x8, Member, Type: class ICarControlsProvider *, newControlsProvider
//UDT;

struct OnControlsProviderChanged {
public:
	Car * car;
	ICarControlsProvider * newControlsProvider;
	inline OnControlsProviderChanged()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnControlsProviderChanged)==16),"bad size");
		static_assert((offsetof(OnControlsProviderChanged,car)==0x0),"bad off");
		static_assert((offsetof(OnControlsProviderChanged,newControlsProvider)==0x8),"bad off");
	};
};

//UDT: class Session @len=112
	//_Func: public void Session(Session & __that); @loc=static @len=190 @rva=704528
	//_Func: public void Session(); @loc=static @len=145 @rva=610160
	//_Data: this+0x0, Member, Type: enum SessionType, sessionType
	//_Data: this+0x4, Member, Type: bool, isTimedRace
	//_Data: this+0x5, Member, Type: bool, hasAdditionalLap
	//_Data: this+0x8, Member, Type: int, laps
	//_Data: this+0xC, Member, Type: float, durationMinutes
	//_Data: this+0x10, Member, Type: float, overtime_ms
	//_Data: this+0x18, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, spawSet
	//_Data: this+0x38, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Data: this+0x58, Member, Type: double, startTime
	//_Data: this+0x60, Member, Type: int, forcedPosition
	//_Data: this+0x64, Member, Type: bool, isOver
	//_Data: this+0x68, Member, Type: unsigned int, leaderCompletedLaps
	//_Func: public void ~Session(); @loc=static @len=90 @rva=584992
	//_Func: public Session & operator=(Session & __that); @loc=static @len=143 @rva=612480
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class Session {
public:
	SessionType sessionType;
	bool isTimedRace;
	bool hasAdditionalLap;
	int laps;
	float durationMinutes;
	float overtime_ms;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > spawSet;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	double startTime;
	int forcedPosition;
	bool isOver;
	unsigned int leaderCompletedLaps;
	inline Session()  { }
	inline void ctor(Session & __that) { typedef void (*_fpt)(Session *pthis, Session &); _fpt _f=(_fpt)_drva(704528); _f(this, __that); }
	inline void ctor() { typedef void (*_fpt)(Session *pthis); _fpt _f=(_fpt)_drva(610160); _f(this); }
	inline void dtor() { typedef void (*_fpt)(Session *pthis); _fpt _f=(_fpt)_drva(584992); _f(this); }
	inline Session & operator=(Session & __that) { typedef Session & (*_fpt)(Session *pthis, Session &); _fpt _f=(_fpt)_drva(612480); return _f(this, __that); }
	inline void _guard_obj() {
		static_assert((sizeof(Session)==112),"bad size");
		static_assert((offsetof(Session,sessionType)==0x0),"bad off");
		static_assert((offsetof(Session,isTimedRace)==0x4),"bad off");
		static_assert((offsetof(Session,hasAdditionalLap)==0x5),"bad off");
		static_assert((offsetof(Session,laps)==0x8),"bad off");
		static_assert((offsetof(Session,durationMinutes)==0xC),"bad off");
		static_assert((offsetof(Session,overtime_ms)==0x10),"bad off");
		static_assert((offsetof(Session,spawSet)==0x18),"bad off");
		static_assert((offsetof(Session,name)==0x38),"bad off");
		static_assert((offsetof(Session,startTime)==0x58),"bad off");
		static_assert((offsetof(Session,forcedPosition)==0x60),"bad off");
		static_assert((offsetof(Session,isOver)==0x64),"bad off");
		static_assert((offsetof(Session,leaderCompletedLaps)==0x68),"bad off");
	};
};

//UDT: class SetupItem @len=136 @vfcount=1
	//_VTable: 
	//_Func: public void SetupItem(SetupItem & __that); @loc=static @len=224 @rva=2657424
	//_Func: public void SetupItem(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * aname, float & aconnectedFloat, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * units, bool isAttached, float multiplier, float labelMult); @loc=static @len=303 @rva=2929008
	//_Func: public void ~SetupItem(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=164 @rva=2929312
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Data: this+0x28, Member, Type: float &, connectedFloat
	//_Data: this+0x30, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, units
	//_Data: this+0x50, Member, Type: float, multiplier
	//_Data: this+0x54, Member, Type: float, newValue
	//_Data: this+0x58, Member, Type: bool, attached
	//_Data: this+0x60, Member, Type: class std::function<void __cdecl(SetupItem *)>, onValueChanged
	//_Data: this+0x80, Member, Type: float, labelMultiplier
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class SetupItem {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	float & connectedFloat;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > units;
	float multiplier;
	float newValue;
	bool attached;
	std::function<void __cdecl(SetupItem *)> onValueChanged;
	float labelMultiplier;
	inline SetupItem()  : connectedFloat(*((float*)NULL)) { }
	inline void ctor(SetupItem & __that) { typedef void (*_fpt)(SetupItem *pthis, SetupItem &); _fpt _f=(_fpt)_drva(2657424); _f(this, __that); }
	inline void ctor(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * aname, float & aconnectedFloat, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * units, bool isAttached, float multiplier, float labelMult) { typedef void (*_fpt)(SetupItem *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > *, float &, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > *, bool, float, float); _fpt _f=(_fpt)_drva(2929008); _f(this, aname, aconnectedFloat, units, isAttached, multiplier, labelMult); }
	virtual ~SetupItem();
	inline void dtor() { typedef void (*_fpt)(SetupItem *pthis); _fpt _f=(_fpt)_drva(2929312); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(SetupItem)==136),"bad size");
		static_assert((offsetof(SetupItem,name)==0x8),"bad off");
		static_assert((offsetof(SetupItem,units)==0x30),"bad off");
		static_assert((offsetof(SetupItem,multiplier)==0x50),"bad off");
		static_assert((offsetof(SetupItem,newValue)==0x54),"bad off");
		static_assert((offsetof(SetupItem,attached)==0x58),"bad off");
		static_assert((offsetof(SetupItem,onValueChanged)==0x60),"bad off");
		static_assert((offsetof(SetupItem,labelMultiplier)==0x80),"bad off");
	};
};

//UDT: struct TelemetryChannelData @len=32
	//_Func: public void TelemetryChannelData(TelemetryChannelData &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void TelemetryChannelData(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class std::vector<float,std::allocator<float> >, values
	//_Data: this+0x18, Member, Type: enum TelemetryUnits, units
	//_Data: this+0x1C, Member, Type: int, frequency
	//_Func: public void ~TelemetryChannelData(); @loc=static @len=48 @rva=811392
	//_Func: public TelemetryChannelData & operator=(TelemetryChannelData &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct TelemetryChannelData {
public:
	std::vector<float,std::allocator<float> > values;
	TelemetryUnits units;
	int frequency;
	inline TelemetryChannelData()  { }
	inline void dtor() { typedef void (*_fpt)(TelemetryChannelData *pthis); _fpt _f=(_fpt)_drva(811392); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(TelemetryChannelData)==32),"bad size");
		static_assert((offsetof(TelemetryChannelData,values)==0x0),"bad off");
		static_assert((offsetof(TelemetryChannelData,units)==0x18),"bad off");
		static_assert((offsetof(TelemetryChannelData,frequency)==0x1C),"bad off");
	};
};

//UDT: struct DRSWingConnection @len=24
	//_Func: public void DRSWingConnection(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class Wing *, wing
	//_Data: this+0x8, Member, Type: float, effect
	//_Data: this+0xC, Member, Type: float, angle
	//_Data: this+0x10, Member, Type: enum DRWWingConnectionMode, mode
//UDT;

struct DRSWingConnection {
public:
	Wing * wing;
	float effect;
	float angle;
	DRWWingConnectionMode mode;
	inline DRSWingConnection()  { }
	inline void _guard_obj() {
		static_assert((sizeof(DRSWingConnection)==24),"bad size");
		static_assert((offsetof(DRSWingConnection,wing)==0x0),"bad off");
		static_assert((offsetof(DRSWingConnection,effect)==0x8),"bad off");
		static_assert((offsetof(DRSWingConnection,angle)==0xC),"bad off");
		static_assert((offsetof(DRSWingConnection,mode)==0x10),"bad off");
	};
};

//UDT: struct OnPenaltyEvent @len=16
	//_Func: public void OnPenaltyEvent(Car *  _arg0, PenaltyType  _arg1); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class Car *, car
	//_Data: this+0x8, Member, Type: enum PenaltyType, ptype
//UDT;

struct OnPenaltyEvent {
public:
	Car * car;
	PenaltyType ptype;
	inline OnPenaltyEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnPenaltyEvent)==16),"bad size");
		static_assert((offsetof(OnPenaltyEvent,car)==0x0),"bad off");
		static_assert((offsetof(OnPenaltyEvent,ptype)==0x8),"bad off");
	};
};

//UDT: class IACPPluginHost @len=8 @vfcount=9
	//_VTable: 
	//_Func: public HWND__ * getHwnd(); @intro @pure @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
	//_Func: public HINSTANCE__ * getHInstance(); @intro @pure @virtual vtpo=0 vfid=1 @loc=optimized @len=0 @rva=0
	//_Func: public void setABS(float  _arg0); @intro @pure @virtual vtpo=0 vfid=2 @loc=optimized @len=0 @rva=0
	//_Func: public void setTC(float  _arg0); @intro @pure @virtual vtpo=0 vfid=3 @loc=optimized @len=0 @rva=0
	//_Func: public void setStabilityControl(float  _arg0); @intro @pure @virtual vtpo=0 vfid=4 @loc=optimized @len=0 @rva=0
	//_Func: public void setIdealLine(bool  _arg0, bool  _arg1); @intro @pure @virtual vtpo=0 vfid=5 @loc=optimized @len=0 @rva=0
	//_Func: public void setAutoShift(bool  _arg0); @intro @pure @virtual vtpo=0 vfid=6 @loc=optimized @len=0 @rva=0
	//_Func: public void setBrakeBias(float  _arg0); @intro @pure @virtual vtpo=0 vfid=7 @loc=optimized @len=0 @rva=0
	//_Func: public void setSystemMessage(wchar_t *  _arg0, wchar_t *  _arg1, bool  _arg2); @intro @pure @virtual vtpo=0 vfid=8 @loc=optimized @len=0 @rva=0
	//_Func: public void IACPPluginHost(IACPPluginHost &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void IACPPluginHost(); @loc=optimized @len=0 @rva=0
	//_Func: public IACPPluginHost & operator=(IACPPluginHost &  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class IACPPluginHost {
public:
	inline IACPPluginHost()  { }
	virtual HWND__ * getHwnd_vf0() = 0;
	inline HWND__ * getHwnd() { return getHwnd_vf0(); }
	virtual HINSTANCE__ * getHInstance_vf1() = 0;
	inline HINSTANCE__ * getHInstance() { return getHInstance_vf1(); }
	virtual void setABS_vf2(float  _arg0) = 0;
	inline void setABS(float  _arg0) { return setABS_vf2( _arg0); }
	virtual void setTC_vf3(float  _arg0) = 0;
	inline void setTC(float  _arg0) { return setTC_vf3( _arg0); }
	virtual void setStabilityControl_vf4(float  _arg0) = 0;
	inline void setStabilityControl(float  _arg0) { return setStabilityControl_vf4( _arg0); }
	virtual void setIdealLine_vf5(bool  _arg0, bool  _arg1) = 0;
	inline void setIdealLine(bool  _arg0, bool  _arg1) { return setIdealLine_vf5( _arg0,  _arg1); }
	virtual void setAutoShift_vf6(bool  _arg0) = 0;
	inline void setAutoShift(bool  _arg0) { return setAutoShift_vf6( _arg0); }
	virtual void setBrakeBias_vf7(float  _arg0) = 0;
	inline void setBrakeBias(float  _arg0) { return setBrakeBias_vf7( _arg0); }
	virtual void setSystemMessage_vf8(wchar_t *  _arg0, wchar_t *  _arg1, bool  _arg2) = 0;
	inline void setSystemMessage(wchar_t *  _arg0, wchar_t *  _arg1, bool  _arg2) { return setSystemMessage_vf8( _arg0,  _arg1,  _arg2); }
	inline void _guard_obj() {
		static_assert((sizeof(IACPPluginHost)==8),"bad size");
	};
};

//UDT: struct Lap @len=72
	//_Func: public void Lap(Lap & __that); @loc=static @len=113 @rva=242400
	//_Func: public void Lap(int  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void Lap(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: unsigned int, time
	//_Data: this+0x8, Member, Type: class std::vector<unsigned int,std::allocator<unsigned int> >, splits
	//_Data: this+0x20, Member, Type: unsigned int, cuts
	//_Data: this+0x24, Member, Type: bool, isValid
	//_Data: this+0x28, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, compound
	//_Func: public void ~Lap(); @loc=static @len=95 @rva=246624
	//_Func: public Lap & operator=(Lap &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct Lap {
public:
	unsigned int time;
	std::vector<unsigned int,std::allocator<unsigned int> > splits;
	unsigned int cuts;
	bool isValid;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > compound;
	inline Lap()  { }
	inline void ctor(Lap & __that) { typedef void (*_fpt)(Lap *pthis, Lap &); _fpt _f=(_fpt)_drva(242400); _f(this, __that); }
	inline void dtor() { typedef void (*_fpt)(Lap *pthis); _fpt _f=(_fpt)_drva(246624); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(Lap)==72),"bad size");
		static_assert((offsetof(Lap,time)==0x0),"bad off");
		static_assert((offsetof(Lap,splits)==0x8),"bad off");
		static_assert((offsetof(Lap,cuts)==0x20),"bad off");
		static_assert((offsetof(Lap,isValid)==0x24),"bad off");
		static_assert((offsetof(Lap,compound)==0x28),"bad off");
	};
};

//UDT: struct ksgui::OnListBoxItemClickedEvent @len=24
	//_Data: this+0x0, Member, Type: class ksgui::ListBox *, listBox
	//_Data: this+0x8, Member, Type: struct ksgui::ListBoxRowData *, row
	//_Data: this+0x10, Member, Type: unsigned int, itemIndex
//UDT;

struct ksgui_OnListBoxItemClickedEvent {
public:
	ksgui_ListBox * listBox;
	ksgui_ListBoxRowData * row;
	unsigned int itemIndex;
	inline ksgui_OnListBoxItemClickedEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_OnListBoxItemClickedEvent)==24),"bad size");
		static_assert((offsetof(ksgui_OnListBoxItemClickedEvent,listBox)==0x0),"bad off");
		static_assert((offsetof(ksgui_OnListBoxItemClickedEvent,row)==0x8),"bad off");
		static_assert((offsetof(ksgui_OnListBoxItemClickedEvent,itemIndex)==0x10),"bad off");
	};
};

//UDT: struct RemoteSessionResult @len=112
	//_Func: public void RemoteSessionResult(RemoteSessionResult & __that); @loc=static @len=125 @rva=242752
	//_Func: public void RemoteSessionResult(int carsCount); @loc=static @len=211 @rva=242880
	//_Func: public void RemoteSessionResult(); @loc=static @len=127 @rva=243104
	//_Data: this+0x0, Member, Type: class std::vector<int,std::allocator<int> >, positions
	//_Data: this+0x18, Member, Type: class std::vector<int,std::allocator<int> >, times
	//_Data: this+0x30, Member, Type: class std::vector<int,std::allocator<int> >, lapCounter
	//_Data: this+0x48, Member, Type: class std::vector<bool,std::allocator<bool> >, hasFinished
	//_Data: this+0x68, Member, Type: unsigned int, leaderLapCount
	//_Func: public void ~RemoteSessionResult(); @loc=static @len=184 @rva=246784
	//_Func: public RemoteSessionResult & operator=(RemoteSessionResult &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct RemoteSessionResult {
public:
	std::vector<int,std::allocator<int> > positions;
	std::vector<int,std::allocator<int> > times;
	std::vector<int,std::allocator<int> > lapCounter;
	std::vector<bool,std::allocator<bool> > hasFinished;
	unsigned int leaderLapCount;
	inline RemoteSessionResult()  { }
	inline void ctor(RemoteSessionResult & __that) { typedef void (*_fpt)(RemoteSessionResult *pthis, RemoteSessionResult &); _fpt _f=(_fpt)_drva(242752); _f(this, __that); }
	inline void ctor(int carsCount) { typedef void (*_fpt)(RemoteSessionResult *pthis, int); _fpt _f=(_fpt)_drva(242880); _f(this, carsCount); }
	inline void ctor() { typedef void (*_fpt)(RemoteSessionResult *pthis); _fpt _f=(_fpt)_drva(243104); _f(this); }
	inline void dtor() { typedef void (*_fpt)(RemoteSessionResult *pthis); _fpt _f=(_fpt)_drva(246784); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(RemoteSessionResult)==112),"bad size");
		static_assert((offsetof(RemoteSessionResult,positions)==0x0),"bad off");
		static_assert((offsetof(RemoteSessionResult,times)==0x18),"bad off");
		static_assert((offsetof(RemoteSessionResult,lapCounter)==0x30),"bad off");
		static_assert((offsetof(RemoteSessionResult,hasFinished)==0x48),"bad off");
		static_assert((offsetof(RemoteSessionResult,leaderLapCount)==0x68),"bad off");
	};
};

//UDT: struct RemoteSession @len=64
	//_Data: this+0x0, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Data: this+0x20, Member, Type: enum SessionType, type
	//_Data: this+0x24, Member, Type: int, index
	//_Data: this+0x28, Member, Type: int, time
	//_Data: this+0x2C, Member, Type: int, laps
	//_Data: this+0x30, Member, Type: double, startTime
	//_Data: this+0x38, Member, Type: bool, isSpectator
	//_Data: this+0x39, Member, Type: bool, isTimedRace
	//_Data: this+0x3A, Member, Type: bool, hasExtraLap
	//_Func: public void RemoteSession(RemoteSession & __that); @loc=static @len=112 @rva=242560
	//_Func: public void RemoteSession(); @loc=static @len=79 @rva=242672
	//_Func: public void ~RemoteSession(); @loc=static @len=47 @rva=2334528
	//_Func: public RemoteSession & operator=(RemoteSession &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct RemoteSession {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	SessionType type;
	int index;
	int time;
	int laps;
	double startTime;
	bool isSpectator;
	bool isTimedRace;
	bool hasExtraLap;
	inline RemoteSession()  { }
	inline void ctor(RemoteSession & __that) { typedef void (*_fpt)(RemoteSession *pthis, RemoteSession &); _fpt _f=(_fpt)_drva(242560); _f(this, __that); }
	inline void ctor() { typedef void (*_fpt)(RemoteSession *pthis); _fpt _f=(_fpt)_drva(242672); _f(this); }
	inline void dtor() { typedef void (*_fpt)(RemoteSession *pthis); _fpt _f=(_fpt)_drva(2334528); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(RemoteSession)==64),"bad size");
		static_assert((offsetof(RemoteSession,name)==0x0),"bad off");
		static_assert((offsetof(RemoteSession,type)==0x20),"bad off");
		static_assert((offsetof(RemoteSession,index)==0x24),"bad off");
		static_assert((offsetof(RemoteSession,time)==0x28),"bad off");
		static_assert((offsetof(RemoteSession,laps)==0x2C),"bad off");
		static_assert((offsetof(RemoteSession,startTime)==0x30),"bad off");
		static_assert((offsetof(RemoteSession,isSpectator)==0x38),"bad off");
		static_assert((offsetof(RemoteSession,isTimedRace)==0x39),"bad off");
		static_assert((offsetof(RemoteSession,hasExtraLap)==0x3A),"bad off");
	};
};

//UDT: class RenderTarget @len=40 @vfcount=1
	//_VTable: 
	//_Func: public void RenderTarget(RenderTarget &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void RenderTarget(GraphicsManager * graphics, eRenderTargetFormat fmt, unsigned int iwidth, unsigned int iheight, bool hasColor, bool hasDepth, int mips); @loc=static @len=276 @rva=2211888
	//_Func: public void ~RenderTarget(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=58 @rva=2212176
	//_Data: this+0x8, Member, Type: enum eRenderTargetFormat, format
	//_Data: this+0xC, Member, Type: int, width
	//_Data: this+0x10, Member, Type: int, height
	//_Data: this+0x14, Member, Type: bool, hasNullDepth
	//_Data: this+0x18, Member, Type: void *, kidColor
	//_Data: this+0x20, Member, Type: void *, kidDepth
	//_Func: public void clear(); @loc=static @len=109 @rva=2212336
	//_Func: public RenderTarget & operator=(RenderTarget &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class RenderTarget {
public:
	eRenderTargetFormat format;
	int width;
	int height;
	bool hasNullDepth;
	void * kidColor;
	void * kidDepth;
	inline RenderTarget()  { }
	inline void ctor(GraphicsManager * graphics, eRenderTargetFormat fmt, unsigned int iwidth, unsigned int iheight, bool hasColor, bool hasDepth, int mips) { typedef void (*_fpt)(RenderTarget *pthis, GraphicsManager *, eRenderTargetFormat, unsigned int, unsigned int, bool, bool, int); _fpt _f=(_fpt)_drva(2211888); _f(this, graphics, fmt, iwidth, iheight, hasColor, hasDepth, mips); }
	virtual ~RenderTarget();
	inline void dtor() { typedef void (*_fpt)(RenderTarget *pthis); _fpt _f=(_fpt)_drva(2212176); _f(this); }
	inline void clear() { typedef void (*_fpt)(RenderTarget *pthis); _fpt _f=(_fpt)_drva(2212336); return _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(RenderTarget)==40),"bad size");
		static_assert((offsetof(RenderTarget,format)==0x8),"bad off");
		static_assert((offsetof(RenderTarget,width)==0xC),"bad off");
		static_assert((offsetof(RenderTarget,height)==0x10),"bad off");
		static_assert((offsetof(RenderTarget,hasNullDepth)==0x14),"bad off");
		static_assert((offsetof(RenderTarget,kidColor)==0x18),"bad off");
		static_assert((offsetof(RenderTarget,kidDepth)==0x20),"bad off");
	};
};

//UDT: class OptionsManager @len=24 @vfcount=1
	//_VTable: 
	//_Func: public void OptionsManager(OptionsManager &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void OptionsManager(); @loc=static @len=1210 @rva=1627248
	//_Func: public void ~OptionsManager(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=55 @rva=1628464
	//_Data: this+0x8, Member, Type: class std::map<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,float,std::less<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > >,std::allocator<std::pair<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > const ,float> > >, options
	//_Func: protected void loadOptions(); @loc=static @len=446 @rva=1628704
	//_Func: public OptionsManager & operator=(OptionsManager &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class OptionsManager {
public:
	std::map<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,float,std::less<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > >,std::allocator<std::pair<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > const ,float> > > options;
	inline OptionsManager()  { }
	inline void ctor() { typedef void (*_fpt)(OptionsManager *pthis); _fpt _f=(_fpt)_drva(1627248); _f(this); }
	virtual ~OptionsManager();
	inline void dtor() { typedef void (*_fpt)(OptionsManager *pthis); _fpt _f=(_fpt)_drva(1628464); _f(this); }
	inline void loadOptions() { typedef void (*_fpt)(OptionsManager *pthis); _fpt _f=(_fpt)_drva(1628704); return _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(OptionsManager)==24),"bad size");
		static_assert((offsetof(OptionsManager,options)==0x8),"bad off");
	};
};

//UDT: class ShaderManager @len=40 @vfcount=1
	//_VTable: 
	//_Func: public void ShaderManager(ShaderManager &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ShaderManager(GraphicsManager * graphics); @loc=static @len=32 @rva=2259120
	//_Func: public void ~ShaderManager(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=62 @rva=2259152
	//_Func: public Shader * getShader(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & name); @loc=static @len=391 @rva=2259776
	//_Func: public void cleanup(); @loc=static @len=95 @rva=2259680
	//_Func: public std::vector<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,std::allocator<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > > > getShaders(); @loc=optimized @len=0 @rva=0
	//_Func: public std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > getPermutationSignature(std::vector<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,std::allocator<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > > > &  _arg0); @pure @loc=optimized @len=0 @rva=0
	//_Data: this+0x8, Member, Type: class GraphicsManager *, graphics
	//_Data: this+0x10, Member, Type: class std::vector<Shader *,std::allocator<Shader *> >, shaders
	//_Func: public ShaderManager & operator=(ShaderManager &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class ShaderManager {
public:
	GraphicsManager * graphics;
	std::vector<Shader *,std::allocator<Shader *> > shaders;
	inline ShaderManager()  { }
	inline void ctor(GraphicsManager * graphics) { typedef void (*_fpt)(ShaderManager *pthis, GraphicsManager *); _fpt _f=(_fpt)_drva(2259120); _f(this, graphics); }
	virtual ~ShaderManager();
	inline void dtor() { typedef void (*_fpt)(ShaderManager *pthis); _fpt _f=(_fpt)_drva(2259152); _f(this); }
	inline Shader * getShader(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & name) { typedef Shader * (*_fpt)(ShaderManager *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &); _fpt _f=(_fpt)_drva(2259776); return _f(this, name); }
	inline void cleanup() { typedef void (*_fpt)(ShaderManager *pthis); _fpt _f=(_fpt)_drva(2259680); return _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(ShaderManager)==40),"bad size");
		static_assert((offsetof(ShaderManager,graphics)==0x8),"bad off");
		static_assert((offsetof(ShaderManager,shaders)==0x10),"bad off");
	};
};

//UDT: class GameObject @len=88 @vfcount=6
	//_VTable: 
	//_Func: public void GameObject(GameObject &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void GameObject(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * iname, Game * igame); @loc=static @len=161 @rva=2358320
	//_Func: public void ~GameObject(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=167 @rva=2358496
	//_Data: this+0x8, Member, Type: class Game *, game
	//_Data: this+0x10, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Data: this+0x30, Member, Type: bool, isActive
	//_Func: public void removeGameObject(GameObject *  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public GameObject * getParent(); @loc=static @len=5 @rva=2358672
	//_Func: public void update(float deltaT); @intro @virtual vtpo=0 vfid=1 @loc=static @len=3 @rva=96368
	//_Func: public void render(float deltaT); @intro @virtual vtpo=0 vfid=2 @loc=static @len=3 @rva=96368
	//_Func: public void renderHUD(float deltaT); @intro @virtual vtpo=0 vfid=3 @loc=static @len=3 @rva=96368
	//_Func: public void renderAudio(float deltaT); @intro @virtual vtpo=0 vfid=4 @loc=static @len=3 @rva=96368
	//_Func: public void shutdown(); @intro @virtual vtpo=0 vfid=5 @loc=static @len=3 @rva=96368
	//_Func: public GameObject * findGameObject(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &  _arg0, GameObject *  _arg1); @pure @loc=optimized @len=0 @rva=0
	//_Func: public GameObject * getGameObject(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * name); @loc=static @len=242 @rva=1177456
	//_Data: this+0x38, Member, Type: class GameObject *, parent
	//_Data: this+0x40, Member, Type: class std::vector<GameObject *,std::allocator<GameObject *> >, gameObjects
	//_Func: public GameObject & operator=(GameObject &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class GameObject {
public:
	Game * game;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	bool isActive;
	GameObject * parent;
	std::vector<GameObject *,std::allocator<GameObject *> > gameObjects;
	inline GameObject()  { }
	inline void ctor(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * iname, Game * igame) { typedef void (*_fpt)(GameObject *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > *, Game *); _fpt _f=(_fpt)_drva(2358320); _f(this, iname, igame); }
	virtual ~GameObject();
	inline void dtor() { typedef void (*_fpt)(GameObject *pthis); _fpt _f=(_fpt)_drva(2358496); _f(this); }
	inline GameObject * getParent() { typedef GameObject * (*_fpt)(GameObject *pthis); _fpt _f=(_fpt)_drva(2358672); return _f(this); }
	virtual void update_vf1(float deltaT);
	inline void update_impl(float deltaT) { typedef void (*_fpt)(GameObject *pthis, float); _fpt _f=(_fpt)_drva(96368); return _f(this, deltaT); }
	inline void update(float deltaT) { return update_vf1(deltaT); }
	virtual void render_vf2(float deltaT);
	inline void render_impl(float deltaT) { typedef void (*_fpt)(GameObject *pthis, float); _fpt _f=(_fpt)_drva(96368); return _f(this, deltaT); }
	inline void render(float deltaT) { return render_vf2(deltaT); }
	virtual void renderHUD_vf3(float deltaT);
	inline void renderHUD_impl(float deltaT) { typedef void (*_fpt)(GameObject *pthis, float); _fpt _f=(_fpt)_drva(96368); return _f(this, deltaT); }
	inline void renderHUD(float deltaT) { return renderHUD_vf3(deltaT); }
	virtual void renderAudio_vf4(float deltaT);
	inline void renderAudio_impl(float deltaT) { typedef void (*_fpt)(GameObject *pthis, float); _fpt _f=(_fpt)_drva(96368); return _f(this, deltaT); }
	inline void renderAudio(float deltaT) { return renderAudio_vf4(deltaT); }
	virtual void shutdown_vf5();
	inline void shutdown_impl() { typedef void (*_fpt)(GameObject *pthis); _fpt _f=(_fpt)_drva(96368); return _f(this); }
	inline void shutdown() { return shutdown_vf5(); }
	inline GameObject * getGameObject(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > * name) { typedef GameObject * (*_fpt)(GameObject *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > *); _fpt _f=(_fpt)_drva(1177456); return _f(this, name); }
	inline void _guard_obj() {
		static_assert((sizeof(GameObject)==88),"bad size");
		static_assert((offsetof(GameObject,game)==0x8),"bad off");
		static_assert((offsetof(GameObject,name)==0x10),"bad off");
		static_assert((offsetof(GameObject,isActive)==0x30),"bad off");
		static_assert((offsetof(GameObject,parent)==0x38),"bad off");
		static_assert((offsetof(GameObject,gameObjects)==0x40),"bad off");
	};
};

//UDT: struct OnFlagEvent @len=16
	//_Data: this+0x0, Member, Type: class Car *, car
	//_Data: this+0x8, Member, Type: enum FlagEventType, type
	//_Data: this+0xC, Member, Type: enum PenaltyDescription, description
//UDT;

struct OnFlagEvent {
public:
	Car * car;
	FlagEventType type;
	PenaltyDescription description;
	inline OnFlagEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnFlagEvent)==16),"bad size");
		static_assert((offsetof(OnFlagEvent,car)==0x0),"bad off");
		static_assert((offsetof(OnFlagEvent,type)==0x8),"bad off");
		static_assert((offsetof(OnFlagEvent,description)==0xC),"bad off");
	};
};

//UDT: class CarRaceInfo @len=40 @vfcount=1
	//_VTable: 
	//_Func: public void CarRaceInfo(CarRaceInfo &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void CarRaceInfo(); @loc=static @len=78 @rva=948448
	//_Func: public void ~CarRaceInfo(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=55 @rva=948528
	//_Func: public void setSpawnPositionIndex(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & setName, int gp); @loc=static @len=26 @rva=951456
	//_Func: public int getSpawnPositionIndex(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & setName); @loc=static @len=20 @rva=950352
	//_Func: public void init(CarAvatar * acar); @loc=static @len=760 @rva=950384
	//_Data: this+0x8, Member, Type: class CarAvatar *, car
	//_Data: this+0x10, Member, Type: class std::map<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,int,std::less<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > >,std::allocator<std::pair<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > const ,int> > >, spawnPositionIndex
	//_Data: this+0x20, Member, Type: class RaceManager *, raceManager
	//_Func: public CarRaceInfo & operator=(CarRaceInfo &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class CarRaceInfo {
public:
	CarAvatar * car;
	std::map<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,int,std::less<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > >,std::allocator<std::pair<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > const ,int> > > spawnPositionIndex;
	RaceManager * raceManager;
	inline CarRaceInfo()  { }
	inline void ctor() { typedef void (*_fpt)(CarRaceInfo *pthis); _fpt _f=(_fpt)_drva(948448); _f(this); }
	virtual ~CarRaceInfo();
	inline void dtor() { typedef void (*_fpt)(CarRaceInfo *pthis); _fpt _f=(_fpt)_drva(948528); _f(this); }
	inline void setSpawnPositionIndex(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & setName, int gp) { typedef void (*_fpt)(CarRaceInfo *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &, int); _fpt _f=(_fpt)_drva(951456); return _f(this, setName, gp); }
	inline int getSpawnPositionIndex(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & setName) { typedef int (*_fpt)(CarRaceInfo *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &); _fpt _f=(_fpt)_drva(950352); return _f(this, setName); }
	inline void init(CarAvatar * acar) { typedef void (*_fpt)(CarRaceInfo *pthis, CarAvatar *); _fpt _f=(_fpt)_drva(950384); return _f(this, acar); }
	inline void _guard_obj() {
		static_assert((sizeof(CarRaceInfo)==40),"bad size");
		static_assert((offsetof(CarRaceInfo,car)==0x8),"bad off");
		static_assert((offsetof(CarRaceInfo,spawnPositionIndex)==0x10),"bad off");
		static_assert((offsetof(CarRaceInfo,raceManager)==0x20),"bad off");
	};
};

//UDT: struct ModelBoundariesCoordinates @len=24
	//_Data: this+0x0, Member, Type: float, front
	//_Data: this+0x4, Member, Type: float, rear
	//_Data: this+0x8, Member, Type: float, left
	//_Data: this+0xC, Member, Type: float, right
	//_Data: this+0x10, Member, Type: float, top
	//_Data: this+0x14, Member, Type: float, bottom
	//_Func: public void update(vec3f  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ModelBoundariesCoordinates(); @loc=optimized @len=0 @rva=0
//UDT;

struct ModelBoundariesCoordinates {
public:
	float front;
	float rear;
	float left;
	float right;
	float top;
	float bottom;
	inline ModelBoundariesCoordinates()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ModelBoundariesCoordinates)==24),"bad size");
		static_assert((offsetof(ModelBoundariesCoordinates,front)==0x0),"bad off");
		static_assert((offsetof(ModelBoundariesCoordinates,rear)==0x4),"bad off");
		static_assert((offsetof(ModelBoundariesCoordinates,left)==0x8),"bad off");
		static_assert((offsetof(ModelBoundariesCoordinates,right)==0xC),"bad off");
		static_assert((offsetof(ModelBoundariesCoordinates,top)==0x10),"bad off");
		static_assert((offsetof(ModelBoundariesCoordinates,bottom)==0x14),"bad off");
	};
};

//UDT: struct PhysicsCPUTimes @len=40
	//_Data: this+0x0, Member, Type: double, carStep
	//_Data: this+0x8, Member, Type: struct CoreCPUTimes, coreCPUTimes
	//_Data: this+0x20, Member, Type: int, currentCPU
	//_Func: public void PhysicsCPUTimes(); @loc=optimized @len=0 @rva=0
//UDT;

struct PhysicsCPUTimes {
public:
	double carStep;
	CoreCPUTimes coreCPUTimes;
	int currentCPU;
	inline PhysicsCPUTimes()  { }
	inline void _guard_obj() {
		static_assert((sizeof(PhysicsCPUTimes)==40),"bad size");
		static_assert((offsetof(PhysicsCPUTimes,carStep)==0x0),"bad off");
		static_assert((offsetof(PhysicsCPUTimes,coreCPUTimes)==0x8),"bad off");
		static_assert((offsetof(PhysicsCPUTimes,currentCPU)==0x20),"bad off");
	};
};

//UDT: struct CollisionEvent @len=44
	//_Data: this+0x0, Member, Type: int, carIndex
	//_Data: this+0x4, Member, Type: float, normalForce
	//_Data: this+0x8, Member, Type: class vec3f, pos
	//_Data: this+0x14, Member, Type: class vec3f, normal
	//_Data: this+0x20, Member, Type: float, impactAngle
	//_Data: this+0x24, Member, Type: float, relativeSpeed
	//_Data: this+0x28, Member, Type: unsigned long, colliderCategory
	//_Func: public void CollisionEvent(); @loc=optimized @len=0 @rva=0
//UDT;

struct CollisionEvent {
public:
	int carIndex;
	float normalForce;
	vec3f pos;
	vec3f normal;
	float impactAngle;
	float relativeSpeed;
	unsigned long colliderCategory;
	inline CollisionEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(CollisionEvent)==44),"bad size");
		static_assert((offsetof(CollisionEvent,carIndex)==0x0),"bad off");
		static_assert((offsetof(CollisionEvent,normalForce)==0x4),"bad off");
		static_assert((offsetof(CollisionEvent,pos)==0x8),"bad off");
		static_assert((offsetof(CollisionEvent,normal)==0x14),"bad off");
		static_assert((offsetof(CollisionEvent,impactAngle)==0x20),"bad off");
		static_assert((offsetof(CollisionEvent,relativeSpeed)==0x24),"bad off");
		static_assert((offsetof(CollisionEvent,colliderCategory)==0x28),"bad off");
	};
};

//UDT: struct CarCollisionBox @len=32
	//_Func: public void CarCollisionBox(vec3f &  _arg0, vec3f &  _arg1); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class vec3f, centre
	//_Data: this+0xC, Member, Type: class vec3f, size
	//_Data: this+0x18, Member, Type: unsigned __int64, id
//UDT;

struct CarCollisionBox {
public:
	vec3f centre;
	vec3f size;
	unsigned __int64 id;
	inline CarCollisionBox()  { }
	inline void _guard_obj() {
		static_assert((sizeof(CarCollisionBox)==32),"bad size");
		static_assert((offsetof(CarCollisionBox,centre)==0x0),"bad off");
		static_assert((offsetof(CarCollisionBox,size)==0xC),"bad off");
		static_assert((offsetof(CarCollisionBox,id)==0x18),"bad off");
	};
};

//UDT: struct UDPMessage @len=32
	//_Data: this+0x0, Member, Type: void *, data
	//_Data: this+0x8, Member, Type: int, size
	//_Data: this+0xC, Member, Type: struct sockaddr_in, srcAddress
	//_Func: public void UDPMessage(); @loc=optimized @len=0 @rva=0
//UDT;

struct UDPMessage {
public:
	void * data;
	int size;
	sockaddr_in srcAddress;
	inline UDPMessage()  { }
	inline void _guard_obj() {
		static_assert((sizeof(UDPMessage)==32),"bad size");
		static_assert((offsetof(UDPMessage,data)==0x0),"bad off");
		static_assert((offsetof(UDPMessage,size)==0x8),"bad off");
		static_assert((offsetof(UDPMessage,srcAddress)==0xC),"bad off");
	};
};

//UDT: struct AIState @len=60
	//_Func: public void AIState(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, currentSteerSignal
	//_Data: this+0x4, Member, Type: class vec3f, steerTarget
	//_Data: this+0x10, Member, Type: float, gasBrakeTarget
	//_Data: this+0x14, Member, Type: bool, isActive
	//_Data: this+0x18, Member, Type: float, targetSpeed
	//_Data: this+0x1C, Member, Type: float, targetLateralOffset
	//_Data: this+0x20, Member, Type: float, brakeTargetSpeed
	//_Data: this+0x24, Member, Type: float, brakeTargetDist
	//_Data: this+0x28, Member, Type: float, currentNormalizedSplinePosition
	//_Data: this+0x2C, Member, Type: float, outsideOffset
	//_Data: this+0x30, Member, Type: float, projDNRPM
	//_Data: this+0x34, Member, Type: float, understeerFactor
	//_Data: this+0x38, Member, Type: float, currentPush
//UDT;

struct AIState {
public:
	float currentSteerSignal;
	vec3f steerTarget;
	float gasBrakeTarget;
	bool isActive;
	float targetSpeed;
	float targetLateralOffset;
	float brakeTargetSpeed;
	float brakeTargetDist;
	float currentNormalizedSplinePosition;
	float outsideOffset;
	float projDNRPM;
	float understeerFactor;
	float currentPush;
	inline AIState()  { }
	inline void _guard_obj() {
		static_assert((sizeof(AIState)==60),"bad size");
		static_assert((offsetof(AIState,currentSteerSignal)==0x0),"bad off");
		static_assert((offsetof(AIState,steerTarget)==0x4),"bad off");
		static_assert((offsetof(AIState,gasBrakeTarget)==0x10),"bad off");
		static_assert((offsetof(AIState,isActive)==0x14),"bad off");
		static_assert((offsetof(AIState,targetSpeed)==0x18),"bad off");
		static_assert((offsetof(AIState,targetLateralOffset)==0x1C),"bad off");
		static_assert((offsetof(AIState,brakeTargetSpeed)==0x20),"bad off");
		static_assert((offsetof(AIState,brakeTargetDist)==0x24),"bad off");
		static_assert((offsetof(AIState,currentNormalizedSplinePosition)==0x28),"bad off");
		static_assert((offsetof(AIState,outsideOffset)==0x2C),"bad off");
		static_assert((offsetof(AIState,projDNRPM)==0x30),"bad off");
		static_assert((offsetof(AIState,understeerFactor)==0x34),"bad off");
		static_assert((offsetof(AIState,currentPush)==0x38),"bad off");
	};
};

//UDT: struct PhysicsValueCache @len=4
	//_Data: this+0x0, Member, Type: class Speed, speed
	//_Func: public void PhysicsValueCache(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~PhysicsValueCache(); @loc=static @len=5 @rva=1183184
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct PhysicsValueCache {
public:
	Speed speed;
	inline PhysicsValueCache()  { }
	inline void dtor() { typedef void (*_fpt)(PhysicsValueCache *pthis); _fpt _f=(_fpt)_drva(1183184); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(PhysicsValueCache)==4),"bad size");
		static_assert((offsetof(PhysicsValueCache,speed)==0x0),"bad off");
	};
};

//UDT: class plane4f @len=16
	//_Data: this+0x0, Member, Type: class vec3f, normal
	//_Data: this+0xC, Member, Type: float, d
	//_Func: public void plane4f(vec3f & point1, vec3f & point2, vec3f & point3); @loc=static @len=308 @rva=1146576
	//_Func: public void plane4f(vec3f &  _arg0, vec3f &  _arg1); @loc=optimized @len=0 @rva=0
	//_Func: public void plane4f(); @loc=optimized @len=0 @rva=0
	//_Func: public vec3f getRayIntersection(vec3f &  _arg0, vec3f &  _arg1); @loc=optimized @len=0 @rva=0
//UDT;

class plane4f {
public:
	vec3f normal;
	float d;
	inline plane4f()  { }
	inline void ctor(vec3f & point1, vec3f & point2, vec3f & point3) { typedef void (*_fpt)(plane4f *pthis, vec3f &, vec3f &, vec3f &); _fpt _f=(_fpt)_drva(1146576); _f(this, point1, point2, point3); }
	inline void _guard_obj() {
		static_assert((sizeof(plane4f)==16),"bad size");
		static_assert((offsetof(plane4f,normal)==0x0),"bad off");
		static_assert((offsetof(plane4f,d)==0xC),"bad off");
	};
};

//UDT: struct NetCarState @len=136
	//_Func: public void NetCarState(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class vec3f, pos
	//_Data: this+0xC, Member, Type: class vec3f, rotation
	//_Data: this+0x18, Member, Type: class vec3f, velocity
	//_Data: this+0x24, Member, Type: class vec3f, acceleration
	//_Data: this+0x30, Member, Type: double, timeStamp
	//_Data: this+0x38, Member, Type: double, rcvTime
	//_Data: this+0x40, Member, Type: unsigned char, pakSequenceId
	//_Data: this+0x44, Member, Type: float, targetHeight
	//_Data: this+0x48, Member, Type: float[0x4], tyreAngularSpeed
	//_Data: this+0x58, Member, Type: unsigned short, engineRPM
	//_Data: this+0x5C, Member, Type: float, steerAngle
	//_Data: this+0x60, Member, Type: float, wheelAngle
	//_Data: this+0x64, Member, Type: int, gearIndex
	//_Data: this+0x68, Member, Type: unsigned int, statusBytes
	//_Data: this+0x6C, Member, Type: float, aoa
	//_Data: this+0x70, Member, Type: class vec3f, aoaAxis
	//_Data: this+0x7C, Member, Type: int, ping
	//_Data: this+0x80, Member, Type: float, performanceDelta
	//_Data: this+0x84, Member, Type: float, gas
//UDT;

struct NetCarState {
public:
	vec3f pos;
	vec3f rotation;
	vec3f velocity;
	vec3f acceleration;
	double timeStamp;
	double rcvTime;
	unsigned char pakSequenceId;
	float targetHeight;
	float tyreAngularSpeed[0x4];
	unsigned short engineRPM;
	float steerAngle;
	float wheelAngle;
	int gearIndex;
	unsigned int statusBytes;
	float aoa;
	vec3f aoaAxis;
	int ping;
	float performanceDelta;
	float gas;
	inline NetCarState()  { }
	inline void _guard_obj() {
		static_assert((sizeof(NetCarState)==136),"bad size");
		static_assert((offsetof(NetCarState,pos)==0x0),"bad off");
		static_assert((offsetof(NetCarState,rotation)==0xC),"bad off");
		static_assert((offsetof(NetCarState,velocity)==0x18),"bad off");
		static_assert((offsetof(NetCarState,acceleration)==0x24),"bad off");
		static_assert((offsetof(NetCarState,timeStamp)==0x30),"bad off");
		static_assert((offsetof(NetCarState,rcvTime)==0x38),"bad off");
		static_assert((offsetof(NetCarState,pakSequenceId)==0x40),"bad off");
		static_assert((offsetof(NetCarState,targetHeight)==0x44),"bad off");
		static_assert((offsetof(NetCarState,tyreAngularSpeed)==0x48),"bad off");
		static_assert((offsetof(NetCarState,engineRPM)==0x58),"bad off");
		static_assert((offsetof(NetCarState,steerAngle)==0x5C),"bad off");
		static_assert((offsetof(NetCarState,wheelAngle)==0x60),"bad off");
		static_assert((offsetof(NetCarState,gearIndex)==0x64),"bad off");
		static_assert((offsetof(NetCarState,statusBytes)==0x68),"bad off");
		static_assert((offsetof(NetCarState,aoa)==0x6C),"bad off");
		static_assert((offsetof(NetCarState,aoaAxis)==0x70),"bad off");
		static_assert((offsetof(NetCarState,ping)==0x7C),"bad off");
		static_assert((offsetof(NetCarState,performanceDelta)==0x80),"bad off");
		static_assert((offsetof(NetCarState,gas)==0x84),"bad off");
	};
};

//UDT: struct CarCollisionBounds @len=40
	//_Data: this+0x0, Member, Type: class vec3f, min
	//_Data: this+0xC, Member, Type: class vec3f, max
	//_Data: this+0x18, Member, Type: float, length
	//_Data: this+0x1C, Member, Type: float, width
	//_Data: this+0x20, Member, Type: float, lengthFront
	//_Data: this+0x24, Member, Type: float, lengthRear
	//_Func: public void CarCollisionBounds(); @loc=optimized @len=0 @rva=0
//UDT;

struct CarCollisionBounds {
public:
	vec3f min;
	vec3f max;
	float length;
	float width;
	float lengthFront;
	float lengthRear;
	inline CarCollisionBounds()  { }
	inline void _guard_obj() {
		static_assert((sizeof(CarCollisionBounds)==40),"bad size");
		static_assert((offsetof(CarCollisionBounds,min)==0x0),"bad off");
		static_assert((offsetof(CarCollisionBounds,max)==0xC),"bad off");
		static_assert((offsetof(CarCollisionBounds,length)==0x18),"bad off");
		static_assert((offsetof(CarCollisionBounds,width)==0x1C),"bad off");
		static_assert((offsetof(CarCollisionBounds,lengthFront)==0x20),"bad off");
		static_assert((offsetof(CarCollisionBounds,lengthRear)==0x24),"bad off");
	};
};

//UDT: class Turbo @len=36
	//_Func: public void Turbo(TurboDef & data); @loc=static @len=67 @rva=2811696
	//_Func: public void ~Turbo(); @loc=static @len=3 @rva=96368
	//_Func: public void step(float gas, float rpms, float dt); @loc=static @len=236 @rva=2811840
	//_Func: public float getBoost(); @loc=static @len=11 @rva=2811776
	//_Func: public void reset(); @loc=static @len=8 @rva=2811792
	//_Func: public void setTurboBoostLevel(float value); @loc=static @len=18 @rva=2811808
	//_Func: public float getTurboBoostLevel(); @loc=optimized @len=0 @rva=0
	//_Func: public void setWastegate(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public float getWastegate(); @loc=static @len=6 @rva=2645504
	//_Func: public float getMaxBoost(bool  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void setMaxBoost(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: float, userSetting
	//_Data: this+0x4, Member, Type: float, rotation
	//_Data: this+0x8, Member, Type: struct TurboDef, data
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class Turbo {
public:
	float userSetting;
	float rotation;
	TurboDef data;
	inline Turbo()  { }
	inline void ctor(TurboDef & data) { typedef void (*_fpt)(Turbo *pthis, TurboDef &); _fpt _f=(_fpt)_drva(2811696); _f(this, data); }
	inline void dtor() { typedef void (*_fpt)(Turbo *pthis); _fpt _f=(_fpt)_drva(96368); _f(this); }
	inline void step(float gas, float rpms, float dt) { typedef void (*_fpt)(Turbo *pthis, float, float, float); _fpt _f=(_fpt)_drva(2811840); return _f(this, gas, rpms, dt); }
	inline float getBoost() { typedef float (*_fpt)(Turbo *pthis); _fpt _f=(_fpt)_drva(2811776); return _f(this); }
	inline void reset() { typedef void (*_fpt)(Turbo *pthis); _fpt _f=(_fpt)_drva(2811792); return _f(this); }
	inline void setTurboBoostLevel(float value) { typedef void (*_fpt)(Turbo *pthis, float); _fpt _f=(_fpt)_drva(2811808); return _f(this, value); }
	inline float getWastegate() { typedef float (*_fpt)(Turbo *pthis); _fpt _f=(_fpt)_drva(2645504); return _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(Turbo)==36),"bad size");
		static_assert((offsetof(Turbo,userSetting)==0x0),"bad off");
		static_assert((offsetof(Turbo,rotation)==0x4),"bad off");
		static_assert((offsetof(Turbo,data)==0x8),"bad off");
	};
};

//UDT: struct OnMouseWheelMovedEvent @len=16
	//_Base: struct MouseEvent @off=0 @len=12
	//_Func: public void OnMouseWheelMovedEvent(int  _arg0, int  _arg1, float  _arg2); @loc=optimized @len=0 @rva=0
	//_Data: this+0xC, Member, Type: float, delta
//UDT;

struct OnMouseWheelMovedEvent : public MouseEvent {
public:
	float delta;
	inline OnMouseWheelMovedEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnMouseWheelMovedEvent)==16),"bad size");
		static_assert((offsetof(OnMouseWheelMovedEvent,delta)==0xC),"bad off");
	};
};

//UDT: struct SystemCBuffers @len=160
	//_Data: this+0x0, Member, Type: class CBuffer, cbCamera
	//_Data: this+0x28, Member, Type: class CBuffer, cbPerObject
	//_Data: this+0x50, Member, Type: class CBuffer, cbLighting
	//_Data: this+0x78, Member, Type: class CBuffer, cbShadowMap
	//_Func: public void SystemCBuffers(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~SystemCBuffers(); @loc=static @len=65 @rva=2106176
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct SystemCBuffers {
public:
	CBuffer cbCamera;
	CBuffer cbPerObject;
	CBuffer cbLighting;
	CBuffer cbShadowMap;
	inline SystemCBuffers()  { }
	inline void dtor() { typedef void (*_fpt)(SystemCBuffers *pthis); _fpt _f=(_fpt)_drva(2106176); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(SystemCBuffers)==160),"bad size");
		static_assert((offsetof(SystemCBuffers,cbCamera)==0x0),"bad off");
		static_assert((offsetof(SystemCBuffers,cbPerObject)==0x28),"bad off");
		static_assert((offsetof(SystemCBuffers,cbLighting)==0x50),"bad off");
		static_assert((offsetof(SystemCBuffers,cbShadowMap)==0x78),"bad off");
	};
};

//UDT: struct OnMouseMoveEvent @len=12
	//_Base: struct MouseEvent @off=0 @len=12
	//_Func: public void OnMouseMoveEvent(int  _arg0, int  _arg1); @loc=optimized @len=0 @rva=0
//UDT;

struct OnMouseMoveEvent : public MouseEvent {
public:
	inline OnMouseMoveEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnMouseMoveEvent)==12),"bad size");
	};
};

//UDT: class vec4f @len=16
	//_Data: this+0x0, Member, Type: float, x
	//_Data: this+0x4, Member, Type: float, y
	//_Data: this+0x8, Member, Type: float, z
	//_Data: this+0xC, Member, Type: float, w
	//_Func: public void vec4f(vec3f & v3, float vw); @loc=static @len=25 @rva=962960
	//_Func: public void vec4f(float *  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void vec4f(float ix, float iy, float iz, float iw); @loc=static @len=29 @rva=3178496
	//_Func: public void vec4f(); @loc=static @len=13 @rva=508768
	//_Func: public vec3f toVec3fLinear(); @loc=optimized @len=0 @rva=0
	//_Func: public float length(); @loc=optimized @len=0 @rva=0
//UDT;

class vec4f {
public:
	float x;
	float y;
	float z;
	float w;
	inline vec4f()  { }
	inline void ctor(vec3f & v3, float vw) { typedef void (*_fpt)(vec4f *pthis, vec3f &, float); _fpt _f=(_fpt)_drva(962960); _f(this, v3, vw); }
	inline void ctor(float ix, float iy, float iz, float iw) { typedef void (*_fpt)(vec4f *pthis, float, float, float, float); _fpt _f=(_fpt)_drva(3178496); _f(this, ix, iy, iz, iw); }
	inline void ctor() { typedef void (*_fpt)(vec4f *pthis); _fpt _f=(_fpt)_drva(508768); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(vec4f)==16),"bad size");
		static_assert((offsetof(vec4f,x)==0x0),"bad off");
		static_assert((offsetof(vec4f,y)==0x4),"bad off");
		static_assert((offsetof(vec4f,z)==0x8),"bad off");
		static_assert((offsetof(vec4f,w)==0xC),"bad off");
	};
};

//UDT: class ThermalObject @len=32 @vfcount=1
	//_VTable: 
	//_Func: public void ThermalObject(ThermalObject &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ThermalObject(); @loc=static @len=42 @rva=2829952
	//_Func: public void ~ThermalObject(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=11 @rva=2830000
	//_Data: this+0x8, Member, Type: float, tmass
	//_Data: this+0xC, Member, Type: float, coolSpeedK
	//_Data: this+0x10, Member, Type: float, coolFactor
	//_Data: this+0x14, Member, Type: float, heatFactor
	//_Data: this+0x18, Member, Type: float, t
	//_Func: public void step(float dt, float ambientTemp, Speed & speed); @loc=static @len=128 @rva=2830080
	//_Func: public void addHeadSource(float heat); @loc=static @len=11 @rva=2830064
	//_Data: this+0x1C, Member, Type: float, heatAccumulator
	//_Func: public ThermalObject & operator=(ThermalObject &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class ThermalObject {
public:
	float tmass;
	float coolSpeedK;
	float coolFactor;
	float heatFactor;
	float t;
	float heatAccumulator;
	inline ThermalObject()  { }
	inline void ctor() { typedef void (*_fpt)(ThermalObject *pthis); _fpt _f=(_fpt)_drva(2829952); _f(this); }
	virtual ~ThermalObject();
	inline void dtor() { typedef void (*_fpt)(ThermalObject *pthis); _fpt _f=(_fpt)_drva(2830000); _f(this); }
	inline void step(float dt, float ambientTemp, Speed & speed) { typedef void (*_fpt)(ThermalObject *pthis, float, float, Speed &); _fpt _f=(_fpt)_drva(2830080); return _f(this, dt, ambientTemp, speed); }
	inline void addHeadSource(float heat) { typedef void (*_fpt)(ThermalObject *pthis, float); _fpt _f=(_fpt)_drva(2830064); return _f(this, heat); }
	inline void _guard_obj() {
		static_assert((sizeof(ThermalObject)==32),"bad size");
		static_assert((offsetof(ThermalObject,tmass)==0x8),"bad off");
		static_assert((offsetof(ThermalObject,coolSpeedK)==0xC),"bad off");
		static_assert((offsetof(ThermalObject,coolFactor)==0x10),"bad off");
		static_assert((offsetof(ThermalObject,heatFactor)==0x14),"bad off");
		static_assert((offsetof(ThermalObject,t)==0x18),"bad off");
		static_assert((offsetof(ThermalObject,heatAccumulator)==0x1C),"bad off");
	};
};

//UDT: class Joypad @len=8 @vfcount=7
	//_VTable: 
	//_Func: public void acquire(); @intro @pure @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
	//_Func: public vec2f getLeftStick(); @intro @pure @virtual vtpo=0 vfid=1 @loc=optimized @len=0 @rva=0
	//_Func: public vec2f getRightStick(); @intro @pure @virtual vtpo=0 vfid=2 @loc=optimized @len=0 @rva=0
	//_Func: public float getLeftTrigger(); @intro @pure @virtual vtpo=0 vfid=3 @loc=optimized @len=0 @rva=0
	//_Func: public float getRightTrigger(); @intro @pure @virtual vtpo=0 vfid=4 @loc=optimized @len=0 @rva=0
	//_Func: public unsigned int getButtonMask(); @intro @pure @virtual vtpo=0 vfid=5 @loc=optimized @len=0 @rva=0
	//_Func: public void setVibrations(float  _arg0, float  _arg1); @intro @pure @virtual vtpo=0 vfid=6 @loc=optimized @len=0 @rva=0
	//_Func: public void Joypad(Joypad &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void Joypad(); @loc=optimized @len=0 @rva=0
	//_Func: public Joypad & operator=(Joypad &  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class Joypad {
public:
	inline Joypad()  { }
	virtual void acquire_vf0() = 0;
	inline void acquire() { return acquire_vf0(); }
	virtual vec2f getLeftStick_vf1() = 0;
	inline vec2f getLeftStick() { return getLeftStick_vf1(); }
	virtual vec2f getRightStick_vf2() = 0;
	inline vec2f getRightStick() { return getRightStick_vf2(); }
	virtual float getLeftTrigger_vf3() = 0;
	inline float getLeftTrigger() { return getLeftTrigger_vf3(); }
	virtual float getRightTrigger_vf4() = 0;
	inline float getRightTrigger() { return getRightTrigger_vf4(); }
	virtual unsigned int getButtonMask_vf5() = 0;
	inline unsigned int getButtonMask() { return getButtonMask_vf5(); }
	virtual void setVibrations_vf6(float  _arg0, float  _arg1) = 0;
	inline void setVibrations(float  _arg0, float  _arg1) { return setVibrations_vf6( _arg0,  _arg1); }
	inline void _guard_obj() {
		static_assert((sizeof(Joypad)==8),"bad size");
	};
};

//UDT: class ICollisionCallback @len=8 @vfcount=2
	//_VTable: 
	//_Func: public void ~ICollisionCallback(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=11 @rva=2501856
	//_Func: public void onCollisionCallBack(void *  _arg0, void *  _arg1, void *  _arg2, void *  _arg3, vec3f  _arg4, vec3f  _arg5, float  _arg6); @intro @pure @virtual vtpo=0 vfid=1 @loc=optimized @len=0 @rva=0
	//_Func: public void ICollisionCallback(ICollisionCallback &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ICollisionCallback(); @loc=optimized @len=0 @rva=0
	//_Func: public ICollisionCallback & operator=(ICollisionCallback &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class ICollisionCallback {
public:
	inline ICollisionCallback()  { }
	virtual ~ICollisionCallback();
	inline void dtor() { typedef void (*_fpt)(ICollisionCallback *pthis); _fpt _f=(_fpt)_drva(2501856); _f(this); }
	virtual void onCollisionCallBack_vf1(void *  _arg0, void *  _arg1, void *  _arg2, void *  _arg3, vec3f  _arg4, vec3f  _arg5, float  _arg6) = 0;
	inline void onCollisionCallBack(void *  _arg0, void *  _arg1, void *  _arg2, void *  _arg3, vec3f  _arg4, vec3f  _arg5, float  _arg6) { return onCollisionCallBack_vf1( _arg0,  _arg1,  _arg2,  _arg3,  _arg4,  _arg5,  _arg6); }
	inline void _guard_obj() {
		static_assert((sizeof(ICollisionCallback)==8),"bad size");
	};
};

//UDT: struct OnNewSessionEvent @len=120
	//_Data: this+0x0, Member, Type: class Session, newSession
	//_Data: this+0x70, Member, Type: short, index
	//_Func: public void OnNewSessionEvent(OnNewSessionEvent &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void OnNewSessionEvent(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~OnNewSessionEvent(); @loc=static @len=90 @rva=584992
	//_Func: public OnNewSessionEvent & operator=(OnNewSessionEvent &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct OnNewSessionEvent {
public:
	Session newSession;
	short index;
	inline OnNewSessionEvent()  { }
	inline void dtor() { typedef void (*_fpt)(OnNewSessionEvent *pthis); _fpt _f=(_fpt)_drva(584992); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(OnNewSessionEvent)==120),"bad size");
		static_assert((offsetof(OnNewSessionEvent,newSession)==0x0),"bad off");
		static_assert((offsetof(OnNewSessionEvent,index)==0x70),"bad off");
	};
};

//UDT: class SinSignalGenerator @len=16 @vfcount=3
	//_Base: class SignalGenerator @off=0 @len=16
	//_Func: public void SinSignalGenerator(SinSignalGenerator &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void SinSignalGenerator(); @loc=static @len=33 @rva=2197680
	//_Func: public void ~SinSignalGenerator(); @virtual vtpo=0 vfid=0 @loc=static @len=15 @rva=2197728
	//_Func: public float getValue(); @virtual vtpo=0 vfid=2 @loc=static @len=81 @rva=2197808
	//_Func: public SinSignalGenerator & operator=(SinSignalGenerator &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class SinSignalGenerator : public SignalGenerator {
public:
	inline SinSignalGenerator()  { }
	inline void ctor() { typedef void (*_fpt)(SinSignalGenerator *pthis); _fpt _f=(_fpt)_drva(2197680); _f(this); }
	virtual ~SinSignalGenerator();
	inline void dtor() { typedef void (*_fpt)(SinSignalGenerator *pthis); _fpt _f=(_fpt)_drva(2197728); _f(this); }
	virtual float getValue_vf2();
	inline float getValue_impl() { typedef float (*_fpt)(SinSignalGenerator *pthis); _fpt _f=(_fpt)_drva(2197808); return _f(this); }
	inline float getValue() { return getValue_vf2(); }
	inline void _guard_obj() {
		static_assert((sizeof(SinSignalGenerator)==16),"bad size");
	};
};

//UDT: struct WingState @len=68
	//_Data: this+0x0, Member, Type: float, aoa
	//_Data: this+0x4, Member, Type: float, cd
	//_Data: this+0x8, Member, Type: float, cl
	//_Data: this+0xC, Member, Type: float, angle
	//_Data: this+0x10, Member, Type: float, inputAngle
	//_Data: this+0x14, Member, Type: float, groundHeight
	//_Data: this+0x18, Member, Type: float, frontShare
	//_Data: this+0x1C, Member, Type: float, dragKG
	//_Data: this+0x20, Member, Type: float, liftKG
	//_Data: this+0x24, Member, Type: float, angleMult
	//_Data: this+0x28, Member, Type: float, groundEffectLift
	//_Data: this+0x2C, Member, Type: float, groundEffectDrag
	//_Data: this+0x30, Member, Type: float, yawAngle
	//_Data: this+0x34, Member, Type: bool, isVertical
	//_Data: this+0x38, Member, Type: class vec3f, liftVector
	//_Func: public void WingState(); @loc=optimized @len=0 @rva=0
//UDT;

struct WingState {
public:
	float aoa;
	float cd;
	float cl;
	float angle;
	float inputAngle;
	float groundHeight;
	float frontShare;
	float dragKG;
	float liftKG;
	float angleMult;
	float groundEffectLift;
	float groundEffectDrag;
	float yawAngle;
	bool isVertical;
	vec3f liftVector;
	inline WingState()  { }
	inline void _guard_obj() {
		static_assert((sizeof(WingState)==68),"bad size");
		static_assert((offsetof(WingState,aoa)==0x0),"bad off");
		static_assert((offsetof(WingState,cd)==0x4),"bad off");
		static_assert((offsetof(WingState,cl)==0x8),"bad off");
		static_assert((offsetof(WingState,angle)==0xC),"bad off");
		static_assert((offsetof(WingState,inputAngle)==0x10),"bad off");
		static_assert((offsetof(WingState,groundHeight)==0x14),"bad off");
		static_assert((offsetof(WingState,frontShare)==0x18),"bad off");
		static_assert((offsetof(WingState,dragKG)==0x1C),"bad off");
		static_assert((offsetof(WingState,liftKG)==0x20),"bad off");
		static_assert((offsetof(WingState,angleMult)==0x24),"bad off");
		static_assert((offsetof(WingState,groundEffectLift)==0x28),"bad off");
		static_assert((offsetof(WingState,groundEffectDrag)==0x2C),"bad off");
		static_assert((offsetof(WingState,yawAngle)==0x30),"bad off");
		static_assert((offsetof(WingState,isVertical)==0x34),"bad off");
		static_assert((offsetof(WingState,liftVector)==0x38),"bad off");
	};
};

//UDT: struct LightingSettings @len=180
	//_Func: public void LightingSettings(); @loc=static @len=323 @rva=2104736
	//_Data: this+0x0, Member, Type: class vec3f, lightDirection
	//_Data: this+0xC, Member, Type: class vec3f, lightColor
	//_Data: this+0x18, Member, Type: class vec3f, horizonLow
	//_Data: this+0x24, Member, Type: class vec3f, horizonHigh
	//_Data: this+0x30, Member, Type: class vec3f, skyLow
	//_Data: this+0x3C, Member, Type: class vec3f, skyHigh
	//_Data: this+0x48, Member, Type: class vec3f, sunLow
	//_Data: this+0x54, Member, Type: class vec3f, sunHigh
	//_Data: this+0x60, Member, Type: float, angle
	//_Data: this+0x64, Member, Type: float, headingAngle
	//_Data: this+0x68, Member, Type: float, pitchAngle
	//_Data: this+0x6C, Member, Type: class vec3f, ambientLow
	//_Data: this+0x78, Member, Type: class vec3f, ambientHigh
	//_Data: this+0x84, Member, Type: class vec3f, fogColor
	//_Data: this+0x90, Member, Type: float, fogLinear
	//_Data: this+0x94, Member, Type: float, fogBlend
	//_Data: this+0x98, Member, Type: float, cloudCover
	//_Data: this+0x9C, Member, Type: float, cloudCutoff
	//_Data: this+0xA0, Member, Type: float, cloudColor
	//_Data: this+0xA4, Member, Type: float, cloudOffset
	//_Data: this+0xA8, Member, Type: float, saturation
	//_Data: this+0xAC, Member, Type: float, gameTime
	//_Data: this+0xB0, Member, Type: float, sunAngleGamma
//UDT;

struct LightingSettings {
public:
	vec3f lightDirection;
	vec3f lightColor;
	vec3f horizonLow;
	vec3f horizonHigh;
	vec3f skyLow;
	vec3f skyHigh;
	vec3f sunLow;
	vec3f sunHigh;
	float angle;
	float headingAngle;
	float pitchAngle;
	vec3f ambientLow;
	vec3f ambientHigh;
	vec3f fogColor;
	float fogLinear;
	float fogBlend;
	float cloudCover;
	float cloudCutoff;
	float cloudColor;
	float cloudOffset;
	float saturation;
	float gameTime;
	float sunAngleGamma;
	inline LightingSettings()  { }
	inline void ctor() { typedef void (*_fpt)(LightingSettings *pthis); _fpt _f=(_fpt)_drva(2104736); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(LightingSettings)==180),"bad size");
		static_assert((offsetof(LightingSettings,lightDirection)==0x0),"bad off");
		static_assert((offsetof(LightingSettings,lightColor)==0xC),"bad off");
		static_assert((offsetof(LightingSettings,horizonLow)==0x18),"bad off");
		static_assert((offsetof(LightingSettings,horizonHigh)==0x24),"bad off");
		static_assert((offsetof(LightingSettings,skyLow)==0x30),"bad off");
		static_assert((offsetof(LightingSettings,skyHigh)==0x3C),"bad off");
		static_assert((offsetof(LightingSettings,sunLow)==0x48),"bad off");
		static_assert((offsetof(LightingSettings,sunHigh)==0x54),"bad off");
		static_assert((offsetof(LightingSettings,angle)==0x60),"bad off");
		static_assert((offsetof(LightingSettings,headingAngle)==0x64),"bad off");
		static_assert((offsetof(LightingSettings,pitchAngle)==0x68),"bad off");
		static_assert((offsetof(LightingSettings,ambientLow)==0x6C),"bad off");
		static_assert((offsetof(LightingSettings,ambientHigh)==0x78),"bad off");
		static_assert((offsetof(LightingSettings,fogColor)==0x84),"bad off");
		static_assert((offsetof(LightingSettings,fogLinear)==0x90),"bad off");
		static_assert((offsetof(LightingSettings,fogBlend)==0x94),"bad off");
		static_assert((offsetof(LightingSettings,cloudCover)==0x98),"bad off");
		static_assert((offsetof(LightingSettings,cloudCutoff)==0x9C),"bad off");
		static_assert((offsetof(LightingSettings,cloudColor)==0xA0),"bad off");
		static_assert((offsetof(LightingSettings,cloudOffset)==0xA4),"bad off");
		static_assert((offsetof(LightingSettings,saturation)==0xA8),"bad off");
		static_assert((offsetof(LightingSettings,gameTime)==0xAC),"bad off");
		static_assert((offsetof(LightingSettings,sunAngleGamma)==0xB0),"bad off");
	};
};

//UDT: struct SplinePoint @len=20
	//_Func: public void SplinePoint(vec3f &  _arg0, float  _arg1, int  _arg2); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class vec3f, point
	//_Data: this+0xC, Member, Type: float, pointLength
	//_Data: this+0x10, Member, Type: int, tag
//UDT;

struct SplinePoint {
public:
	vec3f point;
	float pointLength;
	int tag;
	inline SplinePoint()  { }
	inline void _guard_obj() {
		static_assert((sizeof(SplinePoint)==20),"bad size");
		static_assert((offsetof(SplinePoint,point)==0x0),"bad off");
		static_assert((offsetof(SplinePoint,pointLength)==0xC),"bad off");
		static_assert((offsetof(SplinePoint,tag)==0x10),"bad off");
	};
};

//UDT: class IKeyEventListener @len=8 @vfcount=2
	//_VTable: 
	//_Func: public void onKeyDown(OnKeyEvent &  _arg0); @intro @pure @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
	//_Func: public void onKeyChar(unsigned int  _arg0); @intro @pure @virtual vtpo=0 vfid=1 @loc=optimized @len=0 @rva=0
	//_Func: public void IKeyEventListener(IKeyEventListener &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void IKeyEventListener(); @loc=optimized @len=0 @rva=0
	//_Func: public IKeyEventListener & operator=(IKeyEventListener &  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class IKeyEventListener {
public:
	inline IKeyEventListener()  { }
	virtual void onKeyDown_vf0(OnKeyEvent &  _arg0) = 0;
	inline void onKeyDown(OnKeyEvent &  _arg0) { return onKeyDown_vf0( _arg0); }
	virtual void onKeyChar_vf1(unsigned int  _arg0) = 0;
	inline void onKeyChar(unsigned int  _arg0) { return onKeyChar_vf1( _arg0); }
	inline void _guard_obj() {
		static_assert((sizeof(IKeyEventListener)==8),"bad size");
	};
};

//UDT: struct ksgui::GraphReferenceAxis @len=20
	//_Func: public void GraphReferenceAxis(vec3f & acolor, float arefValue, bool bisVertical); @loc=static @len=35 @rva=2987152
	//_Data: this+0x0, Member, Type: class vec3f, color
	//_Data: this+0xC, Member, Type: float, refValue
	//_Data: this+0x10, Member, Type: bool, isVertical
//UDT;

struct ksgui_GraphReferenceAxis {
public:
	vec3f color;
	float refValue;
	bool isVertical;
	inline ksgui_GraphReferenceAxis()  { }
	inline void ctor(vec3f & acolor, float arefValue, bool bisVertical) { typedef void (*_fpt)(ksgui_GraphReferenceAxis *pthis, vec3f &, float, bool); _fpt _f=(_fpt)_drva(2987152); _f(this, acolor, arefValue, bisVertical); }
	inline void _guard_obj() {
		static_assert((sizeof(ksgui_GraphReferenceAxis)==20),"bad size");
		static_assert((offsetof(ksgui_GraphReferenceAxis,color)==0x0),"bad off");
		static_assert((offsetof(ksgui_GraphReferenceAxis,refValue)==0xC),"bad off");
		static_assert((offsetof(ksgui_GraphReferenceAxis,isVertical)==0x10),"bad off");
	};
};

//UDT: struct Wind @len=20
	//_Data: this+0x0, Member, Type: class vec3f, vector
	//_Data: this+0xC, Member, Type: class Speed, speed
	//_Data: this+0x10, Member, Type: float, directionDeg
	//_Func: public void Wind(); @loc=optimized @len=0 @rva=0
	//_Func: public void ~Wind(); @loc=static @len=9 @rva=2502208
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct Wind {
public:
	vec3f vector;
	Speed speed;
	float directionDeg;
	inline Wind()  { }
	inline void dtor() { typedef void (*_fpt)(Wind *pthis); _fpt _f=(_fpt)_drva(2502208); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(Wind)==20),"bad size");
		static_assert((offsetof(Wind,vector)==0x0),"bad off");
		static_assert((offsetof(Wind,speed)==0xC),"bad off");
		static_assert((offsetof(Wind,directionDeg)==0x10),"bad off");
	};
};

//UDT: struct ACPhysicsEvent @len=72
	//_Data: this+0x0, Member, Type: enum eACEventType, type
	//_Data: this+0x4, Member, Type: float, param1
	//_Data: this+0x8, Member, Type: float, param2
	//_Data: this+0xC, Member, Type: float, param3
	//_Data: this+0x10, Member, Type: float, param4
	//_Data: this+0x14, Member, Type: class vec3f, vParam1
	//_Data: this+0x20, Member, Type: class vec3f, vParam2
	//_Data: this+0x30, Member, Type: void *, voidParam0
	//_Data: this+0x38, Member, Type: void *, voidParam1
	//_Data: this+0x40, Member, Type: unsigned long, ulParam0
	//_Func: public void ACPhysicsEvent(); @loc=optimized @len=0 @rva=0
//UDT;

struct ACPhysicsEvent {
public:
	eACEventType type;
	float param1;
	float param2;
	float param3;
	float param4;
	vec3f vParam1;
	vec3f vParam2;
	void * voidParam0;
	void * voidParam1;
	unsigned long ulParam0;
	inline ACPhysicsEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ACPhysicsEvent)==72),"bad size");
		static_assert((offsetof(ACPhysicsEvent,type)==0x0),"bad off");
		static_assert((offsetof(ACPhysicsEvent,param1)==0x4),"bad off");
		static_assert((offsetof(ACPhysicsEvent,param2)==0x8),"bad off");
		static_assert((offsetof(ACPhysicsEvent,param3)==0xC),"bad off");
		static_assert((offsetof(ACPhysicsEvent,param4)==0x10),"bad off");
		static_assert((offsetof(ACPhysicsEvent,vParam1)==0x14),"bad off");
		static_assert((offsetof(ACPhysicsEvent,vParam2)==0x20),"bad off");
		static_assert((offsetof(ACPhysicsEvent,voidParam0)==0x30),"bad off");
		static_assert((offsetof(ACPhysicsEvent,voidParam1)==0x38),"bad off");
		static_assert((offsetof(ACPhysicsEvent,ulParam0)==0x40),"bad off");
	};
};

//UDT: struct RayCastHit @len=40
	//_Func: public void RayCastHit(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class vec3f, pos
	//_Data: this+0xC, Member, Type: class vec3f, normal
	//_Data: this+0x18, Member, Type: class ICollisionObject *, collisionObject
	//_Data: this+0x20, Member, Type: bool, hasContact
//UDT;

struct RayCastHit {
public:
	vec3f pos;
	vec3f normal;
	ICollisionObject * collisionObject;
	bool hasContact;
	inline RayCastHit()  { }
	inline void _guard_obj() {
		static_assert((sizeof(RayCastHit)==40),"bad size");
		static_assert((offsetof(RayCastHit,pos)==0x0),"bad off");
		static_assert((offsetof(RayCastHit,normal)==0xC),"bad off");
		static_assert((offsetof(RayCastHit,collisionObject)==0x18),"bad off");
		static_assert((offsetof(RayCastHit,hasContact)==0x20),"bad off");
	};
};

//UDT: class ITyreModel @len=8 @vfcount=2
	//_VTable: 
	//_Func: public void ~ITyreModel(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=11 @rva=4503904
	//_Func: public TyreModelOutput solve(TyreModelInput &  _arg0); @intro @pure @virtual vtpo=0 vfid=1 @loc=optimized @len=0 @rva=0
	//_Func: public void ITyreModel(ITyreModel &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ITyreModel(); @loc=optimized @len=0 @rva=0
	//_Func: public ITyreModel & operator=(ITyreModel &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class ITyreModel {
public:
	inline ITyreModel()  { }
	virtual ~ITyreModel();
	inline void dtor() { typedef void (*_fpt)(ITyreModel *pthis); _fpt _f=(_fpt)_drva(4503904); _f(this); }
	virtual TyreModelOutput solve_vf1(TyreModelInput &  _arg0) = 0;
	inline TyreModelOutput solve(TyreModelInput &  _arg0) { return solve_vf1( _arg0); }
	inline void _guard_obj() {
		static_assert((sizeof(ITyreModel)==8),"bad size");
	};
};

//UDT: class BrushTyreModel @len=28
	//_Func: public void BrushTyreModel(); @loc=static @len=46 @rva=2929488
	//_Func: public void ~BrushTyreModel(); @loc=static @len=3 @rva=96368
	//_Data: this+0x0, Member, Type: struct BrushTyreModelData, data
	//_Func: public BrushOutput solve(float slip, float friction, float load, float cf1_mix, float asy); @loc=static @len=286 @rva=2929600
	//_Func: public BrushOutput solveV5(float slip, float load, float asy); @loc=static @len=236 @rva=2929888
	//_Func: public float getCFFromSlipAngle(float angle); @loc=static @len=56 @rva=2929536
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class BrushTyreModel {
public:
	BrushTyreModelData data;
	inline BrushTyreModel()  { }
	inline void ctor() { typedef void (*_fpt)(BrushTyreModel *pthis); _fpt _f=(_fpt)_drva(2929488); _f(this); }
	inline void dtor() { typedef void (*_fpt)(BrushTyreModel *pthis); _fpt _f=(_fpt)_drva(96368); _f(this); }
	inline BrushOutput solve(float slip, float friction, float load, float cf1_mix, float asy) { typedef BrushOutput (*_fpt)(BrushTyreModel *pthis, float, float, float, float, float); _fpt _f=(_fpt)_drva(2929600); return _f(this, slip, friction, load, cf1_mix, asy); }
	inline BrushOutput solveV5(float slip, float load, float asy) { typedef BrushOutput (*_fpt)(BrushTyreModel *pthis, float, float, float); _fpt _f=(_fpt)_drva(2929888); return _f(this, slip, load, asy); }
	inline float getCFFromSlipAngle(float angle) { typedef float (*_fpt)(BrushTyreModel *pthis, float); _fpt _f=(_fpt)_drva(2929536); return _f(this, angle); }
	inline void _guard_obj() {
		static_assert((sizeof(BrushTyreModel)==28),"bad size");
		static_assert((offsetof(BrushTyreModel,data)==0x0),"bad off");
	};
};

//UDT: struct DRS @len=48
	//_Func: public void ~DRS(); @loc=static @len=53 @rva=650384
	//_Data: this+0x0, Member, Type: bool, isPresent
	//_Data: this+0x1, Member, Type: bool, isActive
	//_Data: this+0x2, Member, Type: bool, isAvailable
	//_Data: this+0x3, Member, Type: bool, ignoreZones
	//_Data: this+0x8, Member, Type: class std::vector<DRSWingConnection,std::allocator<DRSWingConnection> >, wings
	//_Func: public void init(Car * car); @loc=static @len=2665 @rva=2835248
	//_Func: public void step(float dt); @loc=static @len=312 @rva=2838112
	//_Data: this+0x20, Member, Type: class Car *, car
	//_Data: this+0x28, Member, Type: bool, lastState
	//_Data: this+0x2C, Member, Type: float, limitG
	//_Func: public void DRS(DRS &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void DRS(); @loc=optimized @len=0 @rva=0
	//_Func: public DRS & operator=(DRS &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct DRS {
public:
	bool isPresent;
	bool isActive;
	bool isAvailable;
	bool ignoreZones;
	std::vector<DRSWingConnection,std::allocator<DRSWingConnection> > wings;
	Car * car;
	bool lastState;
	float limitG;
	inline DRS()  { }
	inline void dtor() { typedef void (*_fpt)(DRS *pthis); _fpt _f=(_fpt)_drva(650384); _f(this); }
	inline void init(Car * car) { typedef void (*_fpt)(DRS *pthis, Car *); _fpt _f=(_fpt)_drva(2835248); return _f(this, car); }
	inline void step(float dt) { typedef void (*_fpt)(DRS *pthis, float); _fpt _f=(_fpt)_drva(2838112); return _f(this, dt); }
	inline void _guard_obj() {
		static_assert((sizeof(DRS)==48),"bad size");
		static_assert((offsetof(DRS,isPresent)==0x0),"bad off");
		static_assert((offsetof(DRS,isActive)==0x1),"bad off");
		static_assert((offsetof(DRS,isAvailable)==0x2),"bad off");
		static_assert((offsetof(DRS,ignoreZones)==0x3),"bad off");
		static_assert((offsetof(DRS,wings)==0x8),"bad off");
		static_assert((offsetof(DRS,car)==0x20),"bad off");
		static_assert((offsetof(DRS,lastState)==0x28),"bad off");
		static_assert((offsetof(DRS,limitG)==0x2C),"bad off");
	};
};

//UDT: class IPAddress @len=16
	//_Func: public void IPAddress(); @loc=static @len=13 @rva=508768
	//_Func: public void IPAddress(IPAddress &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void IPAddress(sockaddr_in & addr); @loc=static @len=10 @rva=2479584
	//_Func: public void IPAddress(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & addr, unsigned short port); @loc=static @len=143 @rva=2479600
	//_Func: public void ~IPAddress(); @loc=static @len=3 @rva=96368
	//_Data: this+0x0, Member, Type: struct sockaddr_in, sokaddr
	//_Func: public unsigned short getPort(); @loc=optimized @len=0 @rva=0
	//_Func: public std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > getAddress(); @loc=optimized @len=0 @rva=0
	//_Func: public std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > getAddressPort(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class IPAddress {
public:
	sockaddr_in sokaddr;
	inline IPAddress()  { }
	inline void ctor() { typedef void (*_fpt)(IPAddress *pthis); _fpt _f=(_fpt)_drva(508768); _f(this); }
	inline void ctor(sockaddr_in & addr) { typedef void (*_fpt)(IPAddress *pthis, sockaddr_in &); _fpt _f=(_fpt)_drva(2479584); _f(this, addr); }
	inline void ctor(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & addr, unsigned short port) { typedef void (*_fpt)(IPAddress *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &, unsigned short); _fpt _f=(_fpt)_drva(2479600); _f(this, addr, port); }
	inline void dtor() { typedef void (*_fpt)(IPAddress *pthis); _fpt _f=(_fpt)_drva(96368); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(IPAddress)==16),"bad size");
		static_assert((offsetof(IPAddress,sokaddr)==0x0),"bad off");
	};
};

//UDT: struct RemoteSessionResume @len=176
	//_Data: this+0x0, Member, Type: struct RemoteSession, session
	//_Data: this+0x40, Member, Type: struct RemoteSessionResult, results
	//_Func: public void RemoteSessionResume(RemoteSessionResume &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void RemoteSessionResume(); @loc=static @len=103 @rva=243232
	//_Func: public void ~RemoteSessionResume(); @loc=optimized @len=0 @rva=0
	//_Func: public RemoteSessionResume & operator=(RemoteSessionResume &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct RemoteSessionResume {
public:
	RemoteSession session;
	RemoteSessionResult results;
	inline RemoteSessionResume()  { }
	inline void ctor() { typedef void (*_fpt)(RemoteSessionResume *pthis); _fpt _f=(_fpt)_drva(243232); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(RemoteSessionResume)==176),"bad size");
		static_assert((offsetof(RemoteSessionResume,session)==0x0),"bad off");
		static_assert((offsetof(RemoteSessionResume,results)==0x40),"bad off");
	};
};

//UDT: struct ClientCollisionEvent @len=40
	//_Data: this+0x0, Member, Type: class NetCarStateProvider *, netCar
	//_Data: this+0x8, Member, Type: float, speed
	//_Data: this+0xC, Member, Type: class vec3f, worldPos
	//_Data: this+0x18, Member, Type: class vec3f, relPos
	//_Func: public void ClientCollisionEvent(); @loc=optimized @len=0 @rva=0
//UDT;

struct ClientCollisionEvent {
public:
	NetCarStateProvider * netCar;
	float speed;
	vec3f worldPos;
	vec3f relPos;
	inline ClientCollisionEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(ClientCollisionEvent)==40),"bad size");
		static_assert((offsetof(ClientCollisionEvent,netCar)==0x0),"bad off");
		static_assert((offsetof(ClientCollisionEvent,speed)==0x8),"bad off");
		static_assert((offsetof(ClientCollisionEvent,worldPos)==0xC),"bad off");
		static_assert((offsetof(ClientCollisionEvent,relPos)==0x18),"bad off");
	};
};

//UDT: struct MeshVertex @len=44
	//_Func: public void MeshVertex(MeshVertex &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void MeshVertex(vec3f &  _arg0, vec3f &  _arg1, vec2f &  _arg2); @loc=optimized @len=0 @rva=0
	//_Func: public void MeshVertex(vec3f &  _arg0, vec3f &  _arg1); @loc=optimized @len=0 @rva=0
	//_Func: public void MeshVertex(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class vec3f, pos
	//_Data: this+0xC, Member, Type: class vec3f, normal
	//_Data: this+0x18, Member, Type: class vec2f, texCoord
	//_Data: this+0x20, Member, Type: class vec3f, tangent
//UDT;

struct MeshVertex {
public:
	vec3f pos;
	vec3f normal;
	vec2f texCoord;
	vec3f tangent;
	inline MeshVertex()  { }
	inline void _guard_obj() {
		static_assert((sizeof(MeshVertex)==44),"bad size");
		static_assert((offsetof(MeshVertex,pos)==0x0),"bad off");
		static_assert((offsetof(MeshVertex,normal)==0xC),"bad off");
		static_assert((offsetof(MeshVertex,texCoord)==0x18),"bad off");
		static_assert((offsetof(MeshVertex,tangent)==0x20),"bad off");
	};
};

//UDT: struct OnCollisionEvent @len=40
	//_Data: this+0x0, Member, Type: class IRigidBody *, body
	//_Data: this+0x8, Member, Type: float, relativeSpeed
	//_Data: this+0xC, Member, Type: class vec3f, worldPos
	//_Data: this+0x18, Member, Type: class vec3f, relPos
	//_Data: this+0x24, Member, Type: unsigned long, colliderGroup
	//_Func: public void OnCollisionEvent(); @loc=optimized @len=0 @rva=0
//UDT;

struct OnCollisionEvent {
public:
	IRigidBody * body;
	float relativeSpeed;
	vec3f worldPos;
	vec3f relPos;
	unsigned long colliderGroup;
	inline OnCollisionEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnCollisionEvent)==40),"bad size");
		static_assert((offsetof(OnCollisionEvent,body)==0x0),"bad off");
		static_assert((offsetof(OnCollisionEvent,relativeSpeed)==0x8),"bad off");
		static_assert((offsetof(OnCollisionEvent,worldPos)==0xC),"bad off");
		static_assert((offsetof(OnCollisionEvent,relPos)==0x18),"bad off");
		static_assert((offsetof(OnCollisionEvent,colliderGroup)==0x24),"bad off");
	};
};

//UDT: struct OnMouseUpEvent @len=12
	//_Base: struct MouseEvent @off=0 @len=12
	//_Func: public void OnMouseUpEvent(int  _arg0, int  _arg1, MouseButton  _arg2); @loc=optimized @len=0 @rva=0
//UDT;

struct OnMouseUpEvent : public MouseEvent {
public:
	inline OnMouseUpEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnMouseUpEvent)==12),"bad size");
	};
};

//UDT: struct OnMouseDownEvent @len=12
	//_Base: struct MouseEvent @off=0 @len=12
	//_Func: public void OnMouseDownEvent(int  _arg0, int  _arg1, MouseButton  _arg2); @loc=optimized @len=0 @rva=0
//UDT;

struct OnMouseDownEvent : public MouseEvent {
public:
	inline OnMouseDownEvent()  { }
	inline void _guard_obj() {
		static_assert((sizeof(OnMouseDownEvent)==12),"bad size");
	};
};

//UDT: class CommandManager @len=16
	//_Func: public void CommandManager(CommandManager &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void CommandManager(); @loc=static @len=8361 @rva=953200
	//_Func: public void ~CommandManager(); @loc=static @len=41 @rva=2105504
	//_Func: public int getCommand(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & commandName); @loc=static @len=16 @rva=962064
	//_Func: public bool isTriggered(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &  _arg0); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class std::map<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,CommandItem,std::less<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > >,std::allocator<std::pair<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > const ,CommandItem> > >, commands
	//_Func: public CommandManager & operator=(CommandManager &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class CommandManager {
public:
	std::map<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,CommandItem,std::less<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > >,std::allocator<std::pair<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > const ,CommandItem> > > commands;
	inline CommandManager()  { }
	inline void ctor() { typedef void (*_fpt)(CommandManager *pthis); _fpt _f=(_fpt)_drva(953200); _f(this); }
	inline void dtor() { typedef void (*_fpt)(CommandManager *pthis); _fpt _f=(_fpt)_drva(2105504); _f(this); }
	inline int getCommand(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & commandName) { typedef int (*_fpt)(CommandManager *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &); _fpt _f=(_fpt)_drva(962064); return _f(this, commandName); }
	inline void _guard_obj() {
		static_assert((sizeof(CommandManager)==16),"bad size");
		static_assert((offsetof(CommandManager,commands)==0x0),"bad off");
	};
};

//UDT: class Texture @len=40
	//_Func: public void Texture(Texture &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void Texture(RenderTarget & rt); @loc=static @len=51 @rva=2088512
	//_Func: public void Texture(unsigned char * buffer, unsigned int size); @loc=static @len=56 @rva=2088576
	//_Func: public void Texture(unsigned char * buffer, unsigned int width, unsigned int height, PixelFormat aFormat); @loc=static @len=79 @rva=2088640
	//_Func: public void Texture(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & filename); @loc=static @len=125 @rva=2088384
	//_Func: public void Texture(); @loc=static @len=25 @rva=205552
	//_Func: public void ~Texture(); @loc=static @len=49 @rva=2180672
	//_Data: this+0x0, Member, Type: void *, kid
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, fileName
	//_Func: public void reload(); @loc=optimized @len=0 @rva=0
	//_Func: public void save(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public PixelFormat getTexturePixelFormat(); @loc=optimized @len=0 @rva=0
	//_Func: public void release(); @loc=static @len=35 @rva=2088720
	//_Func: public bool isNull(); @loc=optimized @len=0 @rva=0
	//_Func: public bool isValid(); @loc=optimized @len=0 @rva=0
	//_Func: public void getSize(unsigned int &  _arg0, unsigned int &  _arg1); @loc=optimized @len=0 @rva=0
	//_Func: public unsigned int height(); @loc=optimized @len=0 @rva=0
	//_Func: public unsigned int width(); @loc=optimized @len=0 @rva=0
	//_Func: public Texture & operator=(Texture & __that); @loc=static @len=49 @rva=206640
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class Texture {
public:
	void * kid;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > fileName;
	inline Texture()  { }
	inline void ctor(RenderTarget & rt) { typedef void (*_fpt)(Texture *pthis, RenderTarget &); _fpt _f=(_fpt)_drva(2088512); _f(this, rt); }
	inline void ctor(unsigned char * buffer, unsigned int size) { typedef void (*_fpt)(Texture *pthis, unsigned char *, unsigned int); _fpt _f=(_fpt)_drva(2088576); _f(this, buffer, size); }
	inline void ctor(unsigned char * buffer, unsigned int width, unsigned int height, PixelFormat aFormat) { typedef void (*_fpt)(Texture *pthis, unsigned char *, unsigned int, unsigned int, PixelFormat); _fpt _f=(_fpt)_drva(2088640); _f(this, buffer, width, height, aFormat); }
	inline void ctor(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & filename) { typedef void (*_fpt)(Texture *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &); _fpt _f=(_fpt)_drva(2088384); _f(this, filename); }
	inline void ctor() { typedef void (*_fpt)(Texture *pthis); _fpt _f=(_fpt)_drva(205552); _f(this); }
	inline void dtor() { typedef void (*_fpt)(Texture *pthis); _fpt _f=(_fpt)_drva(2180672); _f(this); }
	inline void release() { typedef void (*_fpt)(Texture *pthis); _fpt _f=(_fpt)_drva(2088720); return _f(this); }
	inline Texture & operator=(Texture & __that) { typedef Texture & (*_fpt)(Texture *pthis, Texture &); _fpt _f=(_fpt)_drva(206640); return _f(this, __that); }
	inline void _guard_obj() {
		static_assert((sizeof(Texture)==40),"bad size");
		static_assert((offsetof(Texture,kid)==0x0),"bad off");
		static_assert((offsetof(Texture,fileName)==0x8),"bad off");
	};
};

//UDT: class ThreadPool @len=104 @vfcount=1
	//_VTable: 
	//_Func: public void ThreadPool(ThreadPool &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ThreadPool(int inumThreads, std::function<void __cdecl(int)> * initFun); @loc=static @len=740 @rva=2950304
	//_Func: public void ~ThreadPool(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=323 @rva=2951328
	//_Func: public void join(); @loc=optimized @len=0 @rva=0
	//_Func: public void addTask(Task & task); @loc=static @len=131 @rva=2953008
	//_Func: public unsigned int workersCount(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x8, Member, Type: int, numThreads
	//_Data: this+0x10, Member, Type: class std::vector<std::thread,std::allocator<std::thread> >, workers
	//_Data: this+0x28, Member, Type: bool, stop
	//_Data: this+0x30, Member, Type: class std::deque<Task *,std::allocator<Task *> >, tasks
	//_Data: this+0x58, Member, Type: class std::mutex, queue_mutex
	//_Data: this+0x60, Member, Type: class std::condition_variable, condition
	//_Func: public ThreadPool & operator=(ThreadPool &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class ThreadPool {
public:
	int numThreads;
	std::vector<std::thread,std::allocator<std::thread> > workers;
	bool stop;
	std::deque<Task *,std::allocator<Task *> > tasks;
	std::mutex queue_mutex;
	std::condition_variable condition;
	inline ThreadPool()  { }
	inline void ctor(int inumThreads, std::function<void __cdecl(int)> * initFun) { typedef void (*_fpt)(ThreadPool *pthis, int, std::function<void __cdecl(int)> *); _fpt _f=(_fpt)_drva(2950304); _f(this, inumThreads, initFun); }
	virtual ~ThreadPool();
	inline void dtor() { typedef void (*_fpt)(ThreadPool *pthis); _fpt _f=(_fpt)_drva(2951328); _f(this); }
	inline void addTask(Task & task) { typedef void (*_fpt)(ThreadPool *pthis, Task &); _fpt _f=(_fpt)_drva(2953008); return _f(this, task); }
	inline void _guard_obj() {
		static_assert((sizeof(ThreadPool)==104),"bad size");
		static_assert((offsetof(ThreadPool,numThreads)==0x8),"bad off");
		static_assert((offsetof(ThreadPool,workers)==0x10),"bad off");
		static_assert((offsetof(ThreadPool,stop)==0x28),"bad off");
		static_assert((offsetof(ThreadPool,tasks)==0x30),"bad off");
		static_assert((offsetof(ThreadPool,queue_mutex)==0x58),"bad off");
		static_assert((offsetof(ThreadPool,condition)==0x60),"bad off");
	};
};

//UDT: struct PerformanceMeter @len=112
	//_Func: public void ~PerformanceMeter(); @loc=static @len=110 @rva=2536400
	//_Data: this+0x0, Member, Type: bool, isEnabled
	//_Func: public void init(Car * car); @loc=static @len=35 @rva=2537408
	//_Func: public void step(float dt); @loc=static @len=497 @rva=2537696
	//_Func: public PerformanceSplit getCurrentSplit(); @loc=static @len=157 @rva=2537216
	//_Func: public bool hasData(); @loc=static @len=19 @rva=2537376
	//_Func: public void reset(); @loc=static @len=87 @rva=2537600
	//_Data: this+0x8, Member, Type: class Car *, car
	//_Data: this+0x10, Member, Type: class std::vector<PerformancePair,std::allocator<PerformancePair> >, currentLap
	//_Data: this+0x28, Member, Type: class std::vector<PerformancePair,std::allocator<PerformancePair> >, bestLap
	//_Data: this+0x40, Member, Type: double, bestLapTime
	//_Data: this+0x48, Member, Type: int, lastLapIndex
	//_Data: this+0x50, Member, Type: double, currentDistance
	//_Data: this+0x58, Member, Type: double, lastRecordedDistance
	//_Data: this+0x60, Member, Type: double, currentDiff
	//_Data: this+0x68, Member, Type: float, currentSpeedDiffMS
	//_Func: public void PerformanceMeter(PerformanceMeter &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void PerformanceMeter(); @loc=optimized @len=0 @rva=0
	//_Func: public PerformanceMeter & operator=(PerformanceMeter &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct PerformanceMeter {
public:
	bool isEnabled;
	Car * car;
	std::vector<PerformancePair,std::allocator<PerformancePair> > currentLap;
	std::vector<PerformancePair,std::allocator<PerformancePair> > bestLap;
	double bestLapTime;
	int lastLapIndex;
	double currentDistance;
	double lastRecordedDistance;
	double currentDiff;
	float currentSpeedDiffMS;
	inline PerformanceMeter()  { }
	inline void dtor() { typedef void (*_fpt)(PerformanceMeter *pthis); _fpt _f=(_fpt)_drva(2536400); _f(this); }
	inline void init(Car * car) { typedef void (*_fpt)(PerformanceMeter *pthis, Car *); _fpt _f=(_fpt)_drva(2537408); return _f(this, car); }
	inline void step(float dt) { typedef void (*_fpt)(PerformanceMeter *pthis, float); _fpt _f=(_fpt)_drva(2537696); return _f(this, dt); }
	inline PerformanceSplit getCurrentSplit() { typedef PerformanceSplit (*_fpt)(PerformanceMeter *pthis); _fpt _f=(_fpt)_drva(2537216); return _f(this); }
	inline bool hasData() { typedef bool (*_fpt)(PerformanceMeter *pthis); _fpt _f=(_fpt)_drva(2537376); return _f(this); }
	inline void reset() { typedef void (*_fpt)(PerformanceMeter *pthis); _fpt _f=(_fpt)_drva(2537600); return _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(PerformanceMeter)==112),"bad size");
		static_assert((offsetof(PerformanceMeter,isEnabled)==0x0),"bad off");
		static_assert((offsetof(PerformanceMeter,car)==0x8),"bad off");
		static_assert((offsetof(PerformanceMeter,currentLap)==0x10),"bad off");
		static_assert((offsetof(PerformanceMeter,bestLap)==0x28),"bad off");
		static_assert((offsetof(PerformanceMeter,bestLapTime)==0x40),"bad off");
		static_assert((offsetof(PerformanceMeter,lastLapIndex)==0x48),"bad off");
		static_assert((offsetof(PerformanceMeter,currentDistance)==0x50),"bad off");
		static_assert((offsetof(PerformanceMeter,lastRecordedDistance)==0x58),"bad off");
		static_assert((offsetof(PerformanceMeter,currentDiff)==0x60),"bad off");
		static_assert((offsetof(PerformanceMeter,currentSpeedDiffMS)==0x68),"bad off");
	};
};

//UDT: class TelemetryChannel @len=88
	//_Func: public void TelemetryChannel(TelemetryChannel & __that); @loc=static @len=148 @rva=2866288
	//_Func: public void TelemetryChannel(std::basic_string<char,std::char_traits<char>,std::allocator<char> > & name, float * adataSource, TelemetryUnits units, int frequency, float scale); @loc=static @len=156 @rva=2866448
	//_Data: this+0x0, Member, Type: class std::basic_string<char,std::char_traits<char>,std::allocator<char> >, name
	//_Data: this+0x20, Member, Type: struct TelemetryChannelData, data
	//_Data: this+0x40, Member, Type: float *, dataSource
	//_Data: this+0x48, Member, Type: double, lastTickTime
	//_Data: this+0x50, Member, Type: float, scale
	//_Func: public void ~TelemetryChannel(); @loc=static @len=103 @rva=2549872
	//_Func: public TelemetryChannel & operator=(TelemetryChannel &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

class TelemetryChannel {
public:
	std::basic_string<char,std::char_traits<char>,std::allocator<char> > name;
	TelemetryChannelData data;
	float * dataSource;
	double lastTickTime;
	float scale;
	inline TelemetryChannel()  { }
	inline void ctor(TelemetryChannel & __that) { typedef void (*_fpt)(TelemetryChannel *pthis, TelemetryChannel &); _fpt _f=(_fpt)_drva(2866288); _f(this, __that); }
	inline void ctor(std::basic_string<char,std::char_traits<char>,std::allocator<char> > & name, float * adataSource, TelemetryUnits units, int frequency, float scale) { typedef void (*_fpt)(TelemetryChannel *pthis, std::basic_string<char,std::char_traits<char>,std::allocator<char> > &, float *, TelemetryUnits, int, float); _fpt _f=(_fpt)_drva(2866448); _f(this, name, adataSource, units, frequency, scale); }
	inline void dtor() { typedef void (*_fpt)(TelemetryChannel *pthis); _fpt _f=(_fpt)_drva(2549872); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(TelemetryChannel)==88),"bad size");
		static_assert((offsetof(TelemetryChannel,name)==0x0),"bad off");
		static_assert((offsetof(TelemetryChannel,data)==0x20),"bad off");
		static_assert((offsetof(TelemetryChannel,dataSource)==0x40),"bad off");
		static_assert((offsetof(TelemetryChannel,lastTickTime)==0x48),"bad off");
		static_assert((offsetof(TelemetryChannel,scale)==0x50),"bad off");
	};
};

//UDT: class Curve @len=128 @vfcount=1
	//_VTable: 
	//_Func: public void Curve(Curve & __that); @loc=static @len=158 @rva=844960
	//_Func: public void Curve(); @loc=static @len=85 @rva=2119856
	//_Func: public void ~Curve(); @intro @virtual vtpo=0 vfid=0 @loc=static @len=216 @rva=2119952
	//_Data: static, [0155A278][0003:00047278], Static Member, Type: class std::vector<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >,std::allocator<std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > > >, openedFiles
	//_Func: public void load(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & ifilename); @loc=static @len=1276 @rva=2124368
	//_Func: public void loadEncrypted(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & ifilename, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & dataFile); @loc=static @len=1013 @rva=2125648
	//_Func: public void save(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void scale(float v); @loc=static @len=39 @rva=2126816
	//_Func: public void scaleReferences(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public float getValue(float ref); @loc=static @len=186 @rva=2124176
	//_Func: public float getValueUncapped(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public float getValueCatmullRom(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public float getCubicSplineValue(float ref); @loc=static @len=61 @rva=2124016
	//_Func: public void addValue(float ref, float val); @loc=static @len=312 @rva=2120416
	//_Func: public void resample(float  _arg0, float  _arg1, float  _arg2); @loc=optimized @len=0 @rva=0
	//_Func: public void getMaxValue(float &  _arg0, float &  _arg1); @loc=optimized @len=0 @rva=0
	//_Func: public float getMaxReference(); @loc=static @len=10 @rva=2124080
	//_Func: public int getCount(); @loc=static @len=13 @rva=2124000
	//_Func: public float getValueFast(float  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public std::pair<float,float> getPairAtIndex(int index); @loc=static @len=79 @rva=2124096
	//_Func: public void clear(); @loc=optimized @len=0 @rva=0
	//_Func: public void print(); @loc=static @len=137 @rva=2126672
	//_Data: this+0x8, Member, Type: class std::vector<float,std::allocator<float> >, references
	//_Data: this+0x20, Member, Type: class std::vector<float,std::allocator<float> >, values
	//_Data: this+0x38, Member, Type: float, fastStep
	//_Data: this+0x3C, Member, Type: bool, cubicSplineReady
	//_Data: this+0x40, Member, Type: class CubicSpline<float,float>, cSpline
	//_Data: this+0x60, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, filename
	//_Func: public Curve & operator=(Curve & __that); @loc=static @len=107 @rva=355408
	//_Func: public void __local_vftable_ctor_closure(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=0 @loc=optimized @len=0 @rva=0
//UDT;

class Curve {
public:
	std::vector<float,std::allocator<float> > references;
	std::vector<float,std::allocator<float> > values;
	float fastStep;
	bool cubicSplineReady;
	CubicSpline<float,float> cSpline;
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > filename;
	inline Curve()  { }
	inline void ctor(Curve & __that) { typedef void (*_fpt)(Curve *pthis, Curve &); _fpt _f=(_fpt)_drva(844960); _f(this, __that); }
	inline void ctor() { typedef void (*_fpt)(Curve *pthis); _fpt _f=(_fpt)_drva(2119856); _f(this); }
	virtual ~Curve();
	inline void dtor() { typedef void (*_fpt)(Curve *pthis); _fpt _f=(_fpt)_drva(2119952); _f(this); }
	inline void load(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & ifilename) { typedef void (*_fpt)(Curve *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &); _fpt _f=(_fpt)_drva(2124368); return _f(this, ifilename); }
	inline void loadEncrypted(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & ifilename, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & dataFile) { typedef void (*_fpt)(Curve *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &); _fpt _f=(_fpt)_drva(2125648); return _f(this, ifilename, dataFile); }
	inline void scale(float v) { typedef void (*_fpt)(Curve *pthis, float); _fpt _f=(_fpt)_drva(2126816); return _f(this, v); }
	inline float getValue(float ref) { typedef float (*_fpt)(Curve *pthis, float); _fpt _f=(_fpt)_drva(2124176); return _f(this, ref); }
	inline float getCubicSplineValue(float ref) { typedef float (*_fpt)(Curve *pthis, float); _fpt _f=(_fpt)_drva(2124016); return _f(this, ref); }
	inline void addValue(float ref, float val) { typedef void (*_fpt)(Curve *pthis, float, float); _fpt _f=(_fpt)_drva(2120416); return _f(this, ref, val); }
	inline float getMaxReference() { typedef float (*_fpt)(Curve *pthis); _fpt _f=(_fpt)_drva(2124080); return _f(this); }
	inline int getCount() { typedef int (*_fpt)(Curve *pthis); _fpt _f=(_fpt)_drva(2124000); return _f(this); }
	inline std::pair<float,float> getPairAtIndex(int index) { typedef std::pair<float,float> (*_fpt)(Curve *pthis, int); _fpt _f=(_fpt)_drva(2124096); return _f(this, index); }
	inline void print() { typedef void (*_fpt)(Curve *pthis); _fpt _f=(_fpt)_drva(2126672); return _f(this); }
	inline Curve & operator=(Curve & __that) { typedef Curve & (*_fpt)(Curve *pthis, Curve &); _fpt _f=(_fpt)_drva(355408); return _f(this, __that); }
	inline void _guard_obj() {
		static_assert((sizeof(Curve)==128),"bad size");
		static_assert((offsetof(Curve,references)==0x8),"bad off");
		static_assert((offsetof(Curve,values)==0x20),"bad off");
		static_assert((offsetof(Curve,fastStep)==0x38),"bad off");
		static_assert((offsetof(Curve,cubicSplineReady)==0x3C),"bad off");
		static_assert((offsetof(Curve,cSpline)==0x40),"bad off");
		static_assert((offsetof(Curve,filename)==0x60),"bad off");
	};
};

//UDT: struct HeaveSpring @len=88
	//_Func: public void ~HeaveSpring(); @loc=static @len=9 @rva=2831104
	//_Data: this+0x0, Member, Type: bool, isPresent
	//_Data: this+0x4, Member, Type: float, rodLength
	//_Data: this+0x8, Member, Type: struct HeaveSpringStatus, status
	//_Data: this+0xC, Member, Type: float, k
	//_Data: this+0x10, Member, Type: float, progressiveK
	//_Data: this+0x14, Member, Type: float, packerRange
	//_Data: this+0x18, Member, Type: float, bumpStopRate
	//_Data: this+0x1C, Member, Type: float, bumpStopUp
	//_Data: this+0x20, Member, Type: float, bumpStopDn
	//_Data: this+0x24, Member, Type: class Damper, damper
	//_Data: this+0x3C, Member, Type: bool, isFront
	//_Func: public void init(Car * car, Suspension * s0, Suspension * s1, bool isFront); @loc=static @len=34 @rva=2831120
	//_Func: public void step(float dt); @loc=static @len=2039 @rva=2832736
	//_Data: this+0x40, Member, Type: class Suspension *[0x2], suspensions
	//_Data: this+0x50, Member, Type: class Car *, car
	//_Func: private void initData(); @loc=static @len=1565 @rva=2831168
	//_Func: public void HeaveSpring(); @loc=static @len=52 @rva=2546416
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct HeaveSpring {
public:
	bool isPresent;
	float rodLength;
	HeaveSpringStatus status;
	float k;
	float progressiveK;
	float packerRange;
	float bumpStopRate;
	float bumpStopUp;
	float bumpStopDn;
	Damper damper;
	bool isFront;
	Suspension * suspensions[0x2];
	Car * car;
	inline HeaveSpring()  { }
	inline void dtor() { typedef void (*_fpt)(HeaveSpring *pthis); _fpt _f=(_fpt)_drva(2831104); _f(this); }
	inline void init(Car * car, Suspension * s0, Suspension * s1, bool isFront) { typedef void (*_fpt)(HeaveSpring *pthis, Car *, Suspension *, Suspension *, bool); _fpt _f=(_fpt)_drva(2831120); return _f(this, car, s0, s1, isFront); }
	inline void step(float dt) { typedef void (*_fpt)(HeaveSpring *pthis, float); _fpt _f=(_fpt)_drva(2832736); return _f(this, dt); }
	inline void initData() { typedef void (*_fpt)(HeaveSpring *pthis); _fpt _f=(_fpt)_drva(2831168); return _f(this); }
	inline void ctor() { typedef void (*_fpt)(HeaveSpring *pthis); _fpt _f=(_fpt)_drva(2546416); _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(HeaveSpring)==88),"bad size");
		static_assert((offsetof(HeaveSpring,isPresent)==0x0),"bad off");
		static_assert((offsetof(HeaveSpring,rodLength)==0x4),"bad off");
		static_assert((offsetof(HeaveSpring,status)==0x8),"bad off");
		static_assert((offsetof(HeaveSpring,k)==0xC),"bad off");
		static_assert((offsetof(HeaveSpring,progressiveK)==0x10),"bad off");
		static_assert((offsetof(HeaveSpring,packerRange)==0x14),"bad off");
		static_assert((offsetof(HeaveSpring,bumpStopRate)==0x18),"bad off");
		static_assert((offsetof(HeaveSpring,bumpStopUp)==0x1C),"bad off");
		static_assert((offsetof(HeaveSpring,bumpStopDn)==0x20),"bad off");
		static_assert((offsetof(HeaveSpring,damper)==0x24),"bad off");
		static_assert((offsetof(HeaveSpring,isFront)==0x3C),"bad off");
		static_assert((offsetof(HeaveSpring,suspensions)==0x40),"bad off");
		static_assert((offsetof(HeaveSpring,car)==0x50),"bad off");
	};
};

//UDT: struct TimeTransponder @len=152
	//_Func: public void ~TimeTransponder(); @loc=static @len=184 @rva=2688112
	//_Data: this+0x0, Member, Type: unsigned int, t
	//_Data: this+0x4, Member, Type: unsigned int, lastLap
	//_Data: this+0x8, Member, Type: unsigned int, bestLap
	//_Data: this+0xC, Member, Type: unsigned int, lapCount
	//_Data: this+0x10, Member, Type: bool, finishLinePassed
	//_Data: this+0x11, Member, Type: bool, wasLastLapValid
	//_Func: public void init(Car * car); @loc=static @len=298 @rva=2688960
	//_Func: public bool isValid(); @loc=static @len=195 @rva=2689408
	//_Func: public void onTimeLinePassed(int index, bool isFinishLine); @loc=static @len=569 @rva=2690080
	//_Func: public TimeLineStatus & getStatus(int index); @loc=static @len=217 @rva=2688736
	//_Func: public std::vector<unsigned int,std::allocator<unsigned int> > getLastLapSplits(); @loc=static @len=38 @rva=2688688
	//_Func: public unsigned int getCurrentSplit(int  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void invalidate(); @loc=static @len=112 @rva=2689264
	//_Func: public void reset(); @loc=static @len=219 @rva=2690656
	//_Func: public void step(float dt); @loc=static @len=476 @rva=2691568
	//_Func: public void armFirstLap(); @loc=static @len=8 @rva=2688656
	//_Func: public void addCut(); @loc=static @len=7 @rva=2688640
	//_Func: public int getCuts(); @loc=static @len=7 @rva=2688672
	//_Func: public bool isInOpenTrackTransition(); @loc=static @len=24 @rva=2689376
	//_Data: this+0x18, Member, Type: class std::vector<TimeLineStatus,std::allocator<TimeLineStatus> >, status
	//_Data: this+0x30, Member, Type: class std::vector<unsigned int,std::allocator<unsigned int> >, lastLapSplits
	//_Data: this+0x48, Member, Type: class std::vector<unsigned int,std::allocator<unsigned int> >, bestLapSplits
	//_Data: this+0x60, Member, Type: class std::vector<unsigned int,std::allocator<unsigned int> >, currentSplits
	//_Data: this+0x78, Member, Type: class Car *, car
	//_Data: this+0x80, Member, Type: bool, isFirstLapArmed
	//_Data: this+0x84, Member, Type: int, cuts
	//_Data: this+0x88, Member, Type: bool, extInvalid
	//_Data: this+0x8C, Member, Type: enum OpenTrackTimeState, openTrackState
	//_Data: this+0x90, Member, Type: bool, isOpenTrack
	//_Func: protected void lap(bool valid); @loc=static @len=462 @rva=2689616
	//_Func: protected void split(int sectorIndex); @loc=static @len=155 @rva=2691408
	//_Func: public void TimeTransponder(TimeTransponder &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void TimeTransponder(); @loc=optimized @len=0 @rva=0
	//_Func: public TimeTransponder & operator=(TimeTransponder &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct TimeTransponder {
public:
	unsigned int t;
	unsigned int lastLap;
	unsigned int bestLap;
	unsigned int lapCount;
	bool finishLinePassed;
	bool wasLastLapValid;
	std::vector<TimeLineStatus,std::allocator<TimeLineStatus> > status;
	std::vector<unsigned int,std::allocator<unsigned int> > lastLapSplits;
	std::vector<unsigned int,std::allocator<unsigned int> > bestLapSplits;
	std::vector<unsigned int,std::allocator<unsigned int> > currentSplits;
	Car * car;
	bool isFirstLapArmed;
	int cuts;
	bool extInvalid;
	OpenTrackTimeState openTrackState;
	bool isOpenTrack;
	inline TimeTransponder()  { }
	inline void dtor() { typedef void (*_fpt)(TimeTransponder *pthis); _fpt _f=(_fpt)_drva(2688112); _f(this); }
	inline void init(Car * car) { typedef void (*_fpt)(TimeTransponder *pthis, Car *); _fpt _f=(_fpt)_drva(2688960); return _f(this, car); }
	inline bool isValid() { typedef bool (*_fpt)(TimeTransponder *pthis); _fpt _f=(_fpt)_drva(2689408); return _f(this); }
	inline void onTimeLinePassed(int index, bool isFinishLine) { typedef void (*_fpt)(TimeTransponder *pthis, int, bool); _fpt _f=(_fpt)_drva(2690080); return _f(this, index, isFinishLine); }
	inline TimeLineStatus & getStatus(int index) { typedef TimeLineStatus & (*_fpt)(TimeTransponder *pthis, int); _fpt _f=(_fpt)_drva(2688736); return _f(this, index); }
	inline std::vector<unsigned int,std::allocator<unsigned int> > getLastLapSplits() { typedef std::vector<unsigned int,std::allocator<unsigned int> > (*_fpt)(TimeTransponder *pthis); _fpt _f=(_fpt)_drva(2688688); return _f(this); }
	inline void invalidate() { typedef void (*_fpt)(TimeTransponder *pthis); _fpt _f=(_fpt)_drva(2689264); return _f(this); }
	inline void reset() { typedef void (*_fpt)(TimeTransponder *pthis); _fpt _f=(_fpt)_drva(2690656); return _f(this); }
	inline void step(float dt) { typedef void (*_fpt)(TimeTransponder *pthis, float); _fpt _f=(_fpt)_drva(2691568); return _f(this, dt); }
	inline void armFirstLap() { typedef void (*_fpt)(TimeTransponder *pthis); _fpt _f=(_fpt)_drva(2688656); return _f(this); }
	inline void addCut() { typedef void (*_fpt)(TimeTransponder *pthis); _fpt _f=(_fpt)_drva(2688640); return _f(this); }
	inline int getCuts() { typedef int (*_fpt)(TimeTransponder *pthis); _fpt _f=(_fpt)_drva(2688672); return _f(this); }
	inline bool isInOpenTrackTransition() { typedef bool (*_fpt)(TimeTransponder *pthis); _fpt _f=(_fpt)_drva(2689376); return _f(this); }
	inline void lap(bool valid) { typedef void (*_fpt)(TimeTransponder *pthis, bool); _fpt _f=(_fpt)_drva(2689616); return _f(this, valid); }
	inline void split(int sectorIndex) { typedef void (*_fpt)(TimeTransponder *pthis, int); _fpt _f=(_fpt)_drva(2691408); return _f(this, sectorIndex); }
	inline void _guard_obj() {
		static_assert((sizeof(TimeTransponder)==152),"bad size");
		static_assert((offsetof(TimeTransponder,t)==0x0),"bad off");
		static_assert((offsetof(TimeTransponder,lastLap)==0x4),"bad off");
		static_assert((offsetof(TimeTransponder,bestLap)==0x8),"bad off");
		static_assert((offsetof(TimeTransponder,lapCount)==0xC),"bad off");
		static_assert((offsetof(TimeTransponder,finishLinePassed)==0x10),"bad off");
		static_assert((offsetof(TimeTransponder,wasLastLapValid)==0x11),"bad off");
		static_assert((offsetof(TimeTransponder,status)==0x18),"bad off");
		static_assert((offsetof(TimeTransponder,lastLapSplits)==0x30),"bad off");
		static_assert((offsetof(TimeTransponder,bestLapSplits)==0x48),"bad off");
		static_assert((offsetof(TimeTransponder,currentSplits)==0x60),"bad off");
		static_assert((offsetof(TimeTransponder,car)==0x78),"bad off");
		static_assert((offsetof(TimeTransponder,isFirstLapArmed)==0x80),"bad off");
		static_assert((offsetof(TimeTransponder,cuts)==0x84),"bad off");
		static_assert((offsetof(TimeTransponder,extInvalid)==0x88),"bad off");
		static_assert((offsetof(TimeTransponder,openTrackState)==0x8C),"bad off");
		static_assert((offsetof(TimeTransponder,isOpenTrack)==0x90),"bad off");
	};
};

//UDT: struct SplineLocator @len=48
	//_Func: public void ~SplineLocator(); @loc=static @len=3 @rva=96368
	//_Data: this+0x0, Member, Type: class AISpline *, currentSpline
	//_Func: public void init(Car * car); @loc=static @len=73 @rva=2798240
	//_Func: public void step(float dt); @loc=static @len=370 @rva=2799040
	//_Func: public float getNormalizedPosition(); @loc=optimized @len=0 @rva=0
	//_Func: public int getCurrentIndex(); @loc=optimized @len=0 @rva=0
	//_Func: public float locateOnSpline(AISpline * spline, vec3f & pos, int & index); @pure @loc=static @len=258 @rva=2798320
	//_Func: public float locateOnSplineWithBounds(AISpline * spline, vec3f & pos, std::vector<SplineIndexBound,std::allocator<SplineIndexBound> > & bounds, int & index); @pure @loc=static @len=273 @rva=2798592
	//_Func: public void getSides(float * sides, float nsplinepos); @loc=static @len=355 @rva=2797872
	//_Func: public float getOffset(); @loc=optimized @len=0 @rva=0
	//_Func: public float getRoadLateralPosition(); @loc=optimized @len=0 @rva=0
	//_Func: public void reset(); @loc=static @len=15 @rva=2798880
	//_Func: public void resetToClosestPoint(); @loc=static @len=143 @rva=2798896
	//_Func: public bool isOutside(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x8, Member, Type: class Car *, car
	//_Data: this+0x10, Member, Type: int, currentIndex
	//_Data: this+0x18, Member, Type: class Track *, track
	//_Data: this+0x20, Member, Type: float, normalizedPos
	//_Data: this+0x24, Member, Type: float, offset
	//_Data: this+0x28, Member, Type: bool, isOutsideLimits
	//_Func: public void SplineLocator(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct SplineLocator {
public:
	AISpline * currentSpline;
	Car * car;
	int currentIndex;
	Track * track;
	float normalizedPos;
	float offset;
	bool isOutsideLimits;
	inline SplineLocator()  { }
	inline void dtor() { typedef void (*_fpt)(SplineLocator *pthis); _fpt _f=(_fpt)_drva(96368); _f(this); }
	inline void init(Car * car) { typedef void (*_fpt)(SplineLocator *pthis, Car *); _fpt _f=(_fpt)_drva(2798240); return _f(this, car); }
	inline void step(float dt) { typedef void (*_fpt)(SplineLocator *pthis, float); _fpt _f=(_fpt)_drva(2799040); return _f(this, dt); }
	inline void getSides(float * sides, float nsplinepos) { typedef void (*_fpt)(SplineLocator *pthis, float *, float); _fpt _f=(_fpt)_drva(2797872); return _f(this, sides, nsplinepos); }
	inline void reset() { typedef void (*_fpt)(SplineLocator *pthis); _fpt _f=(_fpt)_drva(2798880); return _f(this); }
	inline void resetToClosestPoint() { typedef void (*_fpt)(SplineLocator *pthis); _fpt _f=(_fpt)_drva(2798896); return _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(SplineLocator)==48),"bad size");
		static_assert((offsetof(SplineLocator,currentSpline)==0x0),"bad off");
		static_assert((offsetof(SplineLocator,car)==0x8),"bad off");
		static_assert((offsetof(SplineLocator,currentIndex)==0x10),"bad off");
		static_assert((offsetof(SplineLocator,track)==0x18),"bad off");
		static_assert((offsetof(SplineLocator,normalizedPos)==0x20),"bad off");
		static_assert((offsetof(SplineLocator,offset)==0x24),"bad off");
		static_assert((offsetof(SplineLocator,isOutsideLimits)==0x28),"bad off");
	};
};

//UDT: struct SetupManager @len=80
	//_Func: public void ~SetupManager(); @loc=static @len=71 @rva=2657648
	//_Data: this+0x0, Member, Type: class std::vector<SetupItem,std::allocator<SetupItem> >, items
	//_Func: public void init(Car * acar); @loc=static @len=723 @rva=2658960
	//_Func: public void step(float dt); @loc=static @len=108 @rva=2674832
	//_Func: public SetupItem * getSetupItem(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & name); @loc=static @len=215 @rva=2658736
	//_Func: public bool isItemAttached(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public CarSetupState getSetupState(); @loc=optimized @len=0 @rva=0
	//_Func: public float getMinHeightM(); @loc=optimized @len=0 @rva=0
	//_Func: public void forceCheckRules(); @loc=optimized @len=0 @rva=0
	//_Func: public void load(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & filename); @loc=static @len=806 @rva=2673808
	//_Data: this+0x18, Member, Type: bool, checkRules
	//_Data: this+0x20, Member, Type: class Car *, car
	//_Data: this+0x28, Member, Type: class std::vector<float,std::allocator<float> >, gearSettings
	//_Data: this+0x40, Member, Type: float, minimumHeight_m
	//_Data: this+0x44, Member, Type: const float, maxWaitTime
	//_Data: this+0x48, Member, Type: float, waitTime
	//_Data: this+0x4C, Member, Type: enum CarSetupState, setupState
	//_Func: protected void initItems(bool attached); @loc=static @len=13969 @rva=2659696
	//_Func: protected void writeTemplateForLocalization(); @loc=optimized @len=0 @rva=0
	//_Func: protected bool isSetupRespectingRules(); @loc=static @len=128 @rva=2673680
	//_Func: public void SetupManager(SetupManager &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void SetupManager(); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct SetupManager {
public:
	std::vector<SetupItem,std::allocator<SetupItem> > items;
	bool checkRules;
	Car * car;
	std::vector<float,std::allocator<float> > gearSettings;
	float minimumHeight_m;
	float maxWaitTime;
	float waitTime;
	CarSetupState setupState;
	inline SetupManager()  { }
	inline void dtor() { typedef void (*_fpt)(SetupManager *pthis); _fpt _f=(_fpt)_drva(2657648); _f(this); }
	inline void init(Car * acar) { typedef void (*_fpt)(SetupManager *pthis, Car *); _fpt _f=(_fpt)_drva(2658960); return _f(this, acar); }
	inline void step(float dt) { typedef void (*_fpt)(SetupManager *pthis, float); _fpt _f=(_fpt)_drva(2674832); return _f(this, dt); }
	inline SetupItem * getSetupItem(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & name) { typedef SetupItem * (*_fpt)(SetupManager *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &); _fpt _f=(_fpt)_drva(2658736); return _f(this, name); }
	inline void load(std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > & filename) { typedef void (*_fpt)(SetupManager *pthis, std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > &); _fpt _f=(_fpt)_drva(2673808); return _f(this, filename); }
	inline void initItems(bool attached) { typedef void (*_fpt)(SetupManager *pthis, bool); _fpt _f=(_fpt)_drva(2659696); return _f(this, attached); }
	inline bool isSetupRespectingRules() { typedef bool (*_fpt)(SetupManager *pthis); _fpt _f=(_fpt)_drva(2673680); return _f(this); }
	inline void _guard_obj() {
		static_assert((sizeof(SetupManager)==80),"bad size");
		static_assert((offsetof(SetupManager,items)==0x0),"bad off");
		static_assert((offsetof(SetupManager,checkRules)==0x18),"bad off");
		static_assert((offsetof(SetupManager,car)==0x20),"bad off");
		static_assert((offsetof(SetupManager,gearSettings)==0x28),"bad off");
		static_assert((offsetof(SetupManager,minimumHeight_m)==0x40),"bad off");
		static_assert((offsetof(SetupManager,maxWaitTime)==0x44),"bad off");
		static_assert((offsetof(SetupManager,waitTime)==0x48),"bad off");
		static_assert((offsetof(SetupManager,setupState)==0x4C),"bad off");
	};
};

//UDT: class ACPlugin @len=120 @vfcount=10
	//_Base: class IACPPluginHost @off=0 @len=8
	//_Func: public void ACPlugin(ACPlugin &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ACPlugin(Sim * aSim, HINSTANCE__ * module); @loc=static @len=683 @rva=784032
	//_Func: public void ~ACPlugin(); @intro @virtual vtpo=0 vfid=9 @loc=static @len=134 @rva=784720
	//_Data: this+0x8, Member, Type: class std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> >, name
	//_Func: public void update(ACCarState * state, float dt); @loc=static @len=19 @rva=785920
	//_Func: public void onGui(ACPluginContext * cc); @loc=static @len=16 @rva=785184
	//_Func: public HWND__ * getHwnd(); @virtual vtpo=0 vfid=0 @loc=static @len=8 @rva=785168
	//_Func: public HINSTANCE__ * getHInstance(); @virtual vtpo=0 vfid=1 @loc=static @len=8 @rva=785152
	//_Func: public void setABS(float value); @virtual vtpo=0 vfid=2 @loc=static @len=62 @rva=785200
	//_Func: public void setTC(float value); @virtual vtpo=0 vfid=3 @loc=static @len=62 @rva=785856
	//_Func: public void setStabilityControl(float value); @virtual vtpo=0 vfid=4 @loc=static @len=13 @rva=785440
	//_Func: public void setIdealLine(bool value, bool isFromPhysicsThread); @virtual vtpo=0 vfid=5 @loc=static @len=137 @rva=785296
	//_Func: public void setAutoShift(bool value); @virtual vtpo=0 vfid=6 @loc=static @len=11 @rva=785264
	//_Func: public void setBrakeBias(float value); @virtual vtpo=0 vfid=7 @loc=static @len=13 @rva=785280
	//_Func: public void setSystemMessage(wchar_t * message, wchar_t * description, bool isFromPhysicsThread); @virtual vtpo=0 vfid=8 @loc=static @len=388 @rva=785456
	//_Data: this+0x28, Member, Type: struct HINSTANCE__ *, hModule
	//_Data: this+0x30, Member, Type: function  *, getName
	//_Data: this+0x38, Member, Type: function  *, init
	//_Data: this+0x40, Member, Type: function  *, shutdown
	//_Data: this+0x48, Member, Type: function  *, p_update
	//_Data: this+0x50, Member, Type: function  *, p_onGui
	//_Data: this+0x58, Member, Type: function  *, getControls
	//_Data: this+0x60, Member, Type: class CarAvatar *, carAvatar
	//_Data: this+0x68, Member, Type: class Car *, car
	//_Data: this+0x70, Member, Type: class Sim *, sim
	//_Func: public ACPlugin & operator=(ACPlugin &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @intro @virtual vtpo=0 vfid=9 @loc=optimized @len=0 @rva=0
//UDT;

class ACPlugin : public IACPPluginHost {
public:
	std::basic_string<wchar_t,std::char_traits<wchar_t>,std::allocator<wchar_t> > name;
	HINSTANCE__ * hModule;
	void * getName;
	void * init;
	void * shutdown;
	void * p_update;
	void * p_onGui;
	void * getControls;
	CarAvatar * carAvatar;
	Car * car;
	Sim * sim;
	inline ACPlugin()  { }
	inline void ctor(Sim * aSim, HINSTANCE__ * module) { typedef void (*_fpt)(ACPlugin *pthis, Sim *, HINSTANCE__ *); _fpt _f=(_fpt)_drva(784032); _f(this, aSim, module); }
	virtual ~ACPlugin();
	inline void dtor() { typedef void (*_fpt)(ACPlugin *pthis); _fpt _f=(_fpt)_drva(784720); _f(this); }
	inline void update(ACCarState * state, float dt) { typedef void (*_fpt)(ACPlugin *pthis, ACCarState *, float); _fpt _f=(_fpt)_drva(785920); return _f(this, state, dt); }
	inline void onGui(ACPluginContext * cc) { typedef void (*_fpt)(ACPlugin *pthis, ACPluginContext *); _fpt _f=(_fpt)_drva(785184); return _f(this, cc); }
	virtual HWND__ * getHwnd_vf0();
	inline HWND__ * getHwnd_impl() { typedef HWND__ * (*_fpt)(ACPlugin *pthis); _fpt _f=(_fpt)_drva(785168); return _f(this); }
	inline HWND__ * getHwnd() { return getHwnd_vf0(); }
	virtual HINSTANCE__ * getHInstance_vf1();
	inline HINSTANCE__ * getHInstance_impl() { typedef HINSTANCE__ * (*_fpt)(ACPlugin *pthis); _fpt _f=(_fpt)_drva(785152); return _f(this); }
	inline HINSTANCE__ * getHInstance() { return getHInstance_vf1(); }
	virtual void setABS_vf2(float value);
	inline void setABS_impl(float value) { typedef void (*_fpt)(ACPlugin *pthis, float); _fpt _f=(_fpt)_drva(785200); return _f(this, value); }
	inline void setABS(float value) { return setABS_vf2(value); }
	virtual void setTC_vf3(float value);
	inline void setTC_impl(float value) { typedef void (*_fpt)(ACPlugin *pthis, float); _fpt _f=(_fpt)_drva(785856); return _f(this, value); }
	inline void setTC(float value) { return setTC_vf3(value); }
	virtual void setStabilityControl_vf4(float value);
	inline void setStabilityControl_impl(float value) { typedef void (*_fpt)(ACPlugin *pthis, float); _fpt _f=(_fpt)_drva(785440); return _f(this, value); }
	inline void setStabilityControl(float value) { return setStabilityControl_vf4(value); }
	virtual void setIdealLine_vf5(bool value, bool isFromPhysicsThread);
	inline void setIdealLine_impl(bool value, bool isFromPhysicsThread) { typedef void (*_fpt)(ACPlugin *pthis, bool, bool); _fpt _f=(_fpt)_drva(785296); return _f(this, value, isFromPhysicsThread); }
	inline void setIdealLine(bool value, bool isFromPhysicsThread) { return setIdealLine_vf5(value, isFromPhysicsThread); }
	virtual void setAutoShift_vf6(bool value);
	inline void setAutoShift_impl(bool value) { typedef void (*_fpt)(ACPlugin *pthis, bool); _fpt _f=(_fpt)_drva(785264); return _f(this, value); }
	inline void setAutoShift(bool value) { return setAutoShift_vf6(value); }
	virtual void setBrakeBias_vf7(float value);
	inline void setBrakeBias_impl(float value) { typedef void (*_fpt)(ACPlugin *pthis, float); _fpt _f=(_fpt)_drva(785280); return _f(this, value); }
	inline void setBrakeBias(float value) { return setBrakeBias_vf7(value); }
	virtual void setSystemMessage_vf8(wchar_t * message, wchar_t * description, bool isFromPhysicsThread);
	inline void setSystemMessage_impl(wchar_t * message, wchar_t * description, bool isFromPhysicsThread) { typedef void (*_fpt)(ACPlugin *pthis, wchar_t *, wchar_t *, bool); _fpt _f=(_fpt)_drva(785456); return _f(this, message, description, isFromPhysicsThread); }
	inline void setSystemMessage(wchar_t * message, wchar_t * description, bool isFromPhysicsThread) { return setSystemMessage_vf8(message, description, isFromPhysicsThread); }
	inline void _guard_obj() {
		static_assert((sizeof(ACPlugin)==120),"bad size");
		static_assert((offsetof(ACPlugin,name)==0x8),"bad off");
		static_assert((offsetof(ACPlugin,hModule)==0x28),"bad off");
		static_assert((offsetof(ACPlugin,getName)==0x30),"bad off");
		static_assert((offsetof(ACPlugin,init)==0x38),"bad off");
		static_assert((offsetof(ACPlugin,shutdown)==0x40),"bad off");
		static_assert((offsetof(ACPlugin,p_update)==0x48),"bad off");
		static_assert((offsetof(ACPlugin,p_onGui)==0x50),"bad off");
		static_assert((offsetof(ACPlugin,getControls)==0x58),"bad off");
		static_assert((offsetof(ACPlugin,carAvatar)==0x60),"bad off");
		static_assert((offsetof(ACPlugin,car)==0x68),"bad off");
		static_assert((offsetof(ACPlugin,sim)==0x70),"bad off");
	};
};

//UDT: struct ClutchSequence @len=136
	//_Func: public void ClutchSequence(ClutchSequence &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void ClutchSequence(Curve & c); @loc=static @len=154 @rva=2851616
	//_Func: public void ClutchSequence(); @loc=optimized @len=0 @rva=0
	//_Data: this+0x0, Member, Type: class Curve, clutchCurve
	//_Data: this+0x80, Member, Type: float, currentTime
	//_Data: this+0x84, Member, Type: bool, isDone
	//_Func: public void ~ClutchSequence(); @loc=static @len=5 @rva=1258144
	//_Func: public ClutchSequence & operator=(ClutchSequence & __that); @loc=static @len=132 @rva=2851840
	//_Func: public void * __vecDelDtor(unsigned int  _arg0); @loc=optimized @len=0 @rva=0
//UDT;

struct ClutchSequence {
public:
	Curve clutchCurve;
	float currentTime;
	bool isDone;
	inline ClutchSequence()  { }
	inline void ctor(Curve & c) { typedef void (*_fpt)(ClutchSequence *pthis, Curve &); _fpt _f=(_fpt)_drva(2851616); _f(this, c); }
	inline void dtor() { typedef void (*_fpt)(ClutchSequence *pthis); _fpt _f=(_fpt)_drva(1258144); _f(this); }
	inline ClutchSequence & operator=(ClutchSequence & __that) { typedef ClutchSequence & (*_fpt)(ClutchSequence *pthis, ClutchSequence &); _fpt _f=(_fpt)_drva(2851840); return _f(this, __that); }
	inline void _guard_obj() {
		static_assert((sizeof(ClutchSequence)==136),"bad size");
		static_assert((offsetof(ClutchSequence,clutchCurve)==0x0),"bad off");
		static_assert((offsetof(ClutchSequence,currentTime)==0x80),"bad off");
		static_assert((offsetof(ClutchSequence,isDone)==0x84),"bad off");
	};
};

//UDT: struct acEngineData @len=296
	//_Func: public void acEngineData(acEngineData &  _arg0); @loc=optimized @len=0 @rva=0
	//_Func: public void acEngineData(); @loc=static @len=125 @rva=2643104
	//_Data: this+0x0, Member, Type: class Curve, powerCurve
	//_Data: this+0x80, Member, Type: class Curve, coastCurve
	//_Data: this+0x100, Member, Type: float, coast2
	//_Data: this+0x104, Member, Type: float, coast1
	//_Data: this+0x108, Member, Type: float, coast0
	//_Data: this+0x10C, Member, Type: bool, useCoastCurve
	//_Data: this+0x110, Member, Type: int, minimum
	//_Data: this+0x114, Member, Type: int, limiter
	//_Data: this+0x118, Member, Type: int, limiterCycles
	//_Data: this+0x11C, Member, Type: float, overlapFreq
